{"id": "amumu", "name": "Amumu Champion Page", "locale": "en_us", "champion": {"release-date": "2009-06-26", "slug": "amumu", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Amumu_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 946, "y": 75, "featured-champions": []}, "video": null, "associated-faction-slug": "shurima", "roles": [{"name": "Tank", "slug": "tank"}, {"name": "Mage", "slug": "mage"}], "name": "Amumu", "title": "the Sad Mummy", "game-info-url": "http://gameinfo.na.leagueoflegends.com/en/game-info/champions/amumu", "biography": {"full": "<p>A lonely and melancholy soul from ancient Shurima, Amumu roams the world in search of a friend. Cursed by an ancient spell, he is doomed to remain alone forever, as his touch is death and his affection ruin. Those who claim to have seen him describe Amumu as a living cadaver, small in stature and covered in bandages the color of lichen. Amumu has inspired myths, folklore, and legends told and retold for generations – such that it is impossible to separate truth from fiction.</p><p>The hardy folk of Shurima agree upon certain things: the wind always blows from the west in the morning; a full belly on a new moon is an ill omen; buried treasure hides under the heaviest of rocks. They do not agree, however, about the tale of Amumu.</p><p>One oft-told story links Amumu to the first great ruling family of Shurima who succumbed to a disease that corrupted flesh with hideous speed. The youngest child, Amumu, was quarantined in his chambers and befriended a servant girl who heard his cries through the walls. She regaled the lonely heir with courtly news and stories of her grandmother’s mystic powers.</p><p>One morning, the girl brought word that Amumu’s last remaining brother had passed away, making him Emperor of Shurima. Saddened that he had to bear this news alone, she unlocked his door and ran inside to comfort him face to face. Amumu threw his arms around her, but as they touched, he fell back, realizing he had condemned her to the same terrible fate as his family.</p><p>Upon the girl’s death, her grandmother placed a twisted blight on the young emperor. In her mind, Amumu had as good as murdered her kin. As the curse took effect, Amumu was trapped in his moment of suffering like a locust ensnared in honeyed amber.</p><p>A second tale whispers of another crown prince, one given to bouts of petulance, cruelty, and murderous vanity. In this telling, Amumu was crowned Emperor of Shurima at a young age, and convinced he was blessed by the sun, he forced his subjects to worship him as a god.</p><p>Amumu sought the fabled Eye of Angor, an ancient relic entombed in a gilded crypt, said to grant eternal life to whoever looked upon it with an unflinching heart. He hunted the treasure for years with a host of slaves who carried him through labyrinthine catacombs, sacrificing themselves to traps so the emperor could continue without hindrance. Amumu finally reached the cyclopean golden archway, where upon dozens of his stonemasons labored to breach the sealed door.</p><p>As the young emperor rushed within, determined to look into the Eye of Angor, his slaves seized their chance and sealed the stone doorway behind him. Some say the child emperor endured in the darkness for years, his loneliness driving him to insanity and causing him to claw at his own skin, which he was forced to wrap in bandages. His life was extended by the power of the Eye as he meditated on his past transgressions, but the gift was a double edged sword, for he was cursed to remain forever alone.</p><p>When a series of devastating earthquakes shattered the foundations of his tomb, the emperor escaped with no knowledge of how much time had passed, seeking to undo the suffering he had caused in life.</p><p>Yet another story of Amumu tells of the first and last Yordle ruler of Shurima, who believed in the innate goodness of the human heart. To prove his detractors wrong, he swore an oath to live as a beggar until he made one true friend, convinced his people would rally to help their fellow Shuriman.</p><p>Though thousands walked by the disheveled Yordle, not one stopped to offer a helping hand. Amumu’s sadness grew until he eventually died of a broken heart. But his death was not the end, for some swear the Yordle still wanders the desert, forever searching for someone who might restore his faith in humanity.</p><p>These stories, despite their differences, are woven with parallels. Whatever the circumstances, Amumu is doomed to exist in a broken state of emptiness, eternally alone and friendless. Fated to forever search for a companion, his presence is cursed and his touch is death. On long winter nights when the fire is never allowed to burn low, the sad mummy can sometimes be heard weeping in the desert, despairing that he’ll never know the solace of friendship.</p><p>Whatever Amumu searches for – atonement, kinship, or a single act of kindness – one thing is as certain as the western wind at dawn: he has yet to find it.</p>", "short": "Legend claims that Amumu is a lonely and melancholy soul from ancient Shurima, roaming the world in search of a friend. Doomed by an ancient curse to remain alone forever, his touch is death, his affection ruin. Those who claim to have seen him describe a living cadaver, small in stature and wrapped in creeping bandages. Amumu has inspired myths, songs, and folklore told and retold for generations—such that it is impossible to separate truth from fiction.", "quote": "“Solitude can be lonelier than death.”", "quote-author": ""}, "bioImage": null, "headerImage": null}, "related-champions": [], "explore-champions": [], "modules": [{"slug": "amumu-music-video", "section-title": "Music Video", "type": "featured-video", "featured-image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/featuredvideocover/amumu-music-video.jpg", "encoding": "image/jpeg", "width": 1920, "height": 1080, "x": 897, "y": 458, "featured-champions": []}, "title": "The Curse of the Sad Mummy", "subtitle": "", "description": "Every child in Valoran has heard the tale before. About the cursed mummy boy who felt his heart no more.", "video": {"type": "video", "title": "", "subtitle": "", "description": [], "uri": "https://www.youtube.com/watch?v=0AvWV6Mk374", "width": "", "height": "", "x": "", "y": "", "featured-champions": [{"type": "champion", "release-date": "2009-06-26", "name": "Amumu", "slug": "amumu", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Amumu_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 946, "y": 75, "featured-champions": []}, "role": [{"name": "Tank", "slug": "tank"}, {"name": "Mage", "slug": "mage"}]}]}, "blackout": null, "release-date": "2015-01-26T08:00:00.000Z", "video-type": "music-video"}, {"type": "story-preview", "title": "Greed and Tears", "subtitle": null, "description": "<p>“The gods were angry, and shook the land. Cracks rent the earth,” said old Khaldun, his crag-featured face lit by firelight. “It was into one of these fissures that a young man ventured. He found an opening; the entrance to a tomb, hidden for the Jackal knows how long. The man had little ones to feed and a wife to please, and so he ventured in, lured by opportunity.”</p>", "story-slug": "amumu-color-story", "featured-image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Amumu_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 946, "y": 75, "featured-champions": []}, "background": {"type": "image", "title": {"cs_cz": "Údolí písně", "de_de": "Das Tal der Lieder", "el_gr": "Τραγουδιστή Κοιλάδα", "en_au": "The Valley of the Song", "en_gb": "The Valley of the Song", "en_ph": "The Valley of the Song", "en_pl": "The Valley of the Song", "en_sg": "The Valley of the Song", "en_us": "The Valley of the Song", "es_ar": "El Valle de la Canción", "es_es": "El valle de la canción", "es_mx": "El Valle de la Canción", "fr_fr": "Vallée des chants", "hu_hu": "A Dal völgye", "id_id": "The Valley of the Song", "it_it": "La Valle del Canto", "ja_jp": "歌の峡谷", "ko_kr": "휘파람 계곡", "ms_my": "The Valley of the Song", "pl_pl": "Dolina Pieśni", "pt_br": "O Vale da Canção", "ro_ro": "Valea Cântecului", "ru_ru": "Долина песни", "th_th": "ช่องแคบคีตา", "tr_tr": "ŞARKI VADİSİ", "vn_vn": "Thung lũng Hát Ca", "zh_cn": "吟歌谷", "zh_tw": "鳴谷"}, "subtitle": "", "description": {"cs_cz": "Tento odlehlý průsmyk byl pojmenován podle dezorientujícího pískání, k němuž dochází, když vítr dostatečně silně duje skrz díry ve skalách. Mnozí neopatrní poutníci se stali kořistí ohluchlých lapků, kteří se v noci plíží zdejším údolím.", "de_de": "Dieser entlegene Pass entlehnt seinen Namen dem verwirrenden Pfeifen, das entsteht, wenn der Wind stark genug durch die ausgehöhlten Felsstrukturen weht. Viele nichtsahnende Reisende fanden sich der Gnade tauber Marodeure ausgeliefert, die das Tal bei Nacht durchstreifen.", "el_gr": "Αυτό το μακρινό πέρασμα παίρνει το όνομά του από το ενοχλητικό σφύριγμα που γεμίζει τον αέρα όταν ο άνεμος φυσάει αρκετά δυνατά μέσα από τους σχηματισμούς από κούφιο βράχο. Πολλοί ανυποψίαστοι ταξιδιώτες έχουν πέσει θύματα των κουφών επιδρομέων που καραδοκούν στην κοιλάδα τη νύχτα.", "en_au": "This remote pass takes its name from the disorienting whistling that results when the wind blows hard enough through the hollow rock structures. Many unwary travelers have found themselves at the mercy of the deafened marauders who prowl the valley by night.", "en_gb": "This remote pass takes its name from the disorienting whistling that results when the wind blows hard enough through the hollow rock structures. Many unwary travelers have found themselves at the mercy of the deafened marauders who prowl the valley by night.", "en_ph": "This remote pass takes its name from the disorienting whistling that results when the wind blows hard enough through the hollow rock structures. Many unwary travelers have found themselves at the mercy of the deafened marauders who prowl the valley by night.", "en_pl": "This remote pass takes its name from the disorienting whistling that results when the wind blows hard enough through the hollow rock structures. Many unwary travelers have found themselves at the mercy of the deafened marauders who prowl the valley by night.", "en_sg": "This remote pass takes its name from the disorienting whistling that results when the wind blows hard enough through the hollow rock structures. Many unwary travelers have found themselves at the mercy of the deafened marauders who prowl the valley by night.", "en_us": "This remote pass takes its name from the disorienting whistling that results when the wind blows hard enough through the hollow rock structures. Many unwary travelers have found themselves at the mercy of the deafened marauders who prowl the valley by night.", "es_ar": "Este paso remoto adquirió su nombre por los silbidos desorientadores que resuenan cuando el viento sopla con fuerza a través de las estructuras rocosas huecas. Muchos viajeros incautos se han encontrado a la merced de los merodeadores ensordecidos que acechan el valle durante las noches.", "es_es": "Este remoto desfiladero toma su nombre del desconcertante silbido que produce el viento cuando sopla a través de las estructuras de roca huecas. Son muchos los viajeros incautos que caen en manos de los maleantes que merodean por el valle de noche.", "es_mx": "Este paso remoto adquirió su nombre por los silbidos desorientadores que resuenan cuando el viento sopla con fuerza a través de las estructuras rocosas huecas. Muchos viajeros incautos se han encontrado a la merced de los merodeadores ensordecidos que acechan el valle durante las noches.", "fr_fr": "Cette passe lointaine tire son nom des sifflements que le vent émet en traversant les couloirs des amas de roc évidés par l'érosion et qui désorientent ceux qui passent. Nombre de voyageurs imprudents se retrouvent à la merci de maraudeurs sourds qui rôdent la nuit dans la vallée.", "hu_hu": "Ez a félreeső átkelő nevét a tájékozódást is megzavaró fütyülő hangról kapta, amely akkor hallható, ha az üreges sziklákon átfújó szél elég erős. Sok óvatlan utazó találta már magát a völgyben éjszaka portyázó süket martalócok karmai közt.", "id_id": "This remote pass takes its name from the disorienting whistling that results when the wind blows hard enough through the hollow rock structures. Many unwary travelers have found themselves at the mercy of the deafened marauders who prowl the valley by night.", "it_it": "Questo luogo remoto deve il suo nome agli strani fischi che il vento forte genera passando fra le rocce cave. Molti ignari viaggiatori si sono ritrovati alla mercé dei predoni assordati che imperversavano di notte nella vallata.", "ja_jp": "この人里離れた山道は、空洞を持つ岩々の間に強い風が吹くと、方向感覚を狂わせる笛を吹くような音がすることからその名前が付けられた。何も知らない旅人の多くが、夜に峡谷を徘徊する聴覚を失った略奪者たちの餌食となる。", "ko_kr": "이 외진 산길에 있는 암석 구조물의 구멍 사이로 거센 바람이 휘몰아치면 방향 감각을 잃게 하는 휘파람 소리가 들려옵니다. 방심한 많은 여행자들이 한밤중에 계곡을 어슬렁거리는 귀머거리 약탈자들의 희생양이 되었습니다.", "ms_my": "This remote pass takes its name from the disorienting whistling that results when the wind blows hard enough through the hollow rock structures. Many unwary travelers have found themselves at the mercy of the deafened marauders who prowl the valley by night.", "pl_pl": "Ten odległy przesmyk wziął swoją nazwę z dezorientującego gwizdu, który można usłyszeć, gdy wiatr wieje z odpowiednią siłą przez puste struktury skalne. Wielu nieuważnych podróżników było zdanych na łaskę przygłuchych awanturników grasujących po dolinie w nocy.", "pt_br": "O nome desta passagem remota vem dos assobios desorientadores que surgem quando o vento passa forte o suficiente pelas estruturas ocas de pedra. Muitos viajantes desavisados se viram à mercê dos saqueadores surdos que espreitam o vale durante a noite.", "ro_ro": "Numele acestei trecători izolate vine de la șuieratul derutant care apare atunci când vântul bate suficient de tare printre stâncile sale găunoase. Mulți călători neatenți le-au căzut pradă bandiților surzi care cutreieră valea pe timpul nopții.", "ru_ru": "Своим названием этот проход в горах обязан свисту ветра в полых скалах. Этот свист сбивает с толку, и многие путники становятся жертвами рыщущих здесь по ночам уже оглохших бандитов.", "th_th": "ช่องแคบนี้ได้ชื่อมาจากเสียงหวีดหวิวซึ่งเกิดจากลมแรงที่พัดผ่านโพรงหิน นักเดินทางที่ไม่ระวังตนจำนวนมากมักพบว่าตัวเองกลายเป็นเหยื่อของโจรปล้นสะดมผู้ออกหาเหยื่อในยามราตรี", "tr_tr": "Bu tenha geçit, adını rüzgâr sert estiği zamanlarda kayalardaki boşlukların çıkardığı sersemletici seslerden alıyor. Yöreyi bilmeyen pek çok gezgin, geceleri vadide gezinen sağır yağmacıların eline düşüyor.", "vn_vn": "Nó có tên như vậy bởi gió thổi qua kết cấu đá rỗng đặc thù tạo thành tiếng huýt sáo. Nhiều lữ khách bất cẩn đã rơi vào tay đám giặc cướp rình rập trong thung lũng lúc đêm tối.", "zh_cn": "这条偏远的道路上有不少空洞的山岩，劲风吹过时会发出幽咽的哨音，因此而得名。粗心的旅人们会落入在夜间游荡的失聪的劫掠者之手。", "zh_tw": "這條偏僻的路線之所以取其名，是因為強風吹過岩石之間的縫隙時會發出使人分心的口哨聲。許多旅行者在夜裡經常掉以輕心，一個不小心就被在這裡埋伏的盜匪襲擊。"}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/shurima_valley_01.jpg", "encoding": "image/jpeg", "width": null, "height": null, "x": null, "y": null, "featured-champions": []}, "url": "/en_us/story/amumu-color-story", "release-date": "2016-05-11T08:00:00.000Z", "featured-champions": [{"type": "champion", "release-date": "2009-06-26", "name": "Amumu", "slug": "amumu", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Amumu_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 946, "y": 75, "featured-champions": []}, "role": [{"name": "Tank", "slug": "tank"}, {"name": "Mage", "slug": "mage"}]}], "word-count": 1223, "minutes-to-read": 5}, {"section-title": "", "type": "image-gallery", "isFanArt": false, "fan-art-url": "", "featured-image": "", "title": "", "subtitle": "", "description": "", "assets": [{"type": "image", "title": {"cs_cz": "Různé varianty Amumuových emocí", "de_de": "Amumu – Experimentelle Emotionen", "el_gr": "Πειραματισμοί εκφράσεων του Αμούμου", "en_au": "Amumu emotion exploration", "en_gb": "Amumu emotion exploration", "en_ph": "Amumu emotion exploration", "en_pl": "Amumu emotion exploration", "en_sg": "Amumu emotion exploration", "en_us": "Amumu emotion exploration", "es_ar": "Exploración de las emociones de Amumu", "es_es": "Exploración de las emociones de Amumu", "es_mx": "Exploración de las emociones de Amumu", "fr_fr": "Exploration des émotions d'Amumu", "hu_hu": "Amumu érzelemváltozatai", "id_id": "Eksplorasi Emosi Amumu", "it_it": "Studio per le emozioni di Amumu", "ja_jp": "アムム 感情 バリエーション", "ko_kr": "아무무 감정표현 구상", "ms_my": "Penerokaan emosi Amumu", "pl_pl": "Amumu — poznawanie emocji", "pt_br": "Exploração de emoções do Amumu", "ro_ro": "Amumu – studiu emoții", "ru_ru": "Экспериментальный вариант эмоций Амуму", "th_th": "การสำรวจการแสดงท่าทางของ Amumu", "tr_tr": "Amumu duygu denemeleri", "vn_vn": "Khám phá - Biểu cảm của Amumu", "zh_cn": "阿木木表情探索", "zh_tw": "探索 阿姆姆情緒"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/image-gallery/amumu_sadmummy.jpg", "encoding": "image/jpeg", "width": 765, "height": 1080, "x": 629, "y": 464, "featured-champions": []}], "featured-champions": [{"type": "champion", "release-date": "2009-06-26", "name": "Amumu", "slug": "amumu", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Amumu_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 946, "y": 75, "featured-champions": []}, "role": [{"name": "Tank", "slug": "tank"}, {"name": "Mage", "slug": "mage"}]}]}]}