{"id": "azir", "name": "Azir Champion Page", "locale": "en_us", "champion": {"release-date": "2014-09-16", "slug": "azir", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Azir_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1026, "y": 96, "featured-champions": []}, "video": {"type": "video", "title": "", "subtitle": "", "description": {"en_us": ""}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/videos/azir-splashvideo.webm", "width": 1280, "height": 720, "x": 1026, "y": 96, "featured-champions": []}, "associated-faction-slug": "shurima", "roles": [{"name": "Mage", "slug": "mage"}, {"name": "Marksman", "slug": "marksman"}], "name": "Azir", "title": "the Emperor of the Sands", "game-info-url": "http://gameinfo.na.leagueoflegends.com/en/game-info/champions/azir", "biography": {"full": "<p>Azir was a mortal emperor of Shurima in a far distant age, a proud man who stood at the cusp of immortality. His hubris saw him betrayed and murdered at the moment of his greatest triumph, but now, millennia later, he has been reborn as an Ascended being of immense power. With his buried city risen from the sand, Azir seeks to restore Shurima to its former glory.</p><p>Thousands of years ago, the Shuriman empire was a sprawling realm of vassal states conquered by powerful armies led by all but invincible warriors known as the Ascended. Ruled by an ambitious and power hungry emperor, Shurima was the greatest realm of its day; a fertile land blessed by the power of the sun that shone from a great golden disc floating atop the temple at the heart of its capital.</p><p>The youngest and least-favored son of the emperor, Azir was never destined for greatness. With so many siblings ahead of him, he would never be emperor. Most likely he would take up a position in the priesthood or as governor of some backwater province. He was a slender, studious boy who spent more time perusing the texts collected in the Great Library of Nasus than training to fight under the stern tutelage of the Ascended hero, Renekton.</p><p>Amid the twisting shelves of scrolls, books and tablets, Azir met a young slave boy who visited the library almost every day in search of texts desired by his master. Slaves in Shurima were forbidden to take names, but as the two boys became friends, Azir broke that law and called his new friend Xerath, which means ‘one who shares.’ He appointed Xerath - though he was careful never to endanger him by naming him publicly - as his personal slave and the two boys shared their love of history by learning all they could of Shurima’s past and its long legacy of Ascended heroes.</p><p>While traveling with his father, brothers and Renekton on the yearly tour of the empire, the royal caravan stopped at a well-known oasis for the night. Azir and Xerath stole away in the middle of the night to draw the stars and add their own celestial maps to those they had studied in the Great Library. While they drew the patterns of constellations, the royal caravan was attacked by a cabal of assassins sent by the emperor’s enemies. One of the assassins found the two boys out in the desert and was poised to cut Azir’s throat when Xerath intervened, throwing himself upon the assassin’s back. In the ensuing melee, Azir freed his dagger and plunged it into his attacker’s throat.</p><p>Azir took up the dead man’s sword and rushed back to the oasis, but by the time he returned, the assassins were already defeated. Renekton had protected the emperor and slain the attackers, but Azir’s brothers were all dead. Azir told his father of Xerath’s courage and asked him to reward the slave boy, but his words fell on deaf ears. In the emperor’s eyes, the boy was a slave and beneath his notice, but Azir swore that one day he and Xerath would be brothers.</p><p>The emperor returned to his capital, with the fifteen year old Azir now his heir, and unleashed a merciless campaign of bloodshed against those he believed had sent the assassins. Shurima descended into years of paranoia and murder as the emperor took revenge on any he suspected of treason. Though he was now heir to the throne, Azir’s life yet hung by a thread. His father hated him - wishing he had died instead of his brothers - and the queen was still young enough to bear sons.</p><p>Azir trained in combat, for the attack at the oasis had revealed how little he knew of the deadly arts. Renekton took up the task of teaching the growing prince, and under his aegis, Azir learned to wield sword and spear, to command warriors, and to read the ebb and flow of battle. The young heir elevated Xerath, his only trusted confidant, and made him his right hand man. To better counsel him, Azir tasked Xerath with seeking out knowledge wherever he could find it.</p><p>Years passed, but the queen was never able to carry a child to term, every conceived infant perishing before it could be born. So long as the queen remained barren, Azir’s life was relatively safe. Some around the court believed a curse was at work and a few even whispered the young heir’s name in connection with this – though Azir claimed innocence and even executed some who dared voice such accusations openly.</p><p>Eventually, the queen bore a healthy son, but on the night of his birth a terrible storm engulfed Shurima. The queen’s chambers were struck again and again by powerful bolts of lightning, and in the subsequent blaze, both the queen and her newborn son were killed. It was said the emperor went mad with grief and took his own life upon hearing the news, but tales soon spread of how he and his guards had been found lying in pieces on the palace floor, their bodies little more than charred skeletons.</p><p>Azir was shocked by their deaths, but the empire needed a leader, and with Xerath at his side he took control of Shurima as its emperor. Over the next decade, he expanded Shurima’s borders and ruled with a harsh, but just hand. He instituted reforms to better the lives of slaves and privately developed a plan to overturn millennia of tradition and eventually free them all. He kept his plans secret, even from Xerath, and the issue of slavery would prove to be a continual bone of contention between them. The empire had been built on the back of slavery, and many of the great noble houses depended on enforced labor for their vast wealth and power. Such monolithic institutions could not be overturned overnight, and Azir’s plans would be undone were they to become common knowledge. Despite Azir’s desire to name Xerath his brother, he could not do so until all Shurima’s slaves were free.</p><p>Through these years, Xerath protected Azir from his political rivals and guided the expansion of the empire. Azir married and fathered numerous children, some by wedlock, others by ill-advised liaisons with slaves and harem girls. Xerath stoked the emperor’s grand vision of an empire greater than any the world had ever known. But to stand as ruler over the entire world, Xerath convinced Azir that he would need to be all but invincible, a god amongst men – an Ascended being.</p><p>As the kingdom reached the zenith of its power, Azir announced he would undertake the Ascension ritual, that the time was right for him to take his place alongside Nasus and Renekton and their glorious forebears. Many questioned this decision; the Ascension ritual was highly dangerous and intended only for those near the end of their lives, those who had devoted their lives to Shurima and whose service was to be honored with Ascension. It was for the Sun Priests to decree who would be blessed with Ascension, not the hubris of an emperor to bestow it upon himself. Azir would not be dissuaded from his rash course of action, for his arrogance had grown along with his empire, and he ordered them to comply on pain of death.</p><p>The day of the ritual finally came and Azir marched toward the Dais of Ascension, flanked by thousands of his warriors and tens of thousands of his subjects. The brothers Renekton and Nasus were absent, having been dispatched by Xerath to deal with an emergent threat, but still Azir would not turn from what he saw as his great destiny. He climbed to the great golden disc atop the temple at the heart of the city and in the moments before the sun priests began the ritual, he turned to Xerath and finally freed him. And not just him, but all slaves…</p><p>Xerath was stunned into speechlessness, but Azir was not yet done. He embraced Xerath and named him his eternal brother, as he had promised he would all those years ago. Azir turned as the priests began the ritual to bring down the awesome power of the sun. Azir was unaware that Xerath had studied more than just history and philosophy in his quest for knowledge. He had learned the dark arts of sorcery, all the while nursing a desire for freedom that had grown like a cancer into a burning hatred.</p><p>At the height of the ritual, the former slave unleashed his powers and Azir was blasted from his place on the dais. Without the protection of the runic circle, Azir was consumed by the sun’s fire as Xerath took his place. The light filled Xerath with power, and he roared as his mortal body began to transform.</p><p>But the magic of the ritual was not intended for Xerath, and such awesomely powerful celestial energies could not be diverted without dire consequence. The power of the Ascension ritual exploded outward, devastating Shurima and laying waste to the city. Its people burned to ash and its towering palaces fell to ruin as the desert sands rose up to swallow the city. The sun disc sank from the sky and what had taken centuries to build was brought to ruin in an instant by one man’s ambition and another’s misplaced hate. All that remained of Azir’s city were sunken ruins and echoes of its people’s screams on the night winds.</p><p>Azir saw none of this. For him, all was nothingness. His last memories were of pain and fire; he knew nothing of what befell him atop the temple, nor what became of his empire. He remained lost in timeless oblivion until, thousands of years after Shurima’s doom, the blood of his last descendant spilled onto the temple ruins and resurrected him. Azir was reborn, but was yet incomplete; his body little more than animate dust given form, held together by the last vestiges of his indomitable will.</p><p>Gradually resuming his corporeal form, Azir stumbled through the ruins and came across the corpse of a woman with a treacherous knife wound in her back. He did not know her, but saw in her features the distant echo of his bloodline. All thoughts of empires and power were forgotten as he lifted this daughter of Shurima and bore her to what had once been the Oasis of the Dawn. The oasis was empty and dry, but with every step Azir took, clear water began filling the rocky basin. Azir immersed the woman’s body in the restorative waters of the oasis and as the blood washed away, only a faint scar remained where the blade had pierced her.</p><p>And with that act of selflessness, Azir was lifted up in a column of fire as the magic of Shurima renewed him, remaking him as the Ascended being he was meant to become. The sun’s immortal radiance poured into him, crafting his magnificent, hawk-armored form and granting him the power to command the very sand itself. Azir lifted his arms and his ruined city shrugged off the dust of centuries spent beneath the desert to rise anew. The sun disc lifted into the sky once more, and healing waters flowed between temples heaving themselves back into the light at the emperor’s command.</p><p>Azir climbed the steps of the newly-risen sun temple, weaving the desert winds to recreate the city’s last moments. Ghosts formed of sand relived his city’s last moments from long ago, and Azir watched in horror as Xerath’s treachery unfolded. He wept as he saw his family murdered, his empire fall and his power stolen. Only now, millennia too late, did he finally understand the depths of hatred harbored by his former friend and ally. With the power and prescience of an Ascended being, Azir sensed Xerath somewhere abroad in the world and summoned an army of sand warriors to march alongside their reborn emperor. As the sun blazed from the golden disc above him, Azir swore a mighty oath.</p><p>I will reclaim my lands and take back what was mine!</p>", "short": "Azir was a mortal emperor of Shurima in a far distant age, a proud man who stood at the cusp of immortality. His hubris saw him betrayed and murdered at the moment of his greatest triumph, but now, millennia later, he has been reborn as an Ascended being of immense power. With his buried city risen from the sand, Azir seeks to restore Shurima to its former glory.", "quote": "“Shurima was once the glory of Runeterra. I will make it so again.”", "quote-author": ""}, "bioImage": null, "headerImage": null}, "related-champions": [{"type": "champion", "release-date": "2009-10-01", "name": "Nasus", "slug": "nasus", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Nasus_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 889, "y": 40, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}, {"type": "champion", "release-date": "2009-02-21", "name": "Sivir", "slug": "sivir", "echelon": 1, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Sivir_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 774, "y": 145, "featured-champions": []}, "role": [{"name": "Marksman", "slug": "marksman"}]}, {"type": "champion", "release-date": "2011-10-05", "name": "Xerath", "slug": "xerath", "echelon": 2, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Xerath_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 701, "y": 23, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Assassin", "slug": "assassin"}]}, {"type": "champion", "release-date": "2011-01-18", "name": "Renekton", "slug": "renekton", "echelon": 3, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Renekton_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 801, "y": 6, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}, {"type": "champion", "release-date": "2016-05-18", "name": "Taliyah", "slug": "taliyah", "echelon": 4, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Taliyah_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1063, "y": 0, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Support", "slug": "support"}]}, {"type": "champion", "release-date": "2010-12-14", "name": "Cassiopeia", "slug": "cassiopeia", "echelon": 5, "associated-faction": "", "associated-faction-slug": "noxus", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Cassiopeia_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 847, "y": 55, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}]}], "explore-champions": [], "modules": [{"type": "story-preview", "title": "Arisen", "subtitle": null, "description": "<p>Azir walked the gold-paved Emperor’s Way. The immense statues of Shurima’s earliest rulers – his ancestors – watched his progress.</p>", "story-slug": "azir-color-story", "featured-image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Azir_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1026, "y": 96, "featured-champions": []}, "background": {"type": "image", "title": {"cs_cz": "Písek mizí, Shurima se znovu zrodila.", "de_de": "Die Sande ziehen sich zurück und Shurima wird wiedergeboren.", "el_gr": "Η άμμος υποχωρεί και η Σουρίμα ανατέλλει ξανά", "en_au": "The sands recede, and Shurima is reborn.", "en_gb": "The sands recede, and Shurima is reborn.", "en_ph": "The sands recede, and Shurima is reborn.", "en_pl": "The sands recede, and Shurima is reborn.", "en_sg": "The sands recede, and Shurima is reborn.", "en_us": "The sands recede, and Shurima is reborn.", "es_ar": "Las arenas retroceden y Shurima renace.", "es_es": "Las arenas retroceden y Shurima renace.", "es_mx": "Las arenas retroceden y Shurima renace.", "fr_fr": "Les sables reculent et Shurima revient à la vie.", "hu_hu": "A homok visszahúzódik, Shurima újjászületik.", "id_id": "Debu pasir ini telah surut, dan Shurima telah kembali bangkit.", "it_it": "Le sabbie si ritirano e Shurima rinasce", "ja_jp": "砂が引き、シュリーマが復活した。", "ko_kr": "모래가 흩어지면서 다시 모습을 드러내는 슈리마", "ms_my": "Pasir semakin surut, dan Shurima dilahirkan semula.", "pl_pl": "Piaski zniknęły, a Shurima się odrodziła", "pt_br": "A areia recua, e Shurima renasce.", "ro_ro": "Nisipurile se retrag și Shurima renaște", "ru_ru": "Пески отступают, Шурима возрождается.", "th_th": "ทรายถดถอยไป และ Shurima ก็เกิดใหม่อีกครั้ง", "tr_tr": "Kumlar geri çekiliyor ve SHURIMA yeniden doğuyor.", "vn_vn": "Shurima tái sinh", "zh_cn": "沙粒退去，而恕瑞玛重生了。", "zh_tw": "沙流退去，蘇瑞瑪隨之重生"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/factions/image-gallery/shurima-reborn.jpg", "encoding": "image/jpeg", "width": 1920, "height": 995, "x": 974, "y": 0, "featured-champions": []}, "url": "/en_us/story/azir-color-story", "release-date": "2016-05-05T08:00:00.000Z", "featured-champions": [{"type": "champion", "release-date": "2014-09-16", "name": "Azir", "slug": "azir", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Azir_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1026, "y": 96, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Marksman", "slug": "marksman"}]}], "word-count": 847, "minutes-to-read": 4}, {"type": "story-preview", "title": "Bloodline", "subtitle": "by Graham McNeill", "description": "<p>Taliyah had almost forgotten how much she’d missed the furnace heat of Shurima – the sweat and crush of hundreds of people pushing, cursing, haggling and speaking with such passion and speed that outsiders often thought they were fighting.</p>", "story-slug": "rg-shurima-story", "featured-image": null, "background": {"type": "image", "title": {"cs_cz": "Znovu vztyčený sluneční kotouč nad ulicemi Nashramae", "de_de": "Die nachgebaute Sonnenscheibe über den Straßen von Nashramae", "el_gr": "Ο ηλιακός δίσκος δεσπόζει ξανά στους δρόμους της Νασραμαέ", "en_au": "The rebuilt sun disc over the streets of Nashramae", "en_gb": "The rebuilt sun disc over the streets of Nashramae", "en_ph": "The rebuilt sun disc over the streets of Nashramae", "en_pl": "The rebuilt sun disc over the streets of Nashramae", "en_sg": "The rebuilt sun disc over the streets of Nashramae", "en_us": "The rebuilt sun disc over the streets of Nashramae", "es_ar": "El disco solar reconstruido sobre las calles de Nashramae", "es_es": "El disco solar reconstruido sobre las calles de Nashramae", "es_mx": "El disco solar reconstruido sobre las calles de Nashramae", "fr_fr": "Le Disque solaire reconstruit surplombe les rues de Nashramae", "hu_hu": "Az újjáépített napkorong Nashramé utcái fölé magasodik.", "id_id": "Sun Disc yang dibuat lagi di jalanan Nashramae", "it_it": "Il disco solare ricostruito sopra le strade di Vekaura", "ja_jp": "ベカウラの上空にある再建された太陽の円盤", "ko_kr": "나시라미 거리에 다시 세워진 태양 원판", "ms_my": "Cakera matahari yang dibina semula di atas jalan raya Nashramae", "pl_pl": "Odbudowany słoneczny dysk ponad ulicami Nashramae", "pt_br": "O disco solar reconstruído mas ruas de Nashramae", "ro_ro": "Discul soarelui, reconstruit deasupra străzilor din Nashramae", "ru_ru": "Восстановленный солнечный диск нависает над улицами Нашраме.", "th_th": "Sun Disc ที่ถูกสร้างขึ้นมาใหม่อยู่เหนือถนน Nashramae", "tr_tr": "Nashramae sokakları üzerinde yeniden yükselen Güneş Kursu", "vn_vn": "Đĩa Mặt Trời được dựng lại  ở Nashramae", "zh_cn": "重建后的太阳圆盘悬在纳施拉美的街道之上", "zh_tw": "位於娜敘亞麥上方重建的烈日之輪"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/factions/image-gallery/shurima-vekaurastreets.jpg", "encoding": "image/jpeg", "width": 1920, "height": 887, "x": 1049, "y": 763, "featured-champions": []}, "word-count": 9630, "minutes-to-read": 36, "featured-champions": [{"type": "champion", "release-date": "2016-05-18", "name": "Taliyah", "slug": "taliyah", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Taliyah_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1063, "y": 0, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Support", "slug": "support"}]}, {"type": "champion", "release-date": "2009-10-01", "name": "Nasus", "slug": "nasus", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Nasus_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 889, "y": 40, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}, {"type": "champion", "release-date": "2011-10-05", "name": "Xerath", "slug": "xerath", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Xerath_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 701, "y": 23, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Assassin", "slug": "assassin"}]}, {"type": "champion", "release-date": "2011-01-18", "name": "Renekton", "slug": "renekton", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Renekton_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 801, "y": 6, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}], "release-date": "2016-05-12T08:00:00.000Z", "url": "/en_us/story/rg-shurima-story"}, {"type": "story-preview", "title": "The Legend of the Darkin", "subtitle": null, "description": "<p>The darkin are thrice-cursed—once by the ancient enemy they faced, again by the fall of their glorious empire, and finally by the betrayal that has damned them for all eternity.</p>", "story-slug": "the-legend-of-the-darkin", "featured-image": null, "background": {"type": "image", "title": {"cs_cz": "VELKÁ DARKINSKÁ VÁLKA", "de_de": "DER GROẞE KRIEG DER DÜSTEREN", "el_gr": "Ο ΜΕΓΑΛΟΣ ΠΟΛΕΜΟΣ ΤΩΝ ΝΤΑΡΚΙΝ", "en_au": "THE GREAT DARKIN WAR", "en_gb": "THE GREAT DARKIN WAR", "en_ph": "THE GREAT DARKIN WAR", "en_pl": "THE GREAT DARKIN WAR", "en_sg": "THE GREAT DARKIN WAR", "en_us": "THE GREAT DARKIN WAR", "es_ar": "LA GRAN GUERRA DARKIN", "es_es": "LA GRAN GUERRA OSCURA", "es_mx": "LA GRAN GUERRA DARKIN", "fr_fr": "LA GRANDE GUERRE DES DARKIN", "hu_hu": "A NAGY DARKINHÁBORÚ", "id_id": "THE GREAT DARKIN WAR", "it_it": "LA GRANDE GUERRA DARKIN", "ja_jp": "ダーキン大戦", "ko_kr": "다르킨 전쟁", "pl_pl": "WIELKA WOJNA DARKINÓW", "pt_br": "A GRANDE GUERRA DOS DARKIN", "ro_ro": "MARELE RĂZBOI AL DARKINILOR", "ru_ru": "ВЕЛИКАЯ ВОЙНА ДАРКИНОВ", "th_th": "มหาสงครามแห่ง Darkin", "tr_tr": "BÜYÜK DARKIN SAVAŞI", "vn_vn": "ĐẠI CHIẾN  DARKIN", "zh_cn": "暗裔大战", "zh_tw": "史詩級的冥血戰役"}, "subtitle": "", "description": {"cs_cz": "Když světlo Shurimy konečně opustilo tento svět, mnozí nesmrtelní Vyzdvižení byli najednou ztracení. Bez císaře, který by je vedl, se nakonec tito „darkinové“ vrhli do války mezi sebou samými – a proti národům Runeterry, které byly lapeny uprostřed.", "de_de": "Als schließlich das Licht von Shurima die Welt verließ, verloren viele der unsterblichen Aufgestiegenen ihren Lebenssinn. Ohne einen Imperator, der sie führte, gerieten diese „Düsteren“ schließlich in kriegerischen Auseinandersetzungen aneinander – und die Menschen von Runeterra standen zwischen den Fronten.", "el_gr": "Όταν το φως της Σουρίμα εγκατέλειψε αυτόν τον κόσμο, πολλοί από τους αθάνατους Εξυψωμένους έμειναν χωρίς σκοπό. Χωρίς αυτοκράτορα να τους οδηγήσει, οι «Ντάρκιν» τελικά ξεκίνησαν να πολεμούν μεταξύ τους και οι λαοί της Γης των Ρούνων βρέθηκαν στη μέση.", "en_au": "When the light of Shurima finally left the world, many of the immortal Ascended found themselves lost. With no emperor to lead them, these “darkin” eventually fell to warring among their own kind—and the peoples of Runeterra were caught in the middle.", "en_gb": "When the light of Shurima finally left the world, many of the immortal Ascended found themselves lost. With no emperor to lead them, these “darkin” eventually fell to warring among their own kind—and the peoples of Runeterra were caught in the middle.", "en_ph": "When the light of Shurima finally left the world, many of the immortal Ascended found themselves lost. With no emperor to lead them, these “darkin” eventually fell to warring among their own kind—and the peoples of Runeterra were caught in the middle.", "en_pl": "When the light of Shurima finally left the world, many of the immortal Ascended found themselves lost. With no emperor to lead them, these “darkin” eventually fell to warring among their own kind—and the peoples of Runeterra were caught in the middle.", "en_sg": "When the light of Shurima finally left the world, many of the immortal Ascended found themselves lost. With no emperor to lead them, these “darkin” eventually fell to warring among their own kind—and the peoples of Runeterra were caught in the middle.", "en_us": "When the light of Shurima finally left the world, many of the immortal Ascended found themselves lost. With no emperor to lead them, these “darkin” eventually fell to warring among their own kind—and the peoples of Runeterra were caught in the middle.", "es_ar": "Cuando la luz de Shurima finalmente abandonó el mundo, varios de los inmortales Ascendidos se encontraron perdidos. Sin un emperador que los guiara, estos ''darkin'' terminaron por enfrentarse entre sí, y los pueblos de Runaterra quedaron atrapados en medio.", "es_es": "Cuando se apagó la última luz de Shurima, muchos de los Ascendidos inmortales perdieron su propósito. Sin un emperador que los guiara, estos \"oscuros\" acabaron por enfrentarse entre ellos, y los habitantes de Runaterra fueron víctimas de los daños colaterales.", "es_mx": "Cuando la luz de Shurima finalmente abandonó el mundo, varios de los inmortales Ascendidos se encontraron perdidos. Sin un emperador que los guiara, estos ''darkin'' terminaron por enfrentarse entre sí, y los pueblos de Runaterra quedaron atrapados en medio.", "fr_fr": "Quand la lumière de Shurima disparut du monde, les Transfigurés se retrouvèrent perdus. N'ayant plus d'empereur pour les guider, ces guerriers finirent par se faire la guerre entre eux. Les peuples de Runeterra se trouvèrent pris dans le feu de leurs batailles.", "hu_hu": "Amikor Shurima fénye elhagyta ezt a világot, a halhatatlan Felemelkedettek közül sokan elveszettnek érezték magukat. Mivel nem volt olyan uralkodó, aki vezethette volna őket, ezek a „darkinok” végül saját fajtájuk ellen kezdtek harcolni, ennek pedig Runaterra ártatlan népe itta meg a levét.", "id_id": "Ketika cahaya Shurima meninggalkan dunia, banyak Immortal Ascended kehilangan arah. Tanpa raja yang memimpin mereka, para “darkin” berperang dengan sesamanya—dan masyarakat Runeterra terjebak di antaranya.", "it_it": "Quando la luce di Shurima lasciò il mondo, molti degli immortali Ascesi si sentirono perduti. Senza un imperatore a guidarli, questi ''darkin'' finirono per muoversi guerra tra loro, coinvolgendo gli abitanti di Runeterra.", "ja_jp": "シュリーマの光がこの世界からついえたとき、不死の超越者の多くは目的を見失った。自分たちを率いる皇帝が不在となったことで、そういった\"ダーキン\"たちはやがて同族の間で争うようになり、ルーンテラの人々はそれに巻き込まれることとなった。", "ko_kr": "슈리마의 빛이 마침내 이 세상에서 사라지자 수많은 불멸의 초월체들은 자아를 잃어버렸다. 그들을 인도할 황제도 없었기에 이 \"다르킨\"들은 결국 자신들끼리 싸우기 시작했고, 룬테라의 인간들은 그 전쟁에 휩쓸려 버렸다.", "pl_pl": "Kiedy światło Shurimy wreszcie opuściło świat, wielu z nieśmiertelnych Wyniesionych czuło się zagubionymi. Jako że nie mieli imperatora, który by im przewodził, ci „Darkini” ostatecznie zaczęli wojować między sobą, a ludy Runeterry znalazły się w samym środku ich konfliktu.", "pt_br": "Quando a luz de Shurima finalmente deixou o mundo, muitos dos Ascendentes imortais se viram perdidos. Sem um imperador para liderá-los, esses \"darkin\" eventualmente entraram em conflitos entre si; e os povos de Runeterra sofreram as consequências.", "ro_ro": "Când lumina Shurimei s-a stins, mulți dintre iluminații nemuritori au pierdut calea cea dreaptă. Fără un împărat care să-i conducă, acești ''darkini'' au căzut pradă vrajbei dintre ei înșiși, iar popoarele Runeterrei au fost prinse la mijloc în războaiele lor.", "ru_ru": "Когда солнце Шуримы закатилось, многие бессмертные вознесшиеся лишились духовного ориентира. Воля императора больше не объединяла их, и в конце концов они стали воевать друг с другом, погружаясь во тьму безумия. Народы Рунтерры оказались между молотом и наковальней.", "th_th": "เมื่อแสงสุดท้ายแห่ง Shurima ได้เลือนหายไปจากโลก เหล่า Ascended ผู้เป็นอมตะหลายคนเริ่มหลงทาง เมื่อไร้ซึ่งจักรพรรดิ์ที่เป็นผู้นำ เหล่า “Darkin” เริ่มต่อสู้ เข่นฆ่ากันเอง จนลดลงเรื่อย ๆ—โดยมีประชาชนของ Runeterra ตกอยู่ท่ามกลางไฟสงคราม", "tr_tr": "Shurima'nın ışığı sonunda dünyayı terk ettiğinde, ölümsüz Yükselmişlerin pek çoğu amaçsız kaldı. Başlarında onlara komuta edecek bir imparator olmayınca, artık “darkin” denen bu varlıklar sonunda kendi aralarında savaşmaya başladılar ve Runeterra halkları onların arasında kaldı.", "vn_vn": "Khi ánh sáng của Shurima lụi tàn khỏi thế giới, rất nhiều Thể Thăng Hoa bất tử trở nên lạc lối. Không còn một hoàng đế để lãnh đạo họ, những \"darkin\" bắt đầu xâu xé, chiến tranh lẫn nhau - và cư dân của Runeterra bị mắc kẹt giữa những trận chiến.", "zh_cn": "当恕瑞玛的荣光终于作别了这个世界，许多不朽的飞升者发觉自己陷入了迷茫。没有了皇帝的指引，这些“暗裔”最终陷入了彼此间的争斗，而符文之地的人们也被迫卷入其中。", "zh_tw": "當蘇瑞瑪的最後一絲光芒從這世界淡去，許多不朽的至高戰士發現他們也迷失了自己。少了帝王的領導，這些「冥血族」最終陷入他們自身種族的交戰之中 － 且連帶符文大地的人民也受到了波及。"}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/darkin-the-great-darkin-war.jpg", "encoding": "image/jpeg", "width": 1368, "height": 923, "x": 1116, "y": 418, "featured-champions": []}, "word-count": 365, "minutes-to-read": 2, "featured-champions": [{"type": "champion", "release-date": "2014-09-16", "name": "Azir", "slug": "azir", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Azir_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1026, "y": 96, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Marksman", "slug": "marksman"}]}], "release-date": "2018-06-25T08:00:00.000Z", "url": "/en_us/story/the-legend-of-the-darkin"}, {"type": "story-preview", "title": "Twilight of the Gods", "subtitle": "by Graham McNeill", "description": "<p>They came to a dead city in the mountain’s shadow under cover of night. Battle-hosts of a thousand warriors, each bearing bloody totems that told of the ancient lineages of the Sunborn Ascended who led them.</p>", "story-slug": "twilight-of-the-gods", "featured-image": null, "background": {"type": "image", "title": {"cs_cz": "ZABÍJENÍ LEGEND", "de_de": "UM LEGENDEN ZU ERLEGEN", "el_gr": "ΣΚΟΤΩΝΟΝΤΑΣ ΘΡΥΛΟΥΣ", "en_au": "TO SLAY LEGENDS", "en_gb": "TO SLAY LEGENDS", "en_ph": "TO SLAY LEGENDS", "en_pl": "TO SLAY LEGENDS", "en_sg": "TO SLAY LEGENDS", "en_us": "TO SLAY LEGENDS", "es_ar": "MATAR LEYENDAS", "es_es": "EXTERMINAR LEYENDAS", "es_mx": "MATAR LEYENDAS", "fr_fr": "ABATTRE LES LÉGENDES", "hu_hu": "LEGENDÁK GYILKOSA", "id_id": "TO SLAY LEGENDS", "it_it": "UCCIDERE LEGGENDE", "ja_jp": "伝説を葬るために", "ko_kr": "전설의 종말", "pl_pl": "ZABIJAĆ LEGENDY", "pt_br": "DESTRUINDO LENDAS", "ro_ro": "RĂPUNEREA LEGENDELOR", "ru_ru": "СРАЗИТЬ ЛЕГЕНДУ", "th_th": "เพื่อสังหารตำนาน", "tr_tr": "EFSANELERİ ÖLDÜRMEK", "vn_vn": "TIÊU DIỆT HUYỀN THOẠI", "zh_cn": "传说不再", "zh_tw": "為了抹滅傳說"}, "subtitle": "", "description": {"cs_cz": "Nakonec se nechali porazit smrtelníky, které chtěli sami zotročit. Za pomoci magie a vychytralosti byli ti nejmocnější darkinové překováni v živoucí zbraně a použity proti těm, kteří ještě zbývali. Avšak každý, kdo se takové zbraně chopí, se stane sotva něčím víc než pouhým hostitelem, schránkou pro nesmrtelné vědomí, jež v ní třímá.", "de_de": "Letztendlich wurden die Düsteren von den Sterblichen besiegt, die sie zu versklaven versucht hatten. Mit Magie und List wurden die mächtigsten unter ihnen zu lebendigen Waffen geschmiedet und gegen die verbliebenen Düsteren eingesetzt. Jeder Sterbliche, der jedoch eine solche Waffe ergriff, war danach nicht mehr als ein Wirt für das unsterbliche Wesen in ihrem Inneren.", "el_gr": "Τελικά, ηττήθηκαν από τους θνητούς που θέλησαν να σκλαβώσουν. Με μαγεία και πονηριά, οι πιο σημαντικοί Ντάρκιν έγιναν ζωντανά όπλα και χρησιμοποιήθηκαν ενάντια σε όσους απέμειναν. Όμως, όποιος πιάνει ένα τέτοιο όπλο θα απομείνει ένα απλός ξενιστής, ένα δοχείο για την αθάνατη νοημοσύνη που θα κρύβεται μέσα του.", "en_au": "Ultimately, they were defeated by the mortals they sought to enslave. With magic and cunning, the greatest of the darkin were forged into living weapons, and used against those that remained—but anyone who takes up such a weapon will become little more than a host, a vessel for the immortal sentience within it.", "en_gb": "Ultimately, they were defeated by the mortals they sought to enslave. With magic and cunning, the greatest of the darkin were forged into living weapons, and used against those that remained—but anyone who takes up such a weapon will become little more than a host, a vessel for the immortal sentience within it.", "en_ph": "Ultimately, they were defeated by the mortals they sought to enslave. With magic and cunning, the greatest of the darkin were forged into living weapons, and used against those that remained—but anyone who takes up such a weapon will become little more than a host, a vessel for the immortal sentience within it.", "en_pl": "Ultimately, they were defeated by the mortals they sought to enslave. With magic and cunning, the greatest of the darkin were forged into living weapons, and used against those that remained—but anyone who takes up such a weapon will become little more than a host, a vessel for the immortal sentience within it.", "en_sg": "Ultimately, they were defeated by the mortals they sought to enslave. With magic and cunning, the greatest of the darkin were forged into living weapons, and used against those that remained—but anyone who takes up such a weapon will become little more than a host, a vessel for the immortal sentience within it.", "en_us": "Ultimately, they were defeated by the mortals they sought to enslave. With magic and cunning, the greatest of the darkin were forged into living weapons, and used against those that remained—but anyone who takes up such a weapon will become little more than a host, a vessel for the immortal sentience within it.", "es_ar": "Finalmente, fueron derrotados por los mortales que pretendían esclavizar. Con magia y astucia, los más grandes darkin fueron reforjados en armas vivientes y usados contra los darkin restantes, pero cualquiera que empuñe una de esas armas se convertirá en un mero huésped, un vehículo de la conciencia inmortal allí contenida.", "es_es": "Al final, fueron derrotados por los mortales a los que pretendían esclavizar. Mediante la magia y la astucia, los oscuros más poderosos fueron transformados en armas vivientes utilizadas contra los que quedaban, pero cualquiera que empuñaba una de estas armas se convertía en un mero huésped, en un instrumento para el inmortal encerrado en ella.", "es_mx": "Finalmente, fueron derrotados por los mortales que pretendían esclavizar. Con magia y astucia, los más grandes darkin fueron reforjados en armas vivientes y usados contra los darkin restantes, pero cualquiera que empuñe una de esas armas se convertirá en un mero huésped, un vehículo de la conciencia inmortal allí contenida.", "fr_fr": "Finalement, ils furent battus par les mortels qu'ils cherchaient à réduire en esclavage. Grâce à un mélange de magie et de ruse, les plus puissants des Darkin furent enchâssés dans des armes et utilisés contre ceux qui restaient. Mais quiconque s'emparait de l'une de ces armes était réduit au rang de réceptacle pour la conscience éternelle emprisonnée à l'intérieur.", "hu_hu": "Végül azok a halandók győzték le őket, akiket rabszolgasorba akartak taszítani. Varázslattal és ravaszsággal élő fegyverekké változtatták a leghatalmasabb darkinokat, és a többi darkin ellen fordították őket, ám ennek ára volt. Bárki, aki egy ilyen fegyvert vesz a kezébe, egyszerű gazdatestté, a fegyverben lakozó halhatatlan tudat porhüvelyévé válik.", "id_id": "Pada akhirnya, mereka dikalahkan manusia yang ingin mereka perbudak. Dengan sihir dan kecerdasan, darkin-darkin terhebat ditempa menjadi senjata hidup, dan digunakan untuk melawan mereka yang masih hidup—tapi siapa saja yang menggunakan senjata itu akan berubah menjadi inang saja, sebuah wadah untuk makhluk abadi yang berada di dalamnya.", "it_it": "Infine, vennero sconfitti dai mortali che volevano ridurre in schiavitù. Grazie alla magia e all'inganno, i più potenti fra i darkin vennero imprigionati in armi viventi, e utilizzati contro quelli che erano rimasti... ma chiunque brandisce queste armi si trasforma in un ospite, in un corpo atto a contenere l'anima immortale dell'arma.", "ja_jp": "彼らは最終的に、支配しようとしていた定命の民に敗れた。魔法と狡猾さによって、最強のダーキンも生ける武器の中に押し込められ、残りのダーキンの討伐に利用されたのである。だがこのような武器を手に取る者は単なる宿主にとどまらない。その人物は、武器に棲まう不死の知的生命の器となるのだ。", "ko_kr": "다르킨들은 결국 노예로 삼으려고 했던 필멸자들에게 패배했다. 가장 위대한 다르킨조차 마법과 계략에 빠져 살아 있는 무기가 되었고, 그 무기는 남은 다르킨 종족을 향해 휘둘러졌다. 그러나 이 무기를 쥐는 자는 누구든 숙주에 지나지 않는, 즉 불멸의 자아를 담은 그릇이 되고 말 것이다.", "pl_pl": "Koniec końców Darkini zostali pokonani przez śmiertelników, których chcieli zniewolić. Za pomocą magii i sprytu najwspanialsi z nich zostali przekuci w żywe bronie i wykorzystani przeciwko pozostałym Darkinom — ale każdy, kto chwyci za taką broń, stanie się niewiele więcej niż żywicielem, nośnikiem nieśmiertelnej świadomości zaklętej w orężu.", "pt_br": "No fim, eles foram derrotados pelos mesmos mortais que tentavam escravizar. Com magia e astúcia, os grandes darkin foram aprisionados em armas vivas e usados para combater os que ainda restavam. Mas a pessoa que empunha uma dessas armas se tornará meramente um hospedeiro, um receptáculo para a imortal consciência que vive dentro dela.", "ro_ro": "În cele din urmă, muritorii pe care voiau să-i înrobească i-au învins. Prin magie și viclenie, cei mai aprigi dintre darkini au fost înlănțuiți de armele lor și folosiți împotriva celor care mai rămăseseră, însă oricine mânuiește o astfel de armă va deveni doar o gazdă pentru esența nemuritoare care-o va copleși.﻿", "ru_ru": "И все же они были побеждены теми самыми смертными, которых стремились поработить. С помощью обмана и магии те превратили самых могучих даркинов в живое оружие и использовали против их же собратьев. Но любой, кто возьмет в руки такое оружие, утратит собственную волю и станет сосудом для бессмертной сущности.", "th_th": "ในท้ายที่สุด พวกเขาก็ถูกโค่นล้ม โดยเหล่ามนุษย์ที่พวกเขากดขี่ข่มเหง ด้วยเวทมนตร์และเล่ห์เหลี่ยม เหล่า Darkin ที่ยิ่งใหญ่ที่สุดถูกใช้หล่อหลอมขึ้นเป็นชีวอาวุธ และใช้ต่อกรกับเหล่า Darkin ที่ยังคงหลงเหลืออยู่—เพียงแต่ผู้ใดก็ตามที่หยิบอาวุธเหล่านี้ขึ้นต่อสู้จะถูกสิ่งสู่ และกลายเป็นเพียงภาชนะของสิ่งมีชีวิตอมตะที่อาศัยอยู่ภายในนั้น", "tr_tr": "Sonunda, köle etmeye çalıştıkları ölümlülere yenildiler. Ölümlüler büyüleri ve zekâları sayesinde en güçlü darkinleri canlı silahlar haline getirip bu silahları geride kalanlara karşı kullandılar. Ama böyle bir silahı eline alan kişi, işlevi silahın içindeki ölümsüz bilinci taşımak olan bir bedene, bir kaba dönüşüyor.", "vn_vn": "Cuối cùng, họ đã bị đánh bại bởi chính những người phàm mà họ muốn nô lệ hóa. Bằng ma thuật và trí khôn, darkin mạnh nhất đã bị phong ấn vào những món vũ khí sống, và được dùng để chống lại những kẻ còn lại - nhưng bất kì ai sử dụng một món vũ khí như thế sẽ dần trở thành một vật chủ cho thực thể bất tử bên trong nó.", "zh_cn": "最终，他们本打算奴役的凡人将他们击败了。在魔法和诡计的作用下，暗裔们被铸进了活体武器中，并被用来对付剩下的同胞。但是，任何染指这些武器的人都不仅仅会成为宿主，被暗裔不朽的精魂占据。", "zh_tw": "最終，他們被自己想要奴役的凡人所擊敗。藉由魔法與狡詐，冥血族最偉大的戰士被打造為活生生的武器，並且用來對抗其餘殘黨 － 但任何舉起這種武器的人，與其說是揮舞著武器，倒更像是變成蘊藏當中的不朽意識的容器。"}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/darkin-to-slay-legends.jpg", "encoding": "image/jpeg", "width": 1469, "height": 826, "x": null, "y": null, "featured-champions": []}, "word-count": 6838, "minutes-to-read": 25, "featured-champions": [{"type": "champion", "release-date": "2009-10-01", "name": "Nasus", "slug": "nasus", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Nasus_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 889, "y": 40, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}, {"type": "champion", "release-date": "2014-09-16", "name": "Azir", "slug": "azir", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Azir_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1026, "y": 96, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Marksman", "slug": "marksman"}]}], "release-date": "2018-06-25T08:00:00.000Z", "url": "/en_us/story/twilight-of-the-gods"}, {"section-title": "", "type": "image-gallery", "isFanArt": false, "fan-art-url": "", "featured-image": "", "title": "", "subtitle": "", "description": "", "assets": [{"type": "image", "title": {"cs_cz": "Barevný grafický návrh Azira", "de_de": "Azir – Kolorierte Konzeptzeichnung", "el_gr": "έγχρωμο concept art για τον Αζίρ", "en_au": "Colored Azir concept", "en_gb": "Colored Azir concept", "en_ph": "Colored Azir concept", "en_pl": "Colored Azir concept", "en_sg": "Colored Azir concept", "en_us": "Colored Azir concept", "es_ar": "Concepto de Azir coloreado", "es_es": "Concepto de Azir coloreado", "es_mx": "Concepto de Azir coloreado", "fr_fr": "Concept d'Azir en couleur", "hu_hu": "Azir színes látványterve", "id_id": "Konsep Warna Azir", "it_it": "Bozzetto colorato di Azir", "ja_jp": "アジール カラーコンセプトアート", "ko_kr": "아지르 컬러 컨셉 아트", "ms_my": "Konsep Azir berwarna", "pl_pl": "Azir — kolorowa grafika koncepcyjna", "pt_br": "Conceito colorido Azir", "ro_ro": "Azir – concept color", "ru_ru": "Цветной эскиз Азира", "th_th": "คอนเซปต์ของ Azir ลงสี", "tr_tr": "Renkli AZIR konsepti", "vn_vn": "Hình mẫu Azir màu", "zh_cn": "彩色版阿兹尔概念图", "zh_tw": "彩繪阿祈爾 設計概念"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/image-gallery/azir_the_sand_emperor.jpg", "encoding": "image/jpeg", "width": 1706, "height": 1080, "x": 576, "y": 137, "featured-champions": []}], "featured-champions": [{"type": "champion", "release-date": "2014-09-16", "name": "Azir", "slug": "azir", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Azir_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1026, "y": 96, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Marksman", "slug": "marksman"}]}]}, {"slug": "azir-login", "section-title": "", "type": "featured-video", "featured-image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Azir_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1026, "y": 96, "featured-champions": []}, "title": "Azir: Login Theme", "subtitle": "", "description": "", "video": {"type": "video", "title": "", "subtitle": "", "description": [], "uri": "https://www.youtube.com/watch?v=smNA_BYDODU", "width": "", "height": "", "x": "", "y": "", "featured-champions": [{"type": "champion", "release-date": "2014-09-16", "name": "Azir", "slug": "azir", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Azir_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1026, "y": 96, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Marksman", "slug": "marksman"}]}]}, "blackout": null, "release-date": "2014-09-16T08:00:00.000Z", "video-type": "champ-login-music"}]}