{"id": "caitlyn", "name": "Caitlyn Champion Page", "locale": "en_us", "champion": {"release-date": "2011-01-04", "slug": "caitlyn", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Caitlyn_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1024, "y": 7, "featured-champions": []}, "video": null, "associated-faction-slug": "piltover", "roles": [{"name": "Marksman", "slug": "marksman"}], "name": "Caitlyn", "title": "the Sheriff of Piltover", "game-info-url": "http://gameinfo.na.leagueoflegends.com/en/game-info/champions/caitlyn", "biography": {"full": "<p>A determined and skilled investigator, Caitlyn is one of the sheriffs of Piltover, the City of Progress. She is a fiercely intelligent woman with a strong sense of justice and a resolute devotion to the law. Armed with a magnificent hextech rifle, Caitlyn is a patient hunter and the bane of criminals throughout her city.</p><p>Born to a wealthy and influential family of hextech artificers in Piltover, Caitlyn swiftly learned the social graces of city life, but preferred to spend her time in the wilder lands to the south. Equally adept at mingling with the moneyed citizens of the City of Progress or tracking a deer through the mud of the forest, Caitlyn spent the bulk of her youth beyond Piltover’s gates. She could track a bird on the wing or put a bullet through the eye of a hare at three hundred yards with her father’s Bilgewater repeater musket.</p><p>Caitlyn’s greatest assets, however, were her intelligence and willingness to learn from her parents, who reinforced her innate understanding of right and wrong. Though the family’s engineering skills had made them wealthy, her mother always warned of Piltover’s seductions, of how its gilded promises could harden even the kindest heart. Caitlyn paid little attention to her mother’s warning, for Piltover was a city of beauty to her, a place of order she would cherish after each trip into the wild.</p><p>All that was to change one Progress Day, five years later.</p><p>Caitlyn returned from one of her long forays into the woodlands to find her home ransacked and empty. The family retainers were all dead, and no trace could be found of her parents. Caitlyn secured her home, and immediately set off in search of her mother and father.</p><p>Tracking quarry that does not want to be found within the confines of a city was very different from hunting in the wild, but, one by one, Caitlyn located the men who had invaded her home. None of these men knew the true identity of who had hired them, only that they had acted via a proxy with the initial “C.” The trail eventually led Caitlyn to a secret hextech laboratory where her mother and father were being forced to work for a rival clan under pain of death. Caitlyn rescued her parents, and the wardens, acting upon Caitlyn’s information, arrested the clan leader behind the kidnapping. She and her parents returned home and began to rebuild their lives, but something fundamental had changed in Caitlyn.</p><p>She had seen that Piltover could be a dangerous place, where ambition and greed were as deadly as a cornered beast. During the course of her investigation, Caitlyn had seen beneath Piltover’s veneer of progress and science. She had seen people in need of help, a host of souls lost and alone. And she had seen that she could help them. Though she loved her parents, Caitlyn had no desire to follow in their footsteps as an artisan, and looked for a way to earn a living in the sprawling metropolis. She established herself as an investigator of sorts, utilizing her skills as a superlative hunter to act as a finder of lost people and retriever of stolen property.</p><p>For her twenty-first birthday, Caitlyn’s parents presented her with a hextech rifle of exquisite artifice. The weapon was a thing of beauty, with specialized shells that enabled it to shoot with greater accuracy than any rifle she had ever owned. The weapon could also be modified to fire a variety of different ammunition types, and went with Caitlyn whenever she took a case.</p><p>Caitlyn knew Piltover’s nooks and crannies as thoroughly as the forest paths of her childhood, and turned a tidy profit in a profession that brought her into contact with the many and varied layers of society. Her profession exposed Caitlyn to a great deal of strange encounters that taught her, first-hand, the dangers of untested hextech and rogue chemtech development. Over the next few years, she quickly made a name for herself as someone to go to for help in matters both mundane and esoteric.</p><p>One particularly traumatic case involving a missing hextech device and a series of child abductions led to Caitlyn working closely with an agent of the Piltover Wardens; one who, like her, had developed something of an affinity for stranger cases. Caitlyn refused to give up, even when the trail grew colder with every passing day. She chased it like a dog would a bone, and eventually, broke the case. Caitlyn and the warden rescued the children after a battle with a host of rogue chimerics in the employ of a lunatic chem-researcher driven mad by his own concoctions. As she and the warden shared a celebratory drink, he offered her a job as a sheriff. At first, Caitlyn refused, but eventually came to realize that, with all the resources the wardens had to offer, she could potentially get closer to discovering the identity of the mysterious “C,” the only person involved in the attack on her family home she had yet to apprehend.</p><p>Caitlyn now works as a highly respected officer within the ranks of the Piltover Wardens to keep order in the City of Progress - particularly in areas where overzealous hextech artisans cross the line of what is acceptable in Piltover. She has recently partnered with a new recruit from Zaun, the brash and reckless Vi. How such an unlikely pairing came to be, and has proven to be so effective, is the subject of numerous wild rumors and tavern speculation among their fellow wardens and those they haul away to jail. </p>", "short": "Renowned as its finest peacekeeper, Caitlyn is also Piltover’s best shot at ridding the city of its elusive criminal elements. She is often paired with Vi, acting as a cool counterpoint to her partner’s more impetuous nature. Even though she carries a one-of-a-kind hextech rifle, Caitlyn’s most powerful weapon is her superior intellect, allowing her to lay elaborate traps for any lawbreakers foolish enough to operate in the City of Progress.", "quote": "“To be the best hunter, you have to be able to think like your prey.”", "quote-author": ""}, "bioImage": null, "headerImage": null}, "related-champions": [{"type": "champion", "release-date": "2016-11-28", "name": "Camille", "slug": "camille", "echelon": 0, "associated-faction": "", "associated-faction-slug": "piltover", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/camille_splash.jpg", "encoding": "image/jpeg", "width": 1024, "height": 616, "x": 969, "y": 6, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}]}, {"type": "champion", "release-date": "2012-07-07", "name": "Jayce", "slug": "jayce", "echelon": 1, "associated-faction": "", "associated-faction-slug": "piltover", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Jayce_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1007, "y": 182, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Marksman", "slug": "marksman"}]}, {"type": "champion", "release-date": "2010-03-16", "name": "Ezreal", "slug": "ezreal", "echelon": 2, "associated-faction": "", "associated-faction-slug": "piltover", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/Ezreal_splash.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 815, "y": 141, "featured-champions": []}, "role": [{"name": "Marksman", "slug": "marksman"}, {"name": "Mage", "slug": "mage"}]}, {"type": "champion", "release-date": "2012-12-19", "name": "Vi", "slug": "vi", "echelon": 3, "associated-faction": "", "associated-faction-slug": "piltover", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Vi_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 926, "y": 135, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Assassin", "slug": "assassin"}]}, {"type": "champion", "release-date": "2013-10-10", "name": "Jinx", "slug": "jinx", "echelon": 4, "associated-faction": "", "associated-faction-slug": "zaun", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Jinx_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 901, "y": 82, "featured-champions": []}, "role": [{"name": "Marksman", "slug": "marksman"}]}, {"type": "champion", "release-date": "2015-05-28", "name": "Ekko", "slug": "ekko", "echelon": 5, "associated-faction": "", "associated-faction-slug": "zaun", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Ekko_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1061, "y": 30, "featured-champions": []}, "role": [{"name": "Assassin", "slug": "assassin"}, {"name": "Fighter", "slug": "fighter"}]}], "explore-champions": [], "modules": [{"type": "story-preview", "title": "The Thrill of the Chase", "subtitle": null, "description": "<p>Even three bells after the Sun Gate had closed, Piltover was still full of life - life that was currently getting in her way. Caitlyn sprinted down Mainspring Crescent, weaving a path between midnight revelers strolling down the fashionable promenade of cafes and bistros. The supper clubs were emptying, as were the nearby theaters inside the Drawsmith Arcade, so this street was going to get a whole lot busier. If they didn’t catch up to Devaki soon, they were going to lose him.</p>", "story-slug": "caitlyn-color-story", "featured-image": null, "background": {"type": "image", "title": {"cs_cz": "Obchod a pokrok", "de_de": "Handel und Fortschritt", "el_gr": "Εμπόριο και τεχνολογία", "en_au": "Trade and Progress", "en_gb": "Trade and Progress", "en_ph": "Trade and Progress", "en_pl": "Trade and Progress", "en_sg": "Trade and Progress", "en_us": "Trade and Progress", "es_ar": "Comercio y progreso", "es_es": "Comercio y progreso", "es_mx": "Comercio y progreso", "fr_fr": "Commerce et progrès", "hu_hu": "Kereskedelem és fejlődés", "id_id": "Trade and Progress", "it_it": "Commercio e progresso", "ja_jp": "貿易と進歩", "ko_kr": "무역과 진보", "ms_my": "Sidereal Avenue", "pl_pl": "Handel i postęp", "pt_br": "Comércio e Progresso", "ro_ro": "Comerț și progres", "ru_ru": "Торговля и прогресс", "th_th": "การแลกเปลี่ยนและความเจริญก้าวหน้า", "tr_tr": "TİCARET VE İLERLEME", "vn_vn": "Giao dịch và phát triển", "zh_cn": "贸易与进步", "zh_tw": "貿易與進步"}, "subtitle": "", "description": {"cs_cz": "Starodávné město Zaun bývalo severní shurimskou obchodní stanicí, výrazného rozkvětu se však dočkalo až před více než třemi tisíci let po vybudování piltoverské mořské brány.", "de_de": "Die uralte Stadt Zhaun war ein nördlicher Handelsposten der Shurimaner, doch erst der Bau von Piltovers Seetoren brachte dreitausend Jahre später noch größeren Reichtum.", "el_gr": "Η αρχαία πόλη του Ζάουν ήταν κάποτε ένα από τα μεγαλύτερα εμπορικά κέντρα της βόρειας Σουρίμα, αλλά η δημιουργία των θαλάσσιων πυλών του Πιλτόβερ τρεις χιλιάδες χρόνια αργότερα έφερε ακόμη μεγαλύτερη ευημερία.", "en_au": "The ancient city of Zaun was a northern Shuriman trading post, but it was the creation of Piltover’s sea-gates more than three thousand years later that brought even greater prosperity.", "en_gb": "The ancient city of Zaun was a northern Shuriman trading post, but it was the creation of Piltover’s sea-gates more than three thousand years later that brought even greater prosperity.", "en_ph": "The ancient city of Zaun was a northern Shuriman trading post, but it was the creation of Piltover’s sea-gates more than three thousand years later that brought even greater prosperity.", "en_pl": "The ancient city of Zaun was a northern Shuriman trading post, but it was the creation of Piltover’s sea-gates more than three thousand years later that brought even greater prosperity.", "en_sg": "The ancient city of Zaun was a northern Shuriman trading post, but it was the creation of Piltover’s sea-gates more than three thousand years later that brought even greater prosperity.", "en_us": "The ancient city of Zaun was a northern Shuriman trading post, but it was the creation of Piltover’s sea-gates more than three thousand years later that brought even greater prosperity.", "es_ar": "La antigua ciudad de Zaun solía ser un punto de comercio shurimano, pero la creación de las puertas marítimas de Piltóver, hace más de tres mil años, aportó una prosperidad mucho mayor.", "es_es": "La antigua ciudad de Zaun era un punto de comercio de Shurima en el norte, pero la construcción de las puertas marítimas de Piltover más de tres mil años después fue lo que más hizo prosperar el territorio.", "es_mx": "La antigua ciudad de Zaun solía ser un punto de comercio shurimano, pero la creación de las puertas marítimas de Piltóver, hace más de tres mil años, aportó una prosperidad mucho mayor.", "fr_fr": "L'ancienne ville de Zaun était un comptoir commercial shurimien, mais bien plus que ses trois millénaires d'établissement, ce fut la création des portes maritimes par Piltover qui lui apporta une réelle prospérité.", "hu_hu": "Az ősi Zaun északi shurimai kereskedőváros volt, Piltover tengerkapuinak háromezer évvel ezelőtti megépítése óta azonban még inkább virágzásnak indult.", "id_id": "Kota kuno Zaun dahulu adalah pos perdagangan Shurima bagian utara, tapi pembuatan gerbang laut Piltover lebih dari tiga ribu tahun kemudian yang memberinya kemakmuran.", "it_it": "L'antica città di Zaun nacque come una stazione commerciale di Shurima, ma la creazione dei cancelli marini di Piltover avvenuta tremila anni dopo aumentò ancora di più la sua prosperità.", "ja_jp": "ゾウンの古代都市は元々シュリーマ北部の交易所だったが、三千年以上経たあとにピルトーヴァーの海門が造られたことで、さらに大きな繁栄がもたらされた。", "ko_kr": "고대 도시 자운은 슈리마 북부의 교역소였지만, 삼천 년 후 필트오버에 수문이 건설되면서 더욱 번영하게 되었습니다.", "ms_my": "The ancient city of Zaun was a northern Shuriman trading post, but it was the creation of Piltover’s sea-gates more than three thousand years later that brought even greater prosperity.", "pl_pl": "Starożytne miasto Zaun było północną placówką handlową Shurimy, ale morskie bramy w Piltover, które powstały ponad trzy tysiące lat później, przyniosły mu jeszcze większy dobrobyt.", "pt_br": "A antiga cidade de Zaun era um posto comercial shurimane ao norte, mas foi a criação dos portões marinhos de Piltover, mais de três mil anos depois, que trouxe ainda mais prosperidade.", "ro_ro": "Anticul oraș Zaun era odată un avanpost comercial din nordul Shurimei. După trei mii de ani, crearea porților portului din Piltover l-a făcut să devină mai prosper ca niciodată.", "ru_ru": "Заун – древний город, на заре времен служивший торговым форпостом Шуримы. Настоящего расцвета он достиг через три с лишним тысячи лет, после сооружения морских врат Пилтовера.", "th_th": "นครโบราณแห่งซอนนั้นเคยเป็นจุดแลกเปลี่ยนทางภาคเหนือของชูริม่า แต่เพราะการเกิดขึ้นของประตูสมุทรแห่งพิลโทเวอร์เมื่อสามพันปีก่อน ได้นำความเจริญอย่างยิ่งมาสู่นครแห่งนี้", "tr_tr": "Kadim Zaun şehri aslında kuzey Shurima'da bir ticaret şehriymiş. Ama kuruluşundan üç bin yıl sonra inşa edilen Piltover'ın deniz kapıları sayesinde bölgeye daha da büyük bir refah gelmiş.", "vn_vn": "Thành phố Zaun ngày xưa là điểm giao dịch phía nam Shurima, nhưng chính việc tạo ra các cửa biển của Piltover hơn ba ngàn năm sau mới mang lại phồn thịnh thực sự.", "zh_cn": "远古时代的祖安是恕瑞玛北方的一处贸易站，但却是三千多年后建起的皮尔特沃夫海闸给当地带来了更大的繁荣。", "zh_tw": "佐恩過去的城市是北蘇瑞瑪的一個貿易站。三千年後皮爾托福建立了運河，為這個地區帶來了更大的繁榮。"}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/piltover_environment_01.jpg", "encoding": "image/jpeg", "width": 1920, "height": 839, "x": 1033, "y": 511, "featured-champions": []}, "url": "/en_us/story/caitlyn-color-story", "release-date": "2016-12-02T08:00:00.000Z", "featured-champions": [{"type": "champion", "release-date": "2011-01-04", "name": "Caitlyn", "slug": "caitlyn", "echelon": 0, "associated-faction": "", "associated-faction-slug": "piltover", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Caitlyn_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1024, "y": 7, "featured-champions": []}, "role": [{"name": "Marksman", "slug": "marksman"}]}], "word-count": 1320, "minutes-to-read": 5}, {"type": "story-preview", "title": "Progress Day", "subtitle": "by Graham McNeill", "description": "<p>Tamara forces herself to rise early - an easy habit to get into when the earth is your bed and fallen leaves the only blanket. Less so when the mattress is stuffed with goose down and the sheets woven from soft cotton. The curtains are pulled back, and warm light pools on the floor of her third floor boarding room. She’d closed the curtains on her first night in Piltover and had slept two hours past dawn, which worried her so much, she has never closed them since.</p>", "story-slug": "piltover-progress-day", "featured-image": null, "background": {"type": "image", "title": {"cs_cz": "Zindelovo Incognium Runeterra", "de_de": "Zindelos Incognium Runeterra", "el_gr": "Το Incognium Runeterra της Ζιντέλο", "en_au": "Zindelo’s Incognium Runeterra", "en_gb": "Zindelo’s Incognium Runeterra", "en_ph": "Zindelo’s Incognium Runeterra", "en_pl": "Zindelo’s Incognium Runeterra", "en_sg": "Zindelo’s Incognium Runeterra", "en_us": "Zindelo’s Incognium Runeterra", "es_ar": "El Incognium de Zindelo, Runaterra", "es_es": "El Incognium de Zindelo, Runaterra", "es_mx": "El Incognium de Zindelo, Runaterra", "fr_fr": "Incognium Runeterra de Zindelo", "hu_hu": "Zindelo alkotása, az Incognium Runaterra", "id_id": "Zindelo’s Incognium Runeterra", "it_it": "L'Incognium di Zindelo di Runeterra", "ja_jp": "ジンデロのインコグニアムルーンテラ", "ko_kr": "진델로의 '미지의 룬테라'", "ms_my": "Incognium Runeterra Zindelo", "pl_pl": "Incognium Zindela z Runeterry", "pt_br": "“Incognium Runeterra”, de Zindelo", "ro_ro": "Zindelo – Incognium Runeterra", "ru_ru": "Инкогниум Зиндело Рунтерры", "th_th": "Incognium Runeterra ของ Zindelo", "tr_tr": "ZINDELO'NUN Bilinmeyen Runeterra'sı", "vn_vn": "Zindelo Runeterra", "zh_cn": "津戴罗的微缩符文之地", "zh_tw": "金德羅的伊卡里安符文儀"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/factions/image-gallery/piltover-zindeloruneterra.jpg", "encoding": "image/jpeg", "width": 1920, "height": 1078, "x": 1262, "y": 299, "featured-champions": []}, "word-count": 7244, "minutes-to-read": 27, "featured-champions": [{"type": "champion", "release-date": "2011-01-04", "name": "Caitlyn", "slug": "caitlyn", "echelon": 0, "associated-faction": "", "associated-faction-slug": "piltover", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Caitlyn_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1024, "y": 7, "featured-champions": []}, "role": [{"name": "Marksman", "slug": "marksman"}]}, {"type": "champion", "release-date": "2012-12-19", "name": "Vi", "slug": "vi", "echelon": 0, "associated-faction": "", "associated-faction-slug": "piltover", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Vi_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 926, "y": 135, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Assassin", "slug": "assassin"}]}], "release-date": "2016-12-02T08:00:00.000Z", "url": "/en_us/story/piltover-progress-day"}]}