{"id": "drmundo", "name": "DrMundo Champion Page", "locale": "en_us", "champion": {"release-date": "2009-09-02", "slug": "drmundo", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/DrMundo_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 965, "y": 131, "featured-champions": []}, "video": null, "associated-faction-slug": "zaun", "roles": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}], "name": "Dr. Mundo", "title": "the Madman of Zaun", "game-info-url": "http://gameinfo.na.leagueoflegends.com/en/game-info/champions/drmundo", "biography": {"full": "<p>Utterly insane, unrepentantly homicidal, and horrifyingly purple, Dr. Mundo is what keeps many of Zaun’s citizens indoors on particularly dark nights. This monosyllabic monstrosity seems to want nothing more than pain – both the giving of it, and the receiving of it. Wielding his massive meat cleaver as if it were weightless, Mundo is infamous for capturing and torturing dozens of Zaun’s citizens for his nefarious “operations,” which seem to have no overall point or goal. He is brutal. He is unpredictable. He goes where he pleases. He is also not, technically, a doctor.</p><p>Stories differ as to the first sighting of Zaun’s unpredictable purple madman. Some say they first saw him as a baby, crawling through the Piltover marketplace and terrifying the upper-class aristocrats with his foul smell. Others say he was born in Zaun and spent the first years of his life sloshing through the sewers and choking the life out of sumprats. Only one thing is for sure: when he was roughly three years old, he arrived on the doorstep of the Zaun Asylum for the Irreparably Troubled.</p><p>The other inmates of the asylum kept Mundo at a distance, but the asylum staff found the boy a source of constant fascination. They looked at him not as a child to be raised, but as a patient – a thing to be studied. Why was he purple? Who could have survived giving birth to someone of his size? </p><p>Within a year of his arrival, the doctors realized his skin was never going to change from its shockingly bright shade. When Mundo turned four, they discovered the extent of his unprecedented strength when he accidentally crushed an orderly’s windpipe for not bringing him his favorite type of candy (toenails). When Mundo turned six, they discovered he had a relationship to pain that was... unusual. To say the least.</p><p>Specifically, Mundo didn’t seem to mind pain. More than that, he actively sought it out. If left unsupervised, he’d stick sharp instruments into his shoulders. If he was placed anywhere near other patients, it’d only be a matter of minutes until one or both of them could be heard screaming in agony. </p><p>Soon the asylum staff tired of merely observing Mundo. It was time, they decided, to start experimenting. Whether they began their tests out of medical curiosity, a desire for scientific breakthrough, or sheer boredom is unknown. Whatever their reasons, the doctors unquestionably put a great deal of effort into understanding the purple enigma before them.</p><p>Over the next several years, they tested his tolerance for pain. They’d stick needles into his fingernails, and he’d giggle. They’d put hot irons to his feet, and he’d fall asleep. Soon, scientific curiosity gave way to outright frustration: they couldn’t get Mundo to react negatively to pain at all, and they couldn’t understand why. Not only that, but whatever damage they could do to him invariably healed itself within a few hours.</p><p>Throughout his teenage years, Mundo’s life consisted of complete isolation and routine torture. </p><p>He’d never been happier.</p><p>He came to see the doctors as aspirational figures. If pain was Mundo’s passion, it was seemingly these doctors’ life work: their myriad attempts to push beyond his pain threshold grew more unconventional as the years went on, including dipping his feet in acid and throwing flesh-eating mites on his face.</p><p>The asylum doctors were initially amused when the purple teen began to refer to himself not as “Mundo,” but as “<i>Doctor</i> Mundo.”</p><p>He’d steal a syringe from an orderly and fill it with a mixture of cavernberry juice from breakfast and god-knows-what from his chamber pot. <i>“Mundo make medicine!”</i> he’d happily exclaim before jabbing the concoction into his own forehead.</p><p>In time, however, Mundo grew tired of experimenting on himself.</p><p>Later, many would speculate what Mundo’s motivations were. Some assumed he was taking revenge for the years of torture he endured at the hands of the asylum staff. Others thought he was merely a psychopathic monster with no sense of morality.</p><p>The truth was much simpler: Mundo had decided it was time to put his research into practice.</p><p>One night, Mundo snuck into the kitchen. There, he found a massive meat cleaver. “Medical” blade in hand, Mundo proceeded to go from room to room, “operating” on every “patient” he found with no logic to his method of “treatment” other than what would amuse him the most at any given moment.</p><p>By daybreak, every single person in the asylum was “cured,” save for Mundo.</p><p>He donned a physician’s coat from one of his victims, his massive muscles ripping it as he pulled it over his gargantuan frame. Mundo had realized his dream. He was a doctor! As a new member of a long and illustrious line, he had to share his medicinal skills with the rest of the world. His work had just begun. </p><p>He barged through the locked doors of the asylum and past the steps where he’d been left so many years ago. Mundo walked into the streets of Zaun, a smile on his face and a spring in his step.</p><p>The doctor was in.</p>", "short": "Utterly insane, unrepentantly homicidal, and horrifyingly purple, Dr. Mundo is what keeps many of Zaun’s citizens indoors on particularly dark nights. This monosyllabic monstrosity seems to want nothing more than pain—both the giving of it, and the receiving of it. Wielding his massive meat cleaver as if it were weightless, Mundo is infamous for capturing and torturing dozens of Zaun’s citizens for his nefarious “operations,” which seem to have no overall point or goal. He is brutal. He is unpredictable. He goes where he pleases. He is also not, technically, a doctor.", "quote": "“Mundo will let you know upfront: this probably hurt very much.”", "quote-author": ""}, "bioImage": null, "headerImage": null}, "related-champions": [{"type": "champion", "release-date": "2011-12-29", "name": "Viktor", "slug": "viktor", "echelon": 0, "associated-faction": "", "associated-faction-slug": "zaun", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Viktor_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 908, "y": 23, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}]}, {"type": "champion", "release-date": "2009-04-18", "name": "Singed", "slug": "singed", "echelon": 1, "associated-faction": "", "associated-faction-slug": "zaun", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Singed_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 945, "y": 4, "featured-champions": []}, "role": [{"name": "Tank", "slug": "tank"}, {"name": "Fighter", "slug": "fighter"}]}], "explore-champions": [], "modules": [{"type": "story-preview", "title": "Do No Harm", "subtitle": null, "description": "<p><i>It has been while</i>, Mundo thought, stroking the massive purple tongue that hung from his mouth like an executed criminal swinging from gallows, <i>since Mundo made a housecall</i>.</p>", "story-slug": "drmundo-color-story", "featured-image": null, "background": {"type": "image", "title": {"cs_cz": "Větrací stanice, vstup do Mihotavého baru v podzemí", "de_de": "Die Atemstation, der Eingang zur Schimmerbar weiter unten", "el_gr": "Σταθμός Ανάπαυσης, είσοδος για το Λαμπρό Μπαρ πιο κάτω", "en_au": "Breather Station, entrance to Shimmer Bar below", "en_gb": "Breather Station, entrance to Shimmer Bar below", "en_ph": "Breather Station, entrance to Shimmer Bar below", "en_pl": "Breather Station, entrance to Shimmer Bar below", "en_sg": "Breather Station, entrance to Shimmer Bar below", "en_us": "Breather Station, entrance to Shimmer Bar below", "es_ar": "Estación del Respiradero, entrada a La Taberna Brillante", "es_es": "Estación del Respiradero, entrada a La Tasca Brillante", "es_mx": "Estación del Respiradero, entrada a La Taberna Brillante", "fr_fr": "Station de repos, entrée du Bar scintillant", "hu_hu": "A Lélegeztetőállomás, alatta a Csillám bár bejárata.", "id_id": "Breather Station, pintu masuk menuju Shimmer Bar di bawah", "it_it": "La Stazione del Riposo, l'ingresso per il Bar Brillante", "ja_jp": "ブリーザー・ステーション。下にあるシマー・バーへの入口", "ko_kr": "아래의 시머 바로 들어갈 수 있는 브리더 역", "ms_my": "Breather Station, laluan masuk ke Shimmer Bar di bawah", "pl_pl": "Stacja Wytchnienia, poniżej wejście do Lśniącego Baru", "pt_br": "Estação do Respiradouro, entrada do Bar Brilhante", "ro_ro": "Stație de respirat și intrare într-un bar ''scânteiat'' aflat dedesubt", "ru_ru": "Вентиляционная станция, вход в бар ''Мерцание'', расположенный ниже.", "th_th": "Breather Station ทางเข้า Shimmer Bar อยู่ด้านล่าง", "tr_tr": "Hemen altında yer alan Işıldayan Bar'ın da girişi olan Havalandırma Garı", "vn_vn": "Trạm Thông Gió, lối vào Quán Lấp Lánh bên dưới", "zh_cn": "呼气站，通往下方微光酒吧的入口", "zh_tw": "充氣站，往微光酒吧地下的入口"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/factions/image-gallery/zaun-breatherstation.jpg", "encoding": "image/jpeg", "width": 1920, "height": 1067, "x": 940, "y": 800, "featured-champions": []}, "url": "/en_us/story/drmundo-color-story", "release-date": "2016-12-02T08:00:00.000Z", "featured-champions": [{"type": "champion", "release-date": "2009-09-02", "name": "Dr. Mundo", "slug": "drmundo", "echelon": 0, "associated-faction": "", "associated-faction-slug": "zaun", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/DrMundo_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 965, "y": 131, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}], "word-count": 1005, "minutes-to-read": 4}, {"section-title": "", "type": "image-gallery", "isFanArt": false, "fan-art-url": "", "featured-image": "", "title": "", "subtitle": "", "description": "", "assets": [{"type": "image", "title": {"cs_cz": "Grafický návrh Dr. Munda", "de_de": "Dr. Mundo – Konzeptzeichnung", "el_gr": "Concept art για τον Δρ. Μούντο", "en_au": "Dr. Mundo concept art", "en_gb": "Dr. Mundo concept art", "en_ph": "Dr. Mundo concept art", "en_pl": "Dr. Mundo concept art", "en_sg": "Dr. Mundo concept art", "en_us": "Dr. Mundo concept art", "es_ar": "Arte conceptual del Dr. Mundo", "es_es": "Arte conceptual del Dr. Mundo", "es_mx": "Arte conceptual del Dr. Mundo", "fr_fr": "Ébauche conceptuelle de Dr. Mundo", "hu_hu": "Dr. Mundo koncepciórajza", "id_id": "Konsep Art Dr. Mundo", "it_it": "Bozzetto di Dr. Mundo", "ja_jp": "ドクター・ムンド コンセプトアート", "ko_kr": "문도 박사 컨셉 아트", "ms_my": "Konsep seni Dr. Mundo", "pl_pl": "Dr Mundo — grafika koncepcyjna", "pt_br": "Arte conceitual de Dr. Mundo", "ro_ro": "Dr. Mundo – imagine conceptuală", "ru_ru": "Эскиз Доктора Мундо", "th_th": "ภาพคอนเซปต์ของ Dr. Mundo", "tr_tr": "Dr. Mundo konsept çalışması", "vn_vn": "Hình mẫu Dr. Mundo", "zh_cn": "蒙多医生概念艺术", "zh_tw": "蒙多醫生 概念藝術"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/image-gallery/dr_mundo_concept.jpg", "encoding": "image/jpeg", "width": 1277, "height": 1080, "x": 791, "y": 343, "featured-champions": []}], "featured-champions": [{"type": "champion", "release-date": "2009-09-02", "name": "Dr. Mundo", "slug": "drmundo", "echelon": 0, "associated-faction": "", "associated-faction-slug": "zaun", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/DrMundo_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 965, "y": 131, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}]}]}