{"id": "ivern", "name": "ivern Champion Page", "locale": "en_us", "champion": {"release-date": "2016-10-05", "slug": "ivern", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Ivern_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 569, "y": 0, "featured-champions": []}, "video": {"type": "video", "title": "", "subtitle": "", "description": {"en_us": ""}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/videos/ivern-splashvideo.webm", "width": 1280, "height": 720, "x": 498, "y": 0, "featured-champions": []}, "associated-faction-slug": "ionia", "roles": [{"name": "Support", "slug": "support"}, {"name": "Mage", "slug": "mage"}], "name": "Ivern", "title": "the Green Father", "game-info-url": "http://gameinfo.na.leagueoflegends.com/en/game-info/champions/ivern", "biography": {"full": "<p>Ivern Bramblefoot, known to many as the Green Father, is a peculiar half man, half tree who roams Runeterra’s forests, cultivating life everywhere he goes. He knows the secrets of the natural world, and holds deep friendships with all things that grow, fly, and scuttle. Ivern wanders the wilderness, imparting strange wisdom to any he meets, enriching the forests, and occasionally entrusting loose-lipped butterflies with his secrets.</p><p>In the early days of the Freljord, Ivern was a fierce warrior with an iron will and unflinching resolve. However, he was powerless when the Iceborn rose to prominence and looked down upon Ivern and his kind as hapless mortals who dared challenge their will. He plotted with his kinsmen to overthrow their sorcerous masters. Ivern the Cruel and the battle-hardened battalion under his command set sail from the frozen harbors of Frostguard for a faraway land that, according to legend, was the source of all magic. If Ivern could seize such a power for his own, then he could break the Iceborn. As the fleet crested the horizon, they sailed out of memory and into myth, for they were never seen again, and faded from Freljordian history like tracks in the winter’s snow.</p><p>The sea, in abject rejection of their noble goals, fell on them with waves like crushing jaws, and shook the resolve of even the heartiest of men. Ivern, after putting many mutinous cowards to the sword, landed his armada on the shores of Ionia and mercilessly cut down the native resistance. The Ionians surrendered, and led the Freljordians to a sacred grove known as Omikayalan, the Heart of the World. Most of Ivern’s men thought this a gift to the conquerors, a sign of loyalty. But it was there, in that strange and verdant garden, where they met the fiercest resistance.</p><p>A mysterious new foe arose. Chimeric beings, half human, half animal, stalked the dwindling battalion, relentlessly cutting down the would-be conquerors. Undeterred, Ivern pressed on until the remnants of his army, battered and few, discovered what the Ionians held so sacred: the God-Willow, a massive tree, dripping with long gossamer leaves that shimmered with golden-green light. While his men were being slaughtered in a final assault, Ivern stood transfixed by the mystical tree. Seeking to shatter the resolve of his foes, he gripped his battle-axe, and swung at the tree with the force of ten men. He felt no impact. He felt nothing. There was only blinding light when he felled the God-Willow and extinguished all the lifeforce within it.</p><p>What happened next was even stranger—his hands fused and became one with the battle-axe and God-Willow’s hardwood. His limbs grew in length, and became knotty and rough to the touch. He stood helpless as the rest of his body followed suit. Within moments, he was ten feet tall, staring down over a field of his slain comrades. He could not feel his heart pumping, but he was awake and aware.</p><p>He heard a voice deep inside him. “Watch,” it said.</p><p>In what felt like seconds, the bodies decayed under legions of colorful mushrooms and buzzing insects. Flesh fed the carrion birds and wolves alike. Bones rotted into fertile soil, and seeds from fruit eaten by the conquerors budded and sprouted into trees with fruit of their own. Hills rose and fell, like lungs gently filling with breath. Leaves and petals pulsed like colorful hearts. From the death that surrounded him, life exploded forth in ways too numerous to believe.</p><p>Never had Ivern beheld such beauty. Life, in all its forms, was tangled together like an impossible knot that didn’t want to be untied. He reflected on the mistakes he’d made, the cruelty he’d visited on others, and felt an overwhelming sense of sorrow.</p><p>He wept, and dewdrop tears sprang up on the bark and leaves that now covered his newly tree like body. Am I now becoming the God-Willow? he wondered.</p><p>Then the voice inside Ivern told him something new. “Listen,” it said. So he did.</p><p>At first, he heard nothing. Then: the whimpers of countless beasts, the bawling of rivers, the howling of trees and the dripping tears of moss. They lamented the God-Willow’s death in a symphony of mourning. Remorse washed over Ivern, and he cried out for forgiveness. A tiny squirrel snuggled at his legs. He felt the gaze of nearby animals. Plants reached out for him with their roots. Nature’s gaze fixed on him, and he felt the seeping warmth of forgiveness.</p><p>When Ivern finally moved, over a century had passed and the world felt new. The violence and cruelty of his old self were echoes in his heart. Never again would he be the man who wrought so much destruction. He even asked the voice deep inside, why him? Why was he spared?</p><p>The voice spoke a third time. “Grow,” it said.</p><p>This puzzled him. Was he supposed to grow or help the world grow? He decided it was probably both; after all, who couldn’t use a bit of extra growth? Ivern looked at himself, his barklike skin, the mushroom on his arm, the family of squirrels tucked away in the area where his scabbard used to reside. This new body astounded him. He found he could dig his toes deep into the soil and commune with roots and insects alike: even the dirt itself had opinions!</p><p>Ivern decided an excellent start was to get to know all the world’s inhabitants, and so he did. It took a few centuries—how many exactly, Ivern couldn’t say, because time flies when one is having such a good time. He wandered the world and developed close kinships with all creatures great and small. He observed their foibles, delighting in their little habits, and occasionally offering a helping hand. He shortened the inchworm’s path, played tricks with mischievous bramblebacks, hugged thorny elmarks to happiness, and laughed with wizened elder-fungus. Everywhere Ivern went, forests blossomed in perpetual springtime and beasts dwelled in harmony.</p><p>On occasion, he rescued creatures unjustly wounded by careless predators. In one instance, he found a wounded stone-golem. Knowing the poor creature was on the verge of death, he fashioned her a new heart from a river pebble. Adhering to the tradition of all mineral beings, the golem became Ivern’s devoted life-friend. He named her Daisy, after the flowers that mysteriously sprouted from her stone body. Today, if Ivern is threatened, she races to his side.</p><p>Sometimes, he encountered communities of humans, many of them somewhat peaceful. They called him Bramblefoot or the Green Father and told tales of his strange benevolence. But how they took more than they gave, how they could be cruel and human, unnerved Ivern, and he retreated from their company.</p><p>Then the voice inside of him spoke for a fourth time.</p><p>“Show,” it said.</p><p>Ivern left the woodlands and journeyed out to meet a world blanketed in mankind. The resolve he’d once felt returned, but this time it wasn’t driven by malice or cruelty. One day, he hoped to replace what he took. If he was called to be the new God-Willow, he needed to cultivate humanity, help them watch, listen, and grow. Being human once himself, Ivern knew this would be difficult, so he smiled and challenged himself to complete this task before the final setting of the sun. He knew he would have the time.</p>", "short": "Ivern Bramblefoot, known to many as the Green Father, is a peculiar half man, half tree who roams Runeterra’s forests, cultivating life everywhere he goes. He knows the secrets of the natural world, and holds deep friendships with all things that grow, fly, and scuttle. Ivern wanders the wilderness, imparting strange wisdom to any he meets, enriching the forests, and occasionally entrusting loose-lipped butterflies with his secrets.", "quote": "“The cleverness of mushrooms always surprises me.”", "quote-author": ""}, "bioImage": null, "headerImage": null}, "related-champions": [], "explore-champions": [], "modules": [{"slug": "ivern-promo", "section-title": "", "type": "featured-video", "featured-image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/featuredvideocover/ivern-promo.jpg", "encoding": "image/jpeg", "width": 1280, "height": 720, "x": 641, "y": 77, "featured-champions": []}, "title": "Ivern: Friend of the Forest", "subtitle": "", "description": "From the cuddliest of creatures to the fiercest of beasts, all life is precious. And Ivern, Friend of the Forest, is there to protect it.", "video": {"type": "video", "title": "", "subtitle": "", "description": [], "uri": "https://www.youtube.com/watch?v=D6PHb5xTO64", "width": "", "height": "", "x": "", "y": "", "featured-champions": [{"type": "champion", "release-date": "2016-10-05", "name": "Ivern", "slug": "ivern", "echelon": 0, "associated-faction": "", "associated-faction-slug": "ionia", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Ivern_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 569, "y": 0, "featured-champions": []}, "role": [{"name": "Support", "slug": "support"}, {"name": "Mage", "slug": "mage"}]}]}, "blackout": null, "release-date": "2016-09-14T08:00:00.000Z", "video-type": "animation"}, {"type": "story-preview", "title": "Gift of Venom", "subtitle": null, "description": "<p>For most people, a hundred years is a very long time. In a century, one could explore the entire world, meet thousands of people, or complete countless works of art. Now, anyone could easily assume that standing in one spot for over a century would be a colossal waste. But during that time, Ivern Bramblefoot accomplished more than any could dream.</p>", "story-slug": "ivern-color-story", "featured-image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Ivern_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 569, "y": 0, "featured-champions": []}, "background": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/ivern_colorstory.png", "encoding": "image/jpeg", "width": 1920, "height": 1044, "x": 195, "y": 499, "featured-champions": []}, "url": "/en_us/story/ivern-color-story", "release-date": "2016-10-05T08:00:00.000Z", "featured-champions": [{"type": "champion", "release-date": "2016-10-05", "name": "Ivern", "slug": "ivern", "echelon": 0, "associated-faction": "", "associated-faction-slug": "ionia", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Ivern_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 569, "y": 0, "featured-champions": []}, "role": [{"name": "Support", "slug": "support"}, {"name": "Mage", "slug": "mage"}]}], "word-count": 2280, "minutes-to-read": 9}]}