{"id": "jayce", "name": "Jayce Champion Page", "locale": "en_us", "champion": {"release-date": "2012-07-07", "slug": "jayce", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Jayce_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1007, "y": 182, "featured-champions": []}, "video": {"type": "video", "title": "", "subtitle": "", "description": {"en_us": ""}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/videos/jayce-splashvideo.webm", "width": 1280, "height": 720, "x": 1007, "y": 182, "featured-champions": []}, "associated-faction-slug": "piltover", "roles": [{"name": "Fighter", "slug": "fighter"}, {"name": "Marksman", "slug": "marksman"}], "name": "Jayce", "title": "the Defender of Tomorrow", "game-info-url": "http://gameinfo.na.leagueoflegends.com/en/game-info/champions/jayce", "biography": {"full": "<p>Jayce is a brilliant inventor who has pledged his life to the defense of Piltover and its unyielding pursuit of progress. With his transforming hextech hammer in hand, Jayce uses his strength, courage, and considerable intelligence to protect his hometown. While revered throughout the city as a hero, he hasn’t taken well to the attention it brings. Still, Jayce’s heart is in the right place, and even those who envy his natural skills are grateful for his protection in the City of Progress.</p><p>A native son of Piltover, Jayce was raised to believe in the principles that made the city great: Invention. Discovery. Not going to Zaun if you could help it. With a knack for understanding machinery, Jayce earned the honor of being the youngest apprenta to ever be offered patronage by Clan Giopara, one of Piltover’s most respected ruling clans. Utterly unsurprised, Jayce took the offer, and spent most of his early years constructing potential hextech devices and designing transformable multi-tools for Piltover’s working class: a wrench that transformed into a prybar, a pickaxe that could morph into a shovel, a hammer that could turn into a demolition beam, if only it had a sufficiently powerful battery. Everything Jayce touched put his contemporaries to shame.</p><p>Most things came easy to Jayce, and he could never understand why his peers had so much trouble with what, to him, were simple concepts. As a result, nearly everyone who worked alongside Jayce found him arrogant, dismissive, and unwilling to slow his pace to help his colleagues catch up. As time went on, his patience became shorter, while at the same time, a chasm grew between decorum, charm, and Jayce’s natural demeanor.</p><p>Only one person ever managed to match Jayce’s intelligence while also maintaining a healthy indifference to his superior attitude.</p><p>His name was Viktor.</p><p>The two met at a mandatory Progress Day party, and immediately bonded over how little either of them wanted to be there. They started working together shortly after. Viktor expanded Jayce’s intellectual horizons and challenged many of his assumptions. While Jayce sought to improve humanity via versatile technology, Viktor sought to solve problems inherent to humanity itself, such as physical decay or illogical prejudices. They constantly argued with one another, but their conflicts never got personal – though their methods were different, the two colleagues knew their ultimate goals were very much the same. More than that, they both knew what it was like to be ostracized by their colleagues: Viktor because of his unconventional thinking, Jayce because of his rudeness.</p><p>Together, Jayce and Viktor invented a mechanized construction suit for Piltover’s dockworkers – something hearty enough to enhance the wearer’s strength, but light enough that its wearer wouldn’t immediately drown upon falling overboard. However, the two reached an impasse when Viktor’s design for the next version of the suit included a chemtech implant that would increase the wearer’s strength output by tenfold, while also preventing them from getting tired, panicking, or disobeying instructions from their superiors. While Viktor considered this feature a brilliant means of reducing the frequency of construction accidents, Jayce found its indifference toward free will immoral. The two nearly came to blows over the design and ultimately, after Jayce warned the academy of Viktor’s invention, Viktor was stripped of his honors and ostracized from Piltover’s scientific community. </p><p>Viktor was the closest thing Jayce had ever really had to a friend, and distraught over their falling-out, went back to working on his own. He grew more insular. His patience toward others grew even thinner.</p><p>As Jayce studied in solitude, Clan Giopara’s explorers discovered a raw, blue crystal deep within the Shuriman desert. Though Jayce volunteered to experiment on it (specifically by suggesting the clan’s other scholars wouldn’t be smart enough to get anything out of it), his lack of tact in doing so prompted Clan Giopara to give it to their better-mannered scholars as a form of punishment. Yet, after many months, the scholars reached a unanimous conclusion: the crystal was worthless. A power-drained hunk of rock. The disappointed clan leaders finally handed the crystal over to Jayce, assuming that even he, with his remarkable intelligence, wouldn’t be able to learn anything from it.</p><p>Something inside the crystal called to Jayce. No, more than that – it sang to him. He couldn’t explain why, but he knew the Shuriman gem still held mysteries yet to be discovered.</p><p>He spent many months running every variety of test on the crystal. He braced it into a cogwheel centrifuge; he superheated it and deep-froze it; he tinkered, and observed, and hypothesized, and beat his head against his copper pantograph. Quite simply, Jayce wasn’t used to working hard: this damned crystal was the first thing that had ever resisted his considerable mental aptitude. For the first time, he realized how his peers must have felt, trying so hard to solve a problem, only to bump against your own limitations. It felt frustrating. It felt unfair. </p><p>And it probably felt much, much worse if you were working alongside an arrogant inventor who dismissed your every effort. </p><p>Jayce realized that despite how dismissive he’d been toward his fellow scholars, none of them ever gave up. None of them ever stopped seeking the very things that defined Piltover: Progress. Discovery. If they wouldn’t give up, Jayce decided, he wouldn’t either. </p><p>And maybe he’d try to be nicer. </p><p>Maybe.</p><p>Jayce approached the problem from a completely different angle. Rather than trying to experiment on the crystal as a whole, he wondered, why not run more invasive experiments on a smaller shard? Jayce chiseled off a piece of the crystal and suspended it in a liquid alloy. As he sent a voltaic current through the liquid metal, Jayce’s eardrums nearly shattered from the booming baritone note that blasted from the shard. Heat radiated from the crystal and, with a flash, it glowed bright enough to nearly blind him. This was unexpected. This was potentially dangerous. But this was progress. Jayce couldn’t erase the smile from his face as he worked well through the night, into the dawn. </p><p>The next day, Jayce was surprised to find his old friend Viktor on his doorstep. Alerted by the massive power spike from the crystal shard, Viktor had a simple proposition.</p><p>Since his expulsion from the Piltovan scientific community, Viktor had commenced work on a secret project in Zaun. He’d finally learned how to achieve his dream – how to eradicate disease, hunger, hatred. If Jayce joined him, the two would accomplish more than anyone from Piltover or Zaun could have dreamed of: they’d save humanity from itself. </p><p>Jayce had heard a monologue like this before from Viktor. He never liked where it led.</p><p>Viktor told Jayce that he only needed one thing for his Glorious Evolution – a power source like Jayce’s crystal. Jayce disagreed, informing Viktor that what he truly needed was a moral compass. Viktor, who had long grown tired of Jayce’s rudeness, leapt upon him, grabbed the crystal and knocked Jayce unconscious with it. When Jayce awoke hours later, he noticed that though the Shuriman crystal was gone Viktor hadn’t seemed to notice or care about the smaller shard.</p><p>Jayce knew whatever Viktor was planning, he would only resort to these measures if he were close to completion. Even though he didn’t know what Viktor’s Glorious Evolution consisted of, it probably didn’t have a lot of respect for the free will of others. Without wasting a second, Jayce retrieved the suspended shard and installed it into a massive, transforming hammer – a demolitions invention he’d abandoned years ago for lack of a strong enough battery to power it. Though he had no idea where Viktor might have taken the crystal, he could feel the hextech hammer vibrate, pulling him not north, south, east or west, but down, toward the undercity of Zaun.</p><p>The shard, eager to be reunited with the crystal from which it was chiseled, eventually led Jayce to a warehouse in the depths of the sump. Within the cavernous building, Jayce found something horrifying. Dozens of corpses, their skulls sawed open and hollowed out, their brains transplanted into an army of immobile metal soldiers, hooked up to the now-pulsing crystal. </p><p>This was the first step in Viktor’s Glorious Evolution.</p><p>Jayce’s stride grew less confident as he approached Viktor. He and Viktor had not always seen eye to eye, but this was something else entirely. For the first time, it occurred to Jayce that he might have to kill his old friend.</p><p>He called out to Viktor, flinching as the army of robots stood to attention. Jayce asked him to look around – to see what he was doing. Whatever this was – this Evolution – wasn’t the progress they fought for in their youths. He even, to Viktor’s surprise, apologized for acting like such a jerk. </p><p>Viktor sighed. He had only two words in response: “Kill him.”</p><p>The automatons sprinted toward Jayce, breaking free of the wires connecting them to the crystal and introducing Jayce to another new emotion: panic. He gripped the hammer tight, realizing he’d never actually used it before. When the first golem was within reach, he swung as hard as he could, feeling the shard’s energy surge through his muscles, accelerating the hammer’s movement until Jayce was worried it might fly out of his hands.</p><p>It slammed into the automaton, all but exploding it into a hail of metal. Despite the obliteration of their comrade, the other machines didn’t even pause as they rushed at Jayce, trying to pummel him into unconsciousness.</p><p>Jayce analyzed the formation of the mechanical wave coming at him and attempted to quickly calculate how to take out the largest number of them with the fewest amount of swings. It was pointless; they were on him before he could swing even once. As he fell to the ground under a storm of their blows, Jayce saw Viktor looking on, not with triumph, but with sadness. He’d outsmarted Jayce and ensured humanity’s future, but he knew that future came at a cost: he couldn’t let his old friend live. Jayce vanished under a sea of swinging metal limbs.</p><p>That’s when Jayce, for the first time in his life, decided to stop thinking and just break stuff.</p><p>No longer caring for his own safety, Jayce used every last bit of strength he had to break free from Viktor’s automatons. He sprinted to the glowing crystal, and struck it with all of the hextech-enhanced force his hammer could muster, crushing the mystical object.</p><p>Viktor cried out in horror as the crystal shattered to fragments, the shockwave blasting them all backward as the army of automatons collapsed lifelessly to the floor. The very foundations of the warehouse shook, and Jayce barely managed to escape before the entire building toppled. </p><p>Viktor’s body was never found.</p><p>Upon his return to Piltover, Jayce informed his clan masters of Viktor’s nefarious plans. Soon, Jayce found himself a topic of discussion in both Zaun and Piltover alike. Hailed for his quick thinking in a time of crisis, Jayce became a beloved figure (at least, amongst those who hadn’t met him), earning himself a nickname: the Defender of Tomorrow.</p><p>Jayce cared little for the adoration of his fellow Piltovans, but took the nickname to heart. He knew that Viktor was still out there, plotting his revenge. One day – maybe someday soon – an awful lot of trouble was headed for Piltover.</p><p>And Jayce would be waiting. </p>", "short": "Jayce is a brilliant inventor who has pledged his life to the defense of Piltover and its unyielding pursuit of progress. With his transforming hextech hammer in hand, Jayce uses his strength, courage, and considerable intelligence to protect his hometown. While revered throughout the city as a hero, he hasn’t taken well to the attention heroism brings. Still, Jayce’s heart is in the right place, and even those who envy his natural skills are grateful for his protection in the City of Progress.", "quote": "“Picking a fight with me is the dumbest thing you’ve done today – and that’s saying a lot.”", "quote-author": ""}, "bioImage": null, "headerImage": null}, "related-champions": [{"type": "champion", "release-date": "2010-03-16", "name": "Ezreal", "slug": "ezreal", "echelon": 0, "associated-faction": "", "associated-faction-slug": "piltover", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/Ezreal_splash.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 815, "y": 141, "featured-champions": []}, "role": [{"name": "Marksman", "slug": "marksman"}, {"name": "Mage", "slug": "mage"}]}, {"type": "champion", "release-date": "2016-11-28", "name": "Camille", "slug": "camille", "echelon": 1, "associated-faction": "", "associated-faction-slug": "piltover", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/camille_splash.jpg", "encoding": "image/jpeg", "width": 1024, "height": 616, "x": 969, "y": 6, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}]}, {"type": "champion", "release-date": "2011-01-04", "name": "Caitlyn", "slug": "caitlyn", "echelon": 2, "associated-faction": "", "associated-faction-slug": "piltover", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Caitlyn_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1024, "y": 7, "featured-champions": []}, "role": [{"name": "Marksman", "slug": "marksman"}]}, {"type": "champion", "release-date": "2012-12-19", "name": "Vi", "slug": "vi", "echelon": 3, "associated-faction": "", "associated-faction-slug": "piltover", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Vi_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 926, "y": 135, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Assassin", "slug": "assassin"}]}, {"type": "champion", "release-date": "2011-12-29", "name": "Viktor", "slug": "viktor", "echelon": 4, "associated-faction": "", "associated-faction-slug": "zaun", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Viktor_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 908, "y": 23, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}]}, {"type": "champion", "release-date": "2011-08-09", "name": "Skarner", "slug": "skarner", "echelon": 5, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Skarner_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1004, "y": 276, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}], "explore-champions": [], "modules": [{"type": "story-preview", "title": "A Quick Fix", "subtitle": null, "description": "<p>Any fool could have predicted that Viktor would strike back at some point. If one weren’t a fool, one might predict the exact date and time of an attempted counterattack.</p>", "story-slug": "jayce-color-story", "featured-image": null, "background": {"type": "image", "title": {"cs_cz": "Ekliptické trezory, nejbezpečnější banka Piltoveru", "de_de": "Die ekliptischen Gewölbe, sicherste Bank in ganz Piltover", "el_gr": "Το Εκλειπτικό Χρηματοφυλάκιο, η πιο ασφαλής τράπεζα του Πιλτόβερ", "en_au": "The Ecliptic Vaults, Piltover’s most secure bank", "en_gb": "The Ecliptic Vaults, Piltover’s most secure bank", "en_ph": "The Ecliptic Vaults, Piltover’s most secure bank", "en_pl": "The Ecliptic Vaults, Piltover’s most secure bank", "en_sg": "The Ecliptic Vaults, Piltover’s most secure bank", "en_us": "The Ecliptic Vaults, Piltover’s most secure bank", "es_ar": "Las Bóvedas Eclípticas, el banco más seguro de Piltóver", "es_es": "Las Criptas Eclípticas, el banco más seguro de Piltover", "es_mx": "Las Bóvedas Eclípticas, el banco más seguro de Piltóver", "fr_fr": "Les Coffres écliptiques, la banque la plus sûre de Piltover", "hu_hu": "Az Ekliptikus Trezor, Piltover legbiztonságosabb bankja", "id_id": "The Ecliptic Vaults, Bank Paling Aman di Piltover", "it_it": "I Forzieri dell'Eclisse, la banca più sicura di Piltover", "ja_jp": "黄道金庫室。ピルトーヴァーでもっとも警備の厳重な金庫室", "ko_kr": "필트오버에서 가장 안전한 은행, 천공의 금고", "ms_my": "Ecliptic Vaults, bank Piltover yang paling selamat", "pl_pl": "Ekliptyczny Skarbiec, najbezpieczniejszy bank w Piltover", "pt_br": "Cofres Eclípticos, o banco mais seguro de Piltover", "ro_ro": "Vistieria Ecliptică, cea mai sigură bancă din Piltover", "ru_ru": "Эклиптическое хранилище, самый защищенный банк Пилтовера.", "th_th": "Ecliptic Vaults ธนาคารที่ปลอดภัยที่สุดของ Piltover", "tr_tr": "PILTOVER'IN en iyi korunan bankası Ekliptik Kasa", "vn_vn": "Kho Hoàng Đạo, ngân hàng an toàn nhất Piltover", "zh_cn": "黄道地库，皮尔特沃夫最安全的银行", "zh_tw": "黃地道窖，皮爾托福守備最嚴密的銀行"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/factions/image-gallery/piltover-eclipticvaults.jpg", "encoding": "image/jpeg", "width": 1920, "height": 1004, "x": 966, "y": 958, "featured-champions": []}, "url": "/en_us/story/jayce-color-story", "release-date": "2016-12-02T08:00:00.000Z", "featured-champions": [{"type": "champion", "release-date": "2012-07-07", "name": "Jayce", "slug": "jayce", "echelon": 0, "associated-faction": "", "associated-faction-slug": "piltover", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Jayce_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1007, "y": 182, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Marksman", "slug": "marksman"}]}], "word-count": 1255, "minutes-to-read": 5}, {"section-title": "", "type": "image-gallery", "isFanArt": false, "fan-art-url": "", "featured-image": "", "title": "", "subtitle": "", "description": "", "assets": [{"type": "image", "title": {"cs_cz": "Grafický návrh Jayce", "de_de": "Jayce – Konzeptzeichnung", "el_gr": "Concept art για τον Τζέις", "en_au": "Jayce concept art", "en_gb": "Jayce concept art", "en_ph": "Jayce concept art", "en_pl": "Jayce concept art", "en_sg": "Jayce concept art", "en_us": "Jayce concept art", "es_ar": "Arte conceptual de Jayce", "es_es": "Arte conceptual de Jayce", "es_mx": "Arte conceptual de Jayce", "fr_fr": "Ébauche conceptuelle de Jayce", "hu_hu": "Jayce koncepciórajza", "id_id": "Konsep Art Jayce", "it_it": "Bozzetto di Jayce", "ja_jp": "ジェイス コンセプトアート", "ko_kr": "제이스 컨셉 아트", "ms_my": "Konsep seni Jayce", "pl_pl": "Jayce — grafika koncepcyjna", "pt_br": "Arte conceitual de Jayce", "ro_ro": "Jayce – imagine conceptuală", "ru_ru": "Эскиз Джейса", "th_th": "ภาพคอนเซปต์ของ Jayce", "tr_tr": "Jayce konsept çalışması", "vn_vn": "Hình mẫu Jayce", "zh_cn": "杰斯概念艺术", "zh_tw": "傑西 概念藝術"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/image-gallery/jayce_front_back.jpg", "encoding": "image/jpeg", "width": 1920, "height": 774, "x": 314, "y": 17, "featured-champions": []}], "featured-champions": [{"type": "champion", "release-date": "2012-07-07", "name": "Jayce", "slug": "jayce", "echelon": 0, "associated-faction": "", "associated-faction-slug": "piltover", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Jayce_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1007, "y": 182, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Marksman", "slug": "marksman"}]}]}, {"slug": "jayce-artspotlight", "section-title": "", "type": "featured-video", "featured-image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/featuredvideocover/jayce-artspotlight.png", "encoding": "image/jpeg", "width": 1906, "height": 1067, "x": 1046, "y": 511, "featured-champions": []}, "title": "Jayce Art Spotlight", "subtitle": "", "description": "Inspiration can sometimes strike like the blast from a massive cannon, or a heavy-hitting blow from a gigantic hammer. Please enjoy this high-speed capture of our rendering of Jayce, the Defender of Tomorrow.", "video": {"type": "video", "title": "", "subtitle": "", "description": [], "uri": "https://www.youtube.com/watch?v=nT_dpnbH_oo", "width": "", "height": "", "x": "", "y": "", "featured-champions": [{"type": "champion", "release-date": "2012-07-07", "name": "Jayce", "slug": "jayce", "echelon": 0, "associated-faction": "", "associated-faction-slug": "piltover", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Jayce_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1007, "y": 182, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Marksman", "slug": "marksman"}]}]}, "blackout": null, "release-date": "2012-07-03T08:00:00.000Z", "video-type": "art-spotlight"}, {"slug": "jayce-login", "section-title": "", "type": "featured-video", "featured-image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Jayce_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1007, "y": 182, "featured-champions": []}, "title": "Jayce: Login Theme", "subtitle": "", "description": "", "video": {"type": "video", "title": "", "subtitle": "", "description": [], "uri": "https://www.youtube.com/watch?v=OcIE8UQKXdQ", "width": "", "height": "", "x": "", "y": "", "featured-champions": [{"type": "champion", "release-date": "2012-07-07", "name": "Jayce", "slug": "jayce", "echelon": 0, "associated-faction": "", "associated-faction-slug": "piltover", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Jayce_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1007, "y": 182, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Marksman", "slug": "marksman"}]}]}, "blackout": null, "release-date": "2012-07-07T08:00:00.000Z", "video-type": "champ-login-music"}]}