{"id": "karthus", "name": "Karthus Champion Page", "locale": "en_us", "champion": {"release-date": "2009-06-12", "slug": "karthus", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Karthus_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 901, "y": 0, "featured-champions": []}, "video": null, "associated-faction-slug": "shadow-isles", "roles": [{"name": "Mage", "slug": "mage"}], "name": "Karthus", "title": "the Deathsinger", "game-info-url": "http://gameinfo.na.leagueoflegends.com/en/game-info/champions/karthus", "biography": {"full": "<p>The harbinger of oblivion, Karthus is an undying spirit whose haunting songs are a prelude to the horror of his nightmarish appearance. The living fear the eternity of undeath, but Karthus sees only beauty and purity in its embrace, a perfect union of life and death. When Karthus emerges from the Shadow Isles, it is to bring the joy of death to mortals, an apostle of the unliving.</p><p>Karthus was born into abject poverty in the sprawl of dwellings built beyond the walls of the Noxian capital. His mother died at the moment of his birth, leaving his father to raise him and his three sisters alone. They shared a crumbling, rat-infested almshouse with scores of other families, subsisting on a diet of rainwater and vermin. Of all the children, Karthus was the best ratter, and regularly brought gnawed corpses for the cook-pot.</p><p>Death was commonplace in the slums of Noxus, and many mornings began with the wailing of bereaved parents who woke to discover their child cold and lifeless beside them. Karthus learned to love these laments, and would watch, fascinated, as the tally-men of Kindred notched their staffs and bore the bodies from the almshouse. At night the young Karthus would sneak through the cramped rooms, seeking those whose lives hung by a thread, hoping to witness the moment their soul passed from life to death. For years, his nightly travels were fruitless, as it was impossible to predict exactly when a person would die. He was denied witnessing the moment of death until it reached his own family.</p><p>Outbreaks of disease were frequent in such cramped confines, and when Karthus’s sisters sickened with the plague, he watched over them intently. While his father drowned his grief, Karthus was the ever dutiful brother, caring for his sisters as the disease consumed them. He watched each of them as they died, and a sublime connection seemed to reach into him as the light faded from their eyes - a yearning to see what lay beyond death and unlock the secrets of eternity. When the tally-men came for the bodies, Karthus followed them back to their temple, asking them question after question about their order and the workings of death. Could a person exist at the moment where life ends, but before death begins? If such a liminal moment could be understood and held, might the wisdom of life be combined with the clarity of death?</p><p>The tally-men quickly recognized Karthus’s suitability for their order and he was inducted into their ranks, first as a digger of graves and pyre-builder, before ascending to the rank of corpse collector. Karthus guided his bone-cart around the streets of Noxus to gather the dead every day. His dirges quickly became known throughout Noxus, mournful laments that spoke to the beauty of death and the hope that what lay beyond was something to be embraced. Many a grieving family took solace in his songs, finding a measure of peace in his heartfelt elegies. Eventually, Karthus worked in the temple itself, tending to the sick in their final moments, watching as whatever death had laid its claim upon them took its due. Karthus would speak to each person laid before him, ushering their souls into death, in search of further wisdom in their fading eyes.</p><p>Eventually, Karthus reached the conclusion that he could learn no more from mortals, that only the dead themselves could answer his questions. None of the dying souls could tell of what lay beyond, but whispered rumors and tales told to frighten children echoed of a place where death was not the end - The Shadow Isles.</p><p>Karthus emptied the temple’s coffers and bought passage to Bilgewater, a city plagued by a strange black mist said to draw souls to a cursed island far out at sea. No captain was willing to take Karthus to the Shadow Isles, but eventually he came upon a rum-sodden fisherman with a mountain of debts and nothing to lose. The boat plied the ocean for many days and nights, until a storm drove them onto the rocks of an island that appeared on no charts. A black mist rolled out from a haunted landscape of gnarled trees and tumbled ruins. The fisherman freed his boat and turned its prow in terror for Bilgewater, but Karthus leapt into the sea and waded ashore. Steadying himself with his notched tally-staff, he proudly sang the lament he had prepared for the moment of his own death, and his words were carried on a cold wind to the heart of the island.</p><p>The black mist flowed through Karthus, ravaging his flesh and spirit with ancient sorcery, but such was the force of his desire to transcend mortality that it did not destroy him. Instead, it remade him, and Karthus was born anew in the waters of the island as a fleshless revenant.</p><p>Revelation filled Karthus as he became what he always believed he should have been; a being poised at the threshold of death and life. The beauty of this eternal moment filled him with wonder as the wretched spirits of the island rose to behold his transformation, drawn to his passion like predators scenting blood in the ocean. Finally, Karthus was where he belonged, surrounded by those who truly understood the boon undeath truly was. Filled with righteous zeal, he knew he had to return to Valoran and share his gift with the living, to free them from petty mortal concerns.</p><p>Karthus turned and the Black Mist bore him over the waves to the fisherman’s boat. The man fell to his knees before Karthus, begging for his life, and Karthus granted him the blessing of death, ending his mortal suffering and raising him up as an immortal spirit as he sang his lament for passing souls. The fisherman was the first of many such souls Karthus would free, and soon the Deathsinger would command a legion of unliving wraiths. To Karthus’s awakened senses, the Shadow Isles was in a state of apathetic limbo, where the blessings of death were squandered. He would galvanize the dead in a crusade to bring the beauty of oblivion to the living, to end the suffering of mortality and usher in a glorious age of undeath.</p><p>Karthus has become the emissary of the Shadow Isles, the herald of oblivion whose laments are paeans to the glory of death. His legions of unbound souls join with his funereal dirges, their haunting song reaching beyond the Black Mist to be heard on cold nights over graveyards and charnel houses all across Valoran.</p>", "short": "The harbinger of oblivion, Karthus is an undying spirit whose haunting songs are a prelude to the horror of his nightmarish appearance. The living fear the eternity of undeath, but Karthus sees only beauty and purity in its embrace, a perfect union of life and death. When Karthus emerges from the Shadow Isles, it is to bring the joy of death to mortals, an apostle of the unliving.", "quote": "“Death is not the end of the journey, it is just the beginning...”", "quote-author": ""}, "bioImage": null, "headerImage": null}, "related-champions": [{"type": "champion", "release-date": "2010-02-24", "name": "Mordekaiser", "slug": "mordekaiser", "echelon": 0, "associated-faction": "", "associated-faction-slug": "noxus", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/Classic_Mordekaiser_Splash.jpg", "encoding": "image/jpeg", "width": 5146, "height": 2780, "x": 2356, "y": 222, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}]}, {"type": "champion", "release-date": "2013-01-23", "name": "Thresh", "slug": "thresh", "echelon": 1, "associated-faction": "", "associated-faction-slug": "shadow-isles", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Thresh_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 847, "y": 3, "featured-champions": []}, "role": [{"name": "Support", "slug": "support"}, {"name": "Fighter", "slug": "fighter"}]}, {"type": "champion", "release-date": "2011-06-22", "name": "Yorick", "slug": "yorick", "echelon": 2, "associated-faction": "", "associated-faction-slug": "shadow-isles", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Yorick_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 968, "y": 11, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Mage", "slug": "mage"}]}, {"type": "champion", "release-date": "2009-02-21", "name": "Soraka", "slug": "soraka", "echelon": 3, "associated-faction": "", "associated-faction-slug": "mount-targon", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Soraka_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 688, "y": 0, "featured-champions": []}, "role": [{"name": "Support", "slug": "support"}, {"name": "Mage", "slug": "mage"}]}, {"type": "champion", "release-date": "2015-10-14", "name": "Kindred", "slug": "kindred", "echelon": 4, "associated-faction": "", "associated-faction-slug": "unaffiliated", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Kindred_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 983, "y": 220, "featured-champions": []}, "role": [{"name": "Marksman", "slug": "marksman"}]}], "explore-champions": [], "modules": [{"type": "story-preview", "title": "Burial At Sea", "subtitle": null, "description": "<p>The sea was mirror-smooth and dark. A pirate’s moon hung low on the horizon as it had for the last six nights. Not so much as a whisper of wind stirred the air, only that damned dirge carried from who knew where. Vionax had sailed the oceans around Noxus long enough to know that seas like this only ever presaged ill-fortune. She stood on the Darkwill’s foredeck, training her spyglass on the far ocean, searching for anything she could use to plot their position.</p>", "story-slug": "karthus-color-story", "featured-image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Karthus_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 901, "y": 0, "featured-champions": []}, "background": {"type": "image", "title": {"cs_cz": "Zaplavená města", "de_de": "Überflutete Städte", "el_gr": "Πλημμυρισμένες Πόλεις", "en_au": "Flooded Cities", "en_gb": "Flooded Cities", "en_ph": "Flooded Cities", "en_pl": "Flooded Cities", "en_sg": "Flooded Cities", "en_us": "Flooded Cities", "es_ar": "Ciudades Inundadas", "es_es": "Urbes inundadas", "es_mx": "Ciudades Inundadas", "fr_fr": "Cités englouties", "hu_hu": "Elárasztott városok", "id_id": "Flooded Cities", "it_it": "Città inondate", "ja_jp": "水没した都市", "ko_kr": "물에 잠긴 도시", "ms_my": "Flooded Cities", "pl_pl": "Zalane miasta", "pt_br": "Cidades Inundadas", "ro_ro": "Orașe inundate", "ru_ru": "Затопленные города", "th_th": "นครที่ถูกจม", "tr_tr": "SULARA GÖMÜLEN ŞEHİRLER", "vn_vn": "Thành phố bị ngập", "zh_cn": "漫水的城市", "zh_tw": "被淹沒的城市"}, "subtitle": "", "description": {"cs_cz": "Helia, hlavní město Požehnaných ostrovů, se nacházelo na pobřeží. Po Zničení skončilo mnoho z jeho částí pod vodou.", "de_de": "Helia, die Hauptstadt der Gesegneten Inseln, lag an der Küste. Nach der Zerstörung wurden daher große Teile der Stadt vom Meer verschlungen.", "el_gr": "Η Έλια, πρωτεύουσα των Ευλογημένων Νησιών, βρισκόταν στην ακτή. Κατά συνέπεια, πολλά τμήματα της πόλης πλημμύρισαν μετά τον Αφανισμό.", "en_au": "Helia, the capital of the Blessed Isles, was located on the coast. As a result, many parts of the city were flooded after the Ruination.", "en_gb": "Helia, the capital of the Blessed Isles, was located on the coast. As a result, many parts of the city were flooded after the Ruination.", "en_ph": "Helia, the capital of the Blessed Isles, was located on the coast. As a result, many parts of the city were flooded after the Ruination.", "en_pl": "Helia, the capital of the Blessed Isles, was located on the coast. As a result, many parts of the city were flooded after the Ruination.", "en_sg": "Helia, the capital of the Blessed Isles, was located on the coast. As a result, many parts of the city were flooded after the Ruination.", "en_us": "Helia, the capital of the Blessed Isles, was located on the coast. As a result, many parts of the city were flooded after the Ruination.", "es_ar": "Helia, la capital de las Islas Bendecidas, se ubicaba en la costa. Como resultado, varias partes de la ciudad se inundaron tras la Perdición.", "es_es": "Helia, la capital de las Islas Bendecidas, se encontraba en la costa. Como consecuencia, muchas zonas de la ciudad terminaron hundiéndose tras la Ruina.", "es_mx": "Helia, la capital de las Islas Bendecidas, se ubicaba en la costa. Como resultado, varias partes de la ciudad se inundaron tras la Perdición.", "fr_fr": "Helia, la capitale des Îles bénies, était située sur la côte. En conséquence, presque toute la ville fut engloutie après la Ruine.", "hu_hu": "Helia, az Áldott-szigetek fővárosa a tengerparton állt. Ezért a város nagy részét elöntötte a víz a Romlás után.", "id_id": "Helia, ibu kota Blessed Isles, berlokasi di pantai. Hasilnya, banyak bagian kota itu yang terendam air setelah peristiwa Ruination.", "it_it": "Helia, la capitale delle Isole Benedette, sorgeva sulla costa. Per questo motivo, gran parte della città fu inondata dopo la Rovina.", "ja_jp": "ブレスドアイルの首都ヘリアは沿岸部に位置していた。そのため、「破滅」後に街区の大部分は水没した。", "ko_kr": "축복의 빛 군도의 수도인 헬리아는 해안가에 자리 잡고 있다. 그 결과, 대몰락 이후 도시의 대부분이 물에 잠기고 말았습니다.", "ms_my": "Helia, ibu kota Blessed Isles, berlokasi di pantai. Hasilnya, banyak bagian kota itu yang terendam air setelah peristiwa Ruination.", "pl_pl": "Helia, stolica Błogosławionych Wysp, znajdowała się na wybrzeżu. Dlatego też po Zrujnowaniu duża część miasta została zalana.", "pt_br": "Helia, a capital das Ilhas das Bênçãos, está localizada na costa. Como resultado, muitas partes da cidade foram alagadas depois da Ruína.", "ro_ro": "Helia, capitala Insulelor Binecuvântate, se afla pe coastă. Ca urmare, multe părți din oraș au fost inundate după Cataclism.", "ru_ru": "Гелия, столица Благословенных островов, располагалась на берегу, поэтому в результате Погибели многие районы города оказались под водой.", "th_th": "เฮเลีย เมืองหลวงแห่งเกาะศักดิ์สิทธิ์ เคยตั้งอยู่บริเวณชายหาดแต่ด้วยผลจากเหตุการณ์การล่มสลายทำให้หลายส่วนของเมืองจมอยู่ใต้น้ำ", "tr_tr": "Kutlu Adalar'ın başkenti olan Helia, deniz kıyısına kurulmuştu. Bu yüzden Afet'ten sonra şehrin çoğu yeri sular altında kaldı.", "vn_vn": "Helia, thủ phủ Quần Đảo Phước Lành, nằm bên bờ biển nên bị ngập nhiều chỗ sau khi Đại Suy Vong xảy ra.", "zh_cn": "海利亚，福光岛的都城，坐落于海岸线上。因此城市的很大一部分都在破败之咒过后被海水淹没了。", "zh_tw": "曾是天堂島首都的希利亞位於沿海。大部分的土地都在受到殞落王者的詛咒後被海水淹沒。"}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/shadow_isles_environment_06.jpg", "encoding": "image/jpeg", "width": null, "height": null, "x": null, "y": null, "featured-champions": []}, "url": "/en_us/story/karthus-color-story", "release-date": "2015-09-10T08:00:00.000Z", "featured-champions": [{"type": "champion", "release-date": "2009-06-12", "name": "Karthus", "slug": "karthus", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shadow-isles", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Karthus_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 901, "y": 0, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}]}], "word-count": 956, "minutes-to-read": 4}, {"section-title": "", "type": "image-gallery", "isFanArt": false, "fan-art-url": "", "featured-image": "", "title": "", "subtitle": "", "description": "", "assets": [{"type": "image", "title": {"cs_cz": "Grafický návrh Karthuse", "de_de": "Karthus – Konzeptzeichnung", "el_gr": "Concept art για τον Κάρθους", "en_au": "Karthus concept art", "en_gb": "Karthus concept art", "en_ph": "Karthus concept art", "en_pl": "Karthus concept art", "en_sg": "Karthus concept art", "en_us": "Karthus concept art", "es_ar": "Arte conceptual de Karthus", "es_es": "Arte conceptual de Karthus", "es_mx": "Arte conceptual de Karthus", "fr_fr": "Ébauche conceptuelle de Karthus", "hu_hu": "Karthus koncepciórajza", "id_id": "Konsep Art Karthus", "it_it": "Bozzetto di Karthus", "ja_jp": "カーサス コンセプトアート", "ko_kr": "카서스 컨셉 아트", "ms_my": "Konsep seni Karthus", "pl_pl": "Karthus — grafika koncepcyjna", "pt_br": "Arte conceitual de Karthus", "ro_ro": "Karthus – imagine conceptuală", "ru_ru": "Эскиз Картуса", "th_th": "ภาพคอนเซปต์ของ Karthus", "tr_tr": "Karthus konsept çalışması", "vn_vn": "Hình mẫu Karthus", "zh_cn": "卡尔萨斯概念艺术", "zh_tw": "卡爾瑟斯 概念藝術"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/image-gallery/karthus_kars.jpg", "encoding": "image/jpeg", "width": 1920, "height": 640, "x": 957, "y": 305, "featured-champions": []}, {"type": "image", "title": {"cs_cz": "Grafický návrh Karthusova obličeje", "de_de": "Karthus – Gesicht-Konzeptzeichnung", "el_gr": "Concept art για το πρόσωπο του Κάρθους", "en_au": "Karthus' face concept art", "en_gb": "Karthus' face concept art", "en_ph": "Karthus' face concept art", "en_pl": "Karthus' face concept art", "en_sg": "Karthus' face concept art", "en_us": "Karthus' face concept art", "es_ar": "Arte conceptual de la cara de Karthus", "es_es": "Arte conceptual de la cara de Karthus", "es_mx": "Arte conceptual de la cara de Karthus", "fr_fr": "Ébauche conceptuelle du visage de Karthus", "hu_hu": "Karthus arcának látványterve", "id_id": "Konsep Art Wajah Karthus", "it_it": "Bozzetto del volto di Karthus", "ja_jp": "カーサスの顔 コンセプトアート", "ko_kr": "카서스 얼굴 컨셉 아트", "ms_my": "Konsep seni wajah Karthus", "pl_pl": "Karthus — grafika koncepcyjna twarzy", "pt_br": "Arte conceitual do rosto de Karthus", "ro_ro": "Karthus – imagine conceptuală față", "ru_ru": "Эскиз лица Картуса", "th_th": "ภาพคอนเซปต์ของหน้าของ Karthus", "tr_tr": "Karthus'un yüzü - konsept çalışması", "vn_vn": "Hình mẫu mặt Karthus", "zh_cn": "卡尔萨斯的脸部概念艺术", "zh_tw": "卡爾瑟斯 臉部概念藝術"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/image-gallery/karthus_concept.jpg", "encoding": "image/jpeg", "width": 1324, "height": 1080, "x": 362, "y": 187, "featured-champions": []}, {"type": "image", "title": {"cs_cz": "Černobílý grafický návrh Karthuse", "de_de": "Karthus – Konzeptzeichnung (schwarz-weiß)", "el_gr": "Ασπρόμαυρο concept art για τον Κάρθους", "en_au": "Karthus concept black and white", "en_gb": "Karthus concept black and white", "en_ph": "Karthus concept black and white", "en_pl": "Karthus concept black and white", "en_sg": "Karthus concept black and white", "en_us": "Karthus concept black and white", "es_ar": "Concepto de Karthus en blanco y negro", "es_es": "Concepto de Karthus en blanco y negro", "es_mx": "Concepto de Karthus en blanco y negro", "fr_fr": "Concept de Karthus en noir et blanc", "hu_hu": "Karthus fekete-fehér látványterve", "id_id": "Konsep Hitam Putih Karthus", "it_it": "Bozzetto di Karthus in bianco e nero", "ja_jp": "カーサス コンセプトアート 白黒", "ko_kr": "카서스 흑백 컨셉 아트", "ms_my": "Konsep hitam putih Karthus", "pl_pl": "Karthus — czarno-biała grafika koncepcyjna", "pt_br": "Arte conceitual em preto e branco de Karthus", "ro_ro": "Karthus – concept alb-negru", "ru_ru": "Черно-белый эскиз Картуса", "th_th": "ภาพขาวดำคอนเซปต์ของ Karthus", "tr_tr": "Karthus konsepti - siyah beyaz", "vn_vn": "Hình mẫu đen trắng Karthus", "zh_cn": "卡尔萨斯概念图黑白版", "zh_tw": "卡爾瑟斯 黑白概念"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/image-gallery/karthus_ungorth_lich.jpg", "encoding": "image/jpeg", "width": 1398, "height": 1080, "x": 703, "y": 450, "featured-champions": []}], "featured-champions": [{"type": "champion", "release-date": "2009-06-12", "name": "Karthus", "slug": "karthus", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shadow-isles", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Karthus_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 901, "y": 0, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}]}]}]}