{"id": "kled", "name": "Kled Champion Page", "locale": "en_us", "champion": {"release-date": "2016-08-10", "slug": "kled", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Kled_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1102, "y": 4, "featured-champions": []}, "video": {"type": "video", "title": "", "subtitle": "", "description": {"en_us": ""}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/videos/kled-splashvideo.webm", "width": 1280, "height": 720, "x": 1102, "y": 4, "featured-champions": []}, "associated-faction-slug": "noxus", "roles": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}], "name": "Kled", "title": "the Cantankerous Cavalier", "game-info-url": "http://gameinfo.na.leagueoflegends.com/en/game-info/champions/kled", "biography": {"full": "<p>A warrior as fearless as he is ornery, Kled is a popular folk hero in Noxus. Embodying the furious bravado of his nation, he is an icon beloved by the empire&#x2019;s soldiers, distrusted by its officers, and loathed by the nobility. Tall tales such as “The Great Hussar,” “The High General Marshal Sergeant,” and “The Mountain Admiral” trace back to the founding of the empire. Many soldiers claim Kled has fought in every campaign the legions have waged, has “acquired” every military title, and has never once backed down from a fight. Though the veracity of the details is often questionable, one part of his legend is undeniable: Charging into battle on his <em>un</em>-trusty steed, Skaarl, Kled fights to protect what&#x2019;s his&#x2026; and to take whatever he can get.</p><p>The earliest known story of Kled traces back to the empire&#x2019;s infancy and the Battle of Drugne. In the dusty hills of those badlands, the First Legion was on the run from a barbarian horde. Having lost the two previous battles, the men&#x2019;s morale was low, the army had been forced to abandon its supply train in the rout, and they were a week&#x2019;s march from the nearest outpost.</p><p>In command of the Legion was a gaggle of wealthy nobles bedecked in spotless golden armor. They were more concerned with their appearances and the intrigues of their class than the men they were commanding. Worse, these commanders&#x2014;though well versed in assassination and tournament fighting&#x2014;had proven hopeless on the field. With the remains of the army surrounded by enemy forces, the nobles ordered the Legion into a defensive circle in hopes of negotiating ransoms for themselves.</p><p>Then, as the morning sun rose, the mysterious figure of Kled appeared on the hilltop overlooking the battlefield. He rode Skaarl, an immortal desert drakalops. The mount stood on only two legs; its ear-like forelimbs fanned from the side of its head, hanging down apologetically, like a butler who had accidently dipped his hands in soup.</p><p>The lone rider stood on his steed&#x2019;s saddle. His weapon was rusted, his armor was worn, and his clothes were tattered&#x2014; but a relentless anger burned from his one good eye.</p><p>“I&#x2019;ll give you one chance to get off my land!” Kled announced to the barbarian horde, but the yordle didn&#x2019;t wait for their answer. He spurred his steed and angrily screamed his charge.</p><p>Desperate, starving, and furious with the nobles, the Legion&#x2019;s anger ignited like blasting powder at the yordle&#x2019;s insane act of bravado. The enlisted men rushed after Kled and Skaarl as they tore into the center of the enemy formation. </p><p>What followed was the bloodiest melee the Legion had ever fought. The initial success of its surprise attack was crushed when the barbarians&#x2019; reserve forces smashed into the Legion&#x2019;s flanks. With the battle turning against the Noxians and the enemy attacking from every side, Skaarl panicked, threw Kled, and abandoned the fight. Like the cowardly lizard creature, the Noxian soldiers faltered. But at their center, Kled fought on, chopping down foes, kicking out teeth, and biting faces.</p><p>Enemy bodies piled around Kled, and his clothes were soaked with blood. Despite the casualties he inflicted with every swing of his long axe, he was still forced back by the barbarians&#x2019; relentless tide. He screamed louder challenges and cruder insults. Clearly, the yordle was willing to die before ever backing down.</p><p>Courage and cowardice are as infectious as the plague, however, and seeing Kled&#x2019;s determination, the legionnaires pressed on. Even Skaarl stopped running and turned to watch the Legion&#x2019;s last stand.</p><p>Then, as the Noxian line was breaking and the enemy&#x2019;s superior numbers pulled Kled to the ground, the drakalops triumphantly returned and crashed into the barbarians&#x2019; rear. Snarling and clawing, it dove into the churning melee until it freed its master. With his mount again beneath him, the reinvigorated Kled became a whirlwind of death, and it was the barbarians who broke and ran.</p><p>Though precious few of the Noxian soldiers survived, the battle was won. The tribes of Drugne were defeated, and their lands were added to the empire. The bodies of the nobles, and their fine golden armor, were never found.</p><p>In time, most of the empire&#x2019;s other legions acquired similar stories of Kled, proving no defeat is certain in the face of insane courage. It is said he rides wherever the legions travel, claiming the spoils of war and land for himself and Skaarl.</p><p>Most Noxians find the truth of these tall tales questionable at best. But in the legions&#x2019; wake, signs can always be found proclaiming each new territory “Property of Kled.”</p>", "short": "A warrior as fearless as he is ornery, the yordle Kled embodies the furious bravado of Noxus. He is an icon beloved by the empire’s soldiers, distrusted by its officers, and loathed by the nobility. Many claim Kled has fought in every campaign the legions have waged, has “acquired” every military title, and has never once backed down from a fight. Though the truth of the matter is often questionable, one part of his legend is undeniable: Charging into battle on his un-trusty steed, Skaarl, Kled fights to protect what’s his… and to take whatever he can get.", "quote": "“A sane man would run… but I ain’t the runnin’ kind!”", "quote-author": ""}, "bioImage": null, "headerImage": null}, "related-champions": [], "explore-champions": [], "modules": [{"slug": "kled-promo", "section-title": "", "type": "featured-video", "featured-image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/featuredvideocover/kled-promo.jpg", "encoding": "image/jpeg", "width": 1920, "height": 1080, "x": 885, "y": 130, "featured-champions": []}, "title": "Kled: The Reunion", "subtitle": "", "description": "“Another day on the northern plains. Prickly shrubs. Harsh winds. Killin’ trespassers.”", "video": {"type": "video", "title": "", "subtitle": "", "description": [], "uri": "https://www.youtube.com/watch?v=Xw46WPuXMk0", "width": "", "height": "", "x": "", "y": "", "featured-champions": [{"type": "champion", "release-date": "2016-08-10", "name": "Kled", "slug": "kled", "echelon": 0, "associated-faction": "", "associated-faction-slug": "noxus", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Kled_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1102, "y": 4, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}]}, "blackout": null, "release-date": "2016-07-21T08:00:00.000Z", "video-type": "cinematic"}, {"type": "story-preview", "title": "Where the Drakalops Roam", "subtitle": null, "description": "<p>The Northern Steppes ain&#x2019;t the place for fancy undies and golden piss pots. It&#x2019;s tough land. Ain&#x2019;t nothing go here but barbarian raiders, poison grass, and harsh winds. To survive, you gotta eat rocks and crap lava. And I&#x2019;m the toughest, meanest, killingest bastard in these parts. So I figure that makes these plains mine.</p>", "story-slug": "kled-color-story", "featured-image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Kled_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1102, "y": 4, "featured-champions": []}, "background": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/story-images/background-image/kled_background_image.png", "encoding": "image/jpeg", "width": 1898, "height": 1080, "x": 896, "y": 437, "featured-champions": []}, "url": "/en_us/story/kled-color-story", "release-date": "2016-08-10T08:00:00.000Z", "featured-champions": [{"type": "champion", "release-date": "2016-08-10", "name": "Kled", "slug": "kled", "echelon": 0, "associated-faction": "", "associated-faction-slug": "noxus", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Kled_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1102, "y": 4, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}], "word-count": 1806, "minutes-to-read": 7}]}