{"id": "malzahar", "name": "Malzahar Champion Page", "locale": "en_us", "champion": {"release-date": "2010-06-01", "slug": "malzahar", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Malzahar_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 851, "y": 0, "featured-champions": []}, "video": null, "associated-faction-slug": "void", "roles": [{"name": "Mage", "slug": "mage"}, {"name": "Assassin", "slug": "assassin"}], "name": "Malzahar", "title": "the Prophet of the Void", "game-info-url": "http://gameinfo.na.leagueoflegends.com/en/game-info/champions/malzahar", "biography": {"full": "<p>Beneath the glare of the Shuriman sun, there have always been those blessed with the power of foresight. The only son of aging trinket peddlers, Malzahar did not realize his gift until his parents had already succumbed to a wasting sickness, leaving the young, traumatized boy to fend for himself on the city streets of Amakra. He read fortunes in the gutter, for a coin or scraps of bread.<br> <br>As his auguries proved more and more accurate, his reputation grew. He used his second sight to predict who a curious cameleer might marry, or where throwing daggers would land in games of chance at the bazaar. Soon, he began to receive patrons dressed not in dirtied sandals, but jeweled slippers.<br> <br>However, for all this, Malzahar could never see his own destiny. His future was hidden.<br> <br>Increasingly disillusioned with his success, he noted the common disparities of wealth, and witnessed those unhappy with their lives acting out in spiteful violence against one another. It was apparent to him that people were bound up in a never-ending cycle of pain, often of their own making, and no hopeful prophecy seemed able to break it. Malzahar himself soon felt nothing but a sense of emptiness, finally relinquishing his mortal possessions and leaving Amakra for good.<br> <br>For years, he roamed the land, from the trackless wastes of the lesser <i>sai</i> to the ruins of old Shurima. By distancing himself from others, he was alone with his thoughts at last. He divined not just how callous people could be, but also how corrupt the world might yet become. Feverish visions began to plague his waking hours, along with otherworldly whispers of war and strife, and endless suffering.<br> <br>He wandered far, until the sands turned to salt. He could not know that he had arrived in Icathia, a lost city ravaged in the wars of a bygone age. There, gazing into the depths of a ragged abyss, Malzahar opened his unsteady mind, desperate for understanding.<br> <br>And the Void answered.<br> <br>That would have been the end of any other tale, and yet somehow Malzahar endured. What lay in the darkness below brushed against the soul of the broken seer, only for an instant, and yet its strange and unknowable energies saturated his mind completely.<br> <br>The lone figure that eventually strode out of Icathia was no longer just a man, but something greater. Malzahar had seen in the abyss an end to all the suffering he had witnessed in his mortal lifetime. He realized the future he had believed hidden from him all this time was in fact a vision of his true calling: to accelerate the world toward inevitable oblivion. He had to return to the people, and spread word of the holy nothingness that would gladly embrace them, the willing and non-believers alike. He would become the herald of the world’s salvation.<br> <br>Among the nomads of the deep desert, he found his first disciples. Before their astonished eyes, he used his new Void-given powers to rend the very earth itself, summoning chittering, nightmarish creatures to carry away any who dared to deny him. Within a matter of months, strange rumors began to travel with the merchant caravans; rumors of men and women gladly sacrificing themselves to unseen powers, and of powerful quakes opening up the bedrock of Shurima in new fault lines hundreds of miles long.<br> <br>In the years since, Malzahar’s legend has spread even to the northern ports. As followers of “the Prophet” grow in number, nearby settlers are said to experience malefic visions grasping at their hearts, and fear gives rise to superstition—even the hardy villagers of the far wastes now make offerings of livestock to appease the voidling creatures below.<br> <br>Little do they know, this only helps Malzahar in shepherding the coming of the end.</p>", "short": "A zealous seer dedicated to the unification of all life, Malzahar truly believes the newly emergent Void to be the path to Runeterra’s salvation. In the desert wastes of Shurima, he followed the voices that whispered in his mind, all the way to ancient Icathia. Amidst the ruins of that land, he gazed into the dark heart of the Void itself, and was gifted new power and purpose. Malzahar now sees himself as a shepherd, empowered to bring others into the fold… or to release the voidling creatures that dwell beneath.", "quote": "“We are timeless. We demand sacrifice.”", "quote-author": ""}, "bioImage": null, "headerImage": null}, "related-champions": [{"type": "champion", "release-date": "2009-08-07", "name": "Kassadin", "slug": "kassadin", "echelon": 0, "associated-faction": "", "associated-faction-slug": "void", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Kassadin_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 973, "y": 108, "featured-champions": []}, "role": [{"name": "Assassin", "slug": "assassin"}, {"name": "Mage", "slug": "mage"}]}, {"type": "champion", "release-date": "2018-03-02", "name": "Kai'Sa", "slug": "kaisa", "echelon": 1, "associated-faction": "", "associated-faction-slug": "void", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/kaisa-splash.jpg", "encoding": "image/jpeg", "width": 1920, "height": 1133, "x": 928, "y": 141, "featured-champions": []}, "role": [{"name": "Marksman", "slug": "marksman"}]}], "explore-champions": [], "modules": [{"section-title": "", "type": "image-gallery", "isFanArt": false, "fan-art-url": "", "featured-image": "", "title": "", "subtitle": "", "description": "", "assets": [{"type": "image", "title": {"cs_cz": "Grafický návrh Malzahara", "de_de": "Malzahar – Konzeptzeichnung", "el_gr": "Concept art για τον Μάλζαχαρ", "en_au": "Malzahar concept art", "en_gb": "Malzahar concept art", "en_ph": "Malzahar concept art", "en_pl": "Malzahar concept art", "en_sg": "Malzahar concept art", "en_us": "Malzahar concept art", "es_ar": "Arte conceptual de Malzahar", "es_es": "Arte conceptual de Malzahar", "es_mx": "Arte conceptual de Malzahar", "fr_fr": "Ébauche conceptuelle de Malzahar", "hu_hu": "Malzahar koncepciórajza", "id_id": "Konsep Art Malzahar", "it_it": "Bozzetto di Malzahar", "ja_jp": "マルザハール コンセプトアート", "ko_kr": "말자하 컨셉 아트", "ms_my": "Konsep seni Malzahar", "pl_pl": "Malzahar — grafika koncepcyjna", "pt_br": "Arte conceitual de Malzahar", "ro_ro": "Malzahar – imagine conceptuală", "ru_ru": "Эскиз Мальзахара", "th_th": "ภาพคอนเซปต์ของ Malzahar", "tr_tr": "Malzahar konsept çalışması", "vn_vn": "Hình mẫu Malphite", "zh_cn": "玛尔扎哈概念艺术", "zh_tw": "馬爾札哈 概念藝術"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/image-gallery/malzahar_concept.jpg", "encoding": "image/jpeg", "width": 675, "height": 1080, "x": 381, "y": 70, "featured-champions": []}], "featured-champions": [{"type": "champion", "release-date": "2010-06-01", "name": "Malzahar", "slug": "malzahar", "echelon": 0, "associated-faction": "", "associated-faction-slug": "void", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Malzahar_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 851, "y": 0, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Assassin", "slug": "assassin"}]}]}]}