{"id": "nasus", "name": "Nasus Champion Page", "locale": "en_us", "champion": {"release-date": "2009-10-01", "slug": "nasus", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Nasus_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 889, "y": 40, "featured-champions": []}, "video": null, "associated-faction-slug": "shurima", "roles": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}], "name": "Nasus", "title": "the Curator of the Sands", "game-info-url": "http://gameinfo.na.leagueoflegends.com/en/game-info/champions/nasus", "biography": {"full": "<p>Nasus is an imposing, jackal-headed Ascended being from ancient Shurima, a heroic figure regarded as a demigod by the people of the desert. Fiercely intelligent, he was a guardian of knowledge and peerless strategist whose wisdom guided the ancient empire of Shurima to greatness for many centuries. After the fall of the empire, he went into self-imposed exile, becoming little more than a legend. Now that the ancient city of Shurima has risen once more, he has returned, determined to ensure it never falls again.</p><p>Nasus’s brilliance was recognized from a young age, long before he was chosen to join the ranks of the Ascended. A voracious scholar, he read, memorized and critiqued the greatest works of history, philosophy and rhetoric within the Library of the Sun before he’d seen ten summers. His passion for reading and critical thinking were not passed down to his younger brother Renekton, who was quickly bored, and spent his time fighting with other local children. The brothers were close, and Nasus kept a protective eye over his younger brother, helping to ensure he didn’t get into too much trouble. However, it wasn’t long before Nasus was welcomed into the exclusive Collegium of the Sun, leaving home to take up his place in this prestigious academy.</p><p>While the pursuit of knowledge would always be his passion, Nasus’s grasp on military strategy and logistics ensured he became the youngest general in Shuriman history. While he was a competent soldier, his genius lay not in <i>fighting battles</i>, but in <i>planning</i> them.</p><p>His strategic foresight became legendary. In war, he was always a dozen moves ahead of the enemy, able to predict their movement and reactions, as well as pinpoint the exact moment to push the attack or pull back. A deeply empathetic man who took his responsibilities incredibly seriously, he always ensured his soldiers were well provisioned, paid on time, and treated fairly. Every loss of life pained him deeply, and he often refused to rest as he planned and replanned his troop movements and battle dispositions until they were perfect. He was loved and respected by all who served in his legions, and he guided the armies of Shurima to countless victories. His brother Renekton often served on the front lines of these wars, and the two of them quickly garnered an aura of invincibility.</p><p>Despite the acclaim Nasus won, he did not enjoy war. Though he understood its importance - for now at least - in ensuring the continued progress of the empire, he firmly believed his greatest contribution to Shurima was in the knowledge he gathered for future generations.</p><p>At Nasus’s urging, all the books, scrolls, teachings and histories of the cultures he defeated were preserved in great libraries and repositories throughout the empire, the greatest of which bore his name. His hunger for knowledge was not for selfish reasons, but to share wisdom with all of Shurima, to enhance understanding of the world and bring enlightenment to the empire.</p><p>After decades of dutiful service, Nasus was cruelly struck down by a terrible wasting sickness. Some say he encountered Amumu, a long-dead child-king said to bear a terrible curse; others believed he was laid low by the evil magicks of an Icathian cult-leader. Whatever the truth, the emperor’s own physician declared, with a heavy heart, that Nasus was incurable, and would be dead within a week.</p><p>The people of Shurima went into mourning, for Nasus was its brightest star and beloved by all. The emperor himself begged the priesthood for an augury. After a day and night of communing with the divine, the priests declared it the will of the sun-god that Nasus be blessed with the Ascension ritual.</p><p>Renekton, now a great war-leader, raced back to the capital to be with his brother. The terrible sickness had advanced dramatically, and Nasus was little more than a skeleton, his flesh wasted away and his bones as fragile as glass. So weak was he that as the golden light from the sun disc streamed onto the Ascension dais, Nasus was unable to climb the final stairs and step into the light.</p><p>Renekton’s love for his brother was stronger than any sense of self-preservation, and he nobly bore Nasus onto the dais. Ignoring his brother’s protests, he willingly accepted oblivion in order to save Nasus. However, Renekton was not destroyed, as was expected. When the light faded, two Ascended beings stood before Shurima. Both brothers had been deemed worthy, and the emperor himself dropped to his knees to give thanks to the divine.</p><p>Nasus was now a towering, jackal-headed being of great strength, his eyes glittering with fierce intelligence, while Renekton had been transformed into a heavily muscled behemoth bearing the likeness of a crocodile. They took their place alongside the other rare Ascended beings of Shurima, and became its protectors. </p><p>While Renekton had always been a great warrior, now he was virtually unstoppable. Nasus too had been gifted with powers far beyond the understanding of mortal men. The greatest boon of his Ascension - his newly extended longevity, which allowed him countless lifetimes to spend in study and contemplation - would, after the fall of Shurima, also prove to be his curse.</p><p>One side-effect of the ritual that disturbed Nasus was the increased savagery he saw within his brother. At the culmination of the siege of Nashramae, which finally brought that ancient city under Shuriman rule, Nasus witnessed the victorious Shuriman soldiers butchering everyone they came across and setting the city ablaze. Renekton led the massacre, and it was he who set fire to the great library of Nashramae, destroying countless irreplaceable volumes before Nasus was able to contain it. This was the closest the brothers ever came to bloodshed, standing in the center of the city, weapons drawn against each other. Under the stern, disappointed gaze of his brother, Renekton’s bloodlust waned, and he finally turned away in shame.</p><p>Over the following centuries, Nasus bent his every effort to learning all he could, scouring the desert for years in search of ancient artifacts and wisdom, eventually going on to discover the legendary Tomb of the Emperors hidden beneath the Shuriman capital.</p><p>Nasus and Renekton had both been lured away when the Ascension ritual of Emperor Azir went terribly wrong, the young emperor betrayed by his closest advisor, the magus Xerath. The brothers returned as fast as they could, but were too late. Azir was dead, along with most of the capital’s citizens. Filled with rage and grief, Nasus and Renekton battled the malevolent being of pure energy that Xerath had become. </p><p>Unable to kill Xerath, they sought to bind him in a magical sarcophagus, but even that was not enough to hold him. Renekton, perhaps attempting to atone for Nashramae years earlier, grabbed Xerath and bore him into the Tomb of the Emperors, bidding Nasus seal them in. Nasus refused, desperate to find another way, but there was no other option. With a heavy heart, he sealed Xerath and his brother within the fathomless darkness, locking them away for all eternity.</p><p>The Shuriman empire collapsed. Its great central city sank into ruin, and the holy sun disc fell from the sky, drained of power by Xerath’s magic. Without it, the divine waters flowing from the city ran dry, bringing death and famine to Shurima.</p><p>Bearing the heavy burden of guilt for having damned his brother to darkness, Nasus took to roaming the sands, accompanied only by the ghosts of the past and his grief. A melancholy figure, he stalked the now dead cities of Shurima, watching as they were slowly swallowed by the desert, lamenting the fallen empire and its lost people. He embraced isolation, a lean, solitary nomad who the occasional traveler claimed to glimpse before he disappeared into a sandstorm or an early morning haze. Few believed such stories, and Nasus became little more than a legend.</p><p>Centuries passed, and Nasus all but forgot his old life and former purpose, until the moment when the now buried Tomb of the Emperors was rediscovered, and its seal broken. In that moment, he knew Xerath was free. </p><p>Ancient vigor stirred in his breast, and as Shurima rose from the sands, Nasus traversed the desert, angling toward the newly reborn city. Though he knew he had to battle Xerath once more, hope stirred within him for the first time in millennia. Not only was this potentially the dawn of a new Shuriman empire, but he dared believe it might also herald a long-awaited reunion with his beloved brother.</p>", "short": "Nasus is an imposing, jackal-headed Ascended being from ancient Shurima, a heroic figure regarded as a demigod by the people of the desert. Fiercely intelligent, he was a guardian of knowledge and peerless strategist whose wisdom guided the ancient empire of Shurima to greatness for many centuries. After the fall of the empire, he went into self-imposed exile, becoming little more than a legend. Now that the ancient city of Shurima has risen once more, he has returned, determined to ensure it never falls again.", "quote": "“What was fallen will be great again.”", "quote-author": ""}, "bioImage": null, "headerImage": null}, "related-champions": [{"type": "champion", "release-date": "2009-02-21", "name": "Sivir", "slug": "sivir", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Sivir_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 774, "y": 145, "featured-champions": []}, "role": [{"name": "Marksman", "slug": "marksman"}]}, {"type": "champion", "release-date": "2011-10-05", "name": "Xerath", "slug": "xerath", "echelon": 1, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Xerath_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 701, "y": 23, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Assassin", "slug": "assassin"}]}, {"type": "champion", "release-date": "2011-01-18", "name": "Renekton", "slug": "renekton", "echelon": 2, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Renekton_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 801, "y": 6, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}, {"type": "champion", "release-date": "2010-12-14", "name": "Cassiopeia", "slug": "cassiopeia", "echelon": 3, "associated-faction": "", "associated-faction-slug": "noxus", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Cassiopeia_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 847, "y": 55, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}]}, {"type": "champion", "release-date": "2014-09-16", "name": "Azir", "slug": "azir", "echelon": 4, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Azir_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1026, "y": 96, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Marksman", "slug": "marksman"}]}, {"type": "champion", "release-date": "2016-05-18", "name": "Taliyah", "slug": "taliyah", "echelon": 5, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Taliyah_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1063, "y": 0, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Support", "slug": "support"}]}, {"type": "champion", "release-date": "2011-04-12", "name": "Brand", "slug": "brand", "echelon": 6, "associated-faction": "", "associated-faction-slug": "unaffiliated", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Brand_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1074, "y": 50, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}]}, {"type": "champion", "release-date": "2009-02-21", "name": "Ryze", "slug": "ryze", "echelon": 7, "associated-faction": "", "associated-faction-slug": "unaffiliated", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Ryze_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1025, "y": 252, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Fighter", "slug": "fighter"}]}], "explore-champions": [], "modules": [{"type": "story-preview", "title": "Ouroboros", "subtitle": "By Ryan Verniere", "description": "<p><i>Nasus walked at night, unwilling to face the sun. The boy followed in his wake.</i></p>", "story-slug": "nasus-color-story", "featured-image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Nasus_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 889, "y": 40, "featured-champions": []}, "background": {"type": "image", "title": {"cs_cz": "Rozvaliny Shurimy, jejíž ohromné paláce a citadely dnes leží v troskách", "de_de": "Die Ruinen von Shurima mit seinen einst pompösen Palästen und Zitadellen", "el_gr": "Τα ερείπια της Σουρίμα, με τα απομεινάρια των άλλοτε μεγαλοπρεπών παλατιών και κάστρων της ", "en_au": "The ruins of Shurima, its once grand palaces and citadels cast to ruin", "en_gb": "The ruins of Shurima, its once grand palaces and citadels cast to ruin", "en_ph": "The ruins of Shurima, its once grand palaces and citadels cast to ruin", "en_pl": "The ruins of Shurima, its once grand palaces and citadels cast to ruin", "en_sg": "The ruins of Shurima, its once grand palaces and citadels cast to ruin", "en_us": "The ruins of Shurima, its once grand palaces and citadels cast to ruin", "es_ar": "Las ruinas de Shurima, sus palacios y ciudadelas que un día fueron grandes y ahora están en ruinas", "es_es": "Las ruinas de Shurima, sus palacios y ciudadelas que un día fueron grandes y ahora están en ruinas", "es_mx": "Las ruinas de Shurima, sus palacios y ciudadelas que un día fueron grandes y ahora están en ruinas", "fr_fr": "Les ruines de Shurima, ses palais et ses citadelles autrefois splendides", "hu_hu": "Shurima romjai: az egykor csodás paloták és erődök romokban hevernek.", "id_id": "Reruntuhan Shurima, istana dan juga bangunan mewah harus terkubur di dalam tanah", "it_it": "Le rovine di Shurima, con grandiosi palazzi e cittadelle abbandonate", "ja_jp": "シュリーマの廃墟。かつて栄華を誇った宮殿や城砦の影が落ちる", "ko_kr": "한때 거대했던 궁전들과 요새들이 폐허로 변해버린 슈리마", "ms_my": "Kemusnahan Shurima, istana-istana dan bandar-bandar yang pernah agung pada suatu ketika dahulu ditimpa kemusnahan", "pl_pl": "Ruiny Shurimy, niegdyś wspaniałe pałace i cytadele teraz leżą w gruzach", "pt_br": "As ruínas de Shurima, seus grandes palácios e cidadelas desmoronam", "ro_ro": "Ruinele Shurimei, în care se văd marile palate și citadele dărâmate", "ru_ru": "Руины Шуримы – некогда величественные дворцы и цитадели теперь разрушены.", "th_th": "ซากปรักหักพังของ Shurima ทั้งวังและป้อมปราการที่เคยมีความโอ่อ่าในอดีต ตอนนี้เหลือไว้เพียงซาก", "tr_tr": "SHURIMA harabeleri; bir zamanların görkemli saray ve kalelerinden geriye kalanlar", "vn_vn": "Tàn tích Shurima", "zh_cn": "恕瑞玛的废墟，它曾经宏伟的宫殿和城堡都化为废墟", "zh_tw": "蘇瑞瑪的遺跡曾經是一個輝煌的王殿與首都，但卻被咒語摧毀"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/factions/image-gallery/shurima-ruins.jpg", "encoding": "image/jpeg", "width": 1920, "height": 995, "x": 326, "y": 528, "featured-champions": []}, "url": "/en_us/story/nasus-color-story", "release-date": "2016-05-07T08:00:00.000Z", "featured-champions": [{"type": "champion", "release-date": "2009-10-01", "name": "Nasus", "slug": "nasus", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Nasus_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 889, "y": 40, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}], "word-count": 947, "minutes-to-read": 4}, {"type": "story-preview", "title": "Twilight of the Gods", "subtitle": "by Graham McNeill", "description": "<p>They came to a dead city in the mountain’s shadow under cover of night. Battle-hosts of a thousand warriors, each bearing bloody totems that told of the ancient lineages of the Sunborn Ascended who led them.</p>", "story-slug": "twilight-of-the-gods", "featured-image": null, "background": {"type": "image", "title": {"cs_cz": "ZABÍJENÍ LEGEND", "de_de": "UM LEGENDEN ZU ERLEGEN", "el_gr": "ΣΚΟΤΩΝΟΝΤΑΣ ΘΡΥΛΟΥΣ", "en_au": "TO SLAY LEGENDS", "en_gb": "TO SLAY LEGENDS", "en_ph": "TO SLAY LEGENDS", "en_pl": "TO SLAY LEGENDS", "en_sg": "TO SLAY LEGENDS", "en_us": "TO SLAY LEGENDS", "es_ar": "MATAR LEYENDAS", "es_es": "EXTERMINAR LEYENDAS", "es_mx": "MATAR LEYENDAS", "fr_fr": "ABATTRE LES LÉGENDES", "hu_hu": "LEGENDÁK GYILKOSA", "id_id": "TO SLAY LEGENDS", "it_it": "UCCIDERE LEGGENDE", "ja_jp": "伝説を葬るために", "ko_kr": "전설의 종말", "pl_pl": "ZABIJAĆ LEGENDY", "pt_br": "DESTRUINDO LENDAS", "ro_ro": "RĂPUNEREA LEGENDELOR", "ru_ru": "СРАЗИТЬ ЛЕГЕНДУ", "th_th": "เพื่อสังหารตำนาน", "tr_tr": "EFSANELERİ ÖLDÜRMEK", "vn_vn": "TIÊU DIỆT HUYỀN THOẠI", "zh_cn": "传说不再", "zh_tw": "為了抹滅傳說"}, "subtitle": "", "description": {"cs_cz": "Nakonec se nechali porazit smrtelníky, které chtěli sami zotročit. Za pomoci magie a vychytralosti byli ti nejmocnější darkinové překováni v živoucí zbraně a použity proti těm, kteří ještě zbývali. Avšak každý, kdo se takové zbraně chopí, se stane sotva něčím víc než pouhým hostitelem, schránkou pro nesmrtelné vědomí, jež v ní třímá.", "de_de": "Letztendlich wurden die Düsteren von den Sterblichen besiegt, die sie zu versklaven versucht hatten. Mit Magie und List wurden die mächtigsten unter ihnen zu lebendigen Waffen geschmiedet und gegen die verbliebenen Düsteren eingesetzt. Jeder Sterbliche, der jedoch eine solche Waffe ergriff, war danach nicht mehr als ein Wirt für das unsterbliche Wesen in ihrem Inneren.", "el_gr": "Τελικά, ηττήθηκαν από τους θνητούς που θέλησαν να σκλαβώσουν. Με μαγεία και πονηριά, οι πιο σημαντικοί Ντάρκιν έγιναν ζωντανά όπλα και χρησιμοποιήθηκαν ενάντια σε όσους απέμειναν. Όμως, όποιος πιάνει ένα τέτοιο όπλο θα απομείνει ένα απλός ξενιστής, ένα δοχείο για την αθάνατη νοημοσύνη που θα κρύβεται μέσα του.", "en_au": "Ultimately, they were defeated by the mortals they sought to enslave. With magic and cunning, the greatest of the darkin were forged into living weapons, and used against those that remained—but anyone who takes up such a weapon will become little more than a host, a vessel for the immortal sentience within it.", "en_gb": "Ultimately, they were defeated by the mortals they sought to enslave. With magic and cunning, the greatest of the darkin were forged into living weapons, and used against those that remained—but anyone who takes up such a weapon will become little more than a host, a vessel for the immortal sentience within it.", "en_ph": "Ultimately, they were defeated by the mortals they sought to enslave. With magic and cunning, the greatest of the darkin were forged into living weapons, and used against those that remained—but anyone who takes up such a weapon will become little more than a host, a vessel for the immortal sentience within it.", "en_pl": "Ultimately, they were defeated by the mortals they sought to enslave. With magic and cunning, the greatest of the darkin were forged into living weapons, and used against those that remained—but anyone who takes up such a weapon will become little more than a host, a vessel for the immortal sentience within it.", "en_sg": "Ultimately, they were defeated by the mortals they sought to enslave. With magic and cunning, the greatest of the darkin were forged into living weapons, and used against those that remained—but anyone who takes up such a weapon will become little more than a host, a vessel for the immortal sentience within it.", "en_us": "Ultimately, they were defeated by the mortals they sought to enslave. With magic and cunning, the greatest of the darkin were forged into living weapons, and used against those that remained—but anyone who takes up such a weapon will become little more than a host, a vessel for the immortal sentience within it.", "es_ar": "Finalmente, fueron derrotados por los mortales que pretendían esclavizar. Con magia y astucia, los más grandes darkin fueron reforjados en armas vivientes y usados contra los darkin restantes, pero cualquiera que empuñe una de esas armas se convertirá en un mero huésped, un vehículo de la conciencia inmortal allí contenida.", "es_es": "Al final, fueron derrotados por los mortales a los que pretendían esclavizar. Mediante la magia y la astucia, los oscuros más poderosos fueron transformados en armas vivientes utilizadas contra los que quedaban, pero cualquiera que empuñaba una de estas armas se convertía en un mero huésped, en un instrumento para el inmortal encerrado en ella.", "es_mx": "Finalmente, fueron derrotados por los mortales que pretendían esclavizar. Con magia y astucia, los más grandes darkin fueron reforjados en armas vivientes y usados contra los darkin restantes, pero cualquiera que empuñe una de esas armas se convertirá en un mero huésped, un vehículo de la conciencia inmortal allí contenida.", "fr_fr": "Finalement, ils furent battus par les mortels qu'ils cherchaient à réduire en esclavage. Grâce à un mélange de magie et de ruse, les plus puissants des Darkin furent enchâssés dans des armes et utilisés contre ceux qui restaient. Mais quiconque s'emparait de l'une de ces armes était réduit au rang de réceptacle pour la conscience éternelle emprisonnée à l'intérieur.", "hu_hu": "Végül azok a halandók győzték le őket, akiket rabszolgasorba akartak taszítani. Varázslattal és ravaszsággal élő fegyverekké változtatták a leghatalmasabb darkinokat, és a többi darkin ellen fordították őket, ám ennek ára volt. Bárki, aki egy ilyen fegyvert vesz a kezébe, egyszerű gazdatestté, a fegyverben lakozó halhatatlan tudat porhüvelyévé válik.", "id_id": "Pada akhirnya, mereka dikalahkan manusia yang ingin mereka perbudak. Dengan sihir dan kecerdasan, darkin-darkin terhebat ditempa menjadi senjata hidup, dan digunakan untuk melawan mereka yang masih hidup—tapi siapa saja yang menggunakan senjata itu akan berubah menjadi inang saja, sebuah wadah untuk makhluk abadi yang berada di dalamnya.", "it_it": "Infine, vennero sconfitti dai mortali che volevano ridurre in schiavitù. Grazie alla magia e all'inganno, i più potenti fra i darkin vennero imprigionati in armi viventi, e utilizzati contro quelli che erano rimasti... ma chiunque brandisce queste armi si trasforma in un ospite, in un corpo atto a contenere l'anima immortale dell'arma.", "ja_jp": "彼らは最終的に、支配しようとしていた定命の民に敗れた。魔法と狡猾さによって、最強のダーキンも生ける武器の中に押し込められ、残りのダーキンの討伐に利用されたのである。だがこのような武器を手に取る者は単なる宿主にとどまらない。その人物は、武器に棲まう不死の知的生命の器となるのだ。", "ko_kr": "다르킨들은 결국 노예로 삼으려고 했던 필멸자들에게 패배했다. 가장 위대한 다르킨조차 마법과 계략에 빠져 살아 있는 무기가 되었고, 그 무기는 남은 다르킨 종족을 향해 휘둘러졌다. 그러나 이 무기를 쥐는 자는 누구든 숙주에 지나지 않는, 즉 불멸의 자아를 담은 그릇이 되고 말 것이다.", "pl_pl": "Koniec końców Darkini zostali pokonani przez śmiertelników, których chcieli zniewolić. Za pomocą magii i sprytu najwspanialsi z nich zostali przekuci w żywe bronie i wykorzystani przeciwko pozostałym Darkinom — ale każdy, kto chwyci za taką broń, stanie się niewiele więcej niż żywicielem, nośnikiem nieśmiertelnej świadomości zaklętej w orężu.", "pt_br": "No fim, eles foram derrotados pelos mesmos mortais que tentavam escravizar. Com magia e astúcia, os grandes darkin foram aprisionados em armas vivas e usados para combater os que ainda restavam. Mas a pessoa que empunha uma dessas armas se tornará meramente um hospedeiro, um receptáculo para a imortal consciência que vive dentro dela.", "ro_ro": "În cele din urmă, muritorii pe care voiau să-i înrobească i-au învins. Prin magie și viclenie, cei mai aprigi dintre darkini au fost înlănțuiți de armele lor și folosiți împotriva celor care mai rămăseseră, însă oricine mânuiește o astfel de armă va deveni doar o gazdă pentru esența nemuritoare care-o va copleși.﻿", "ru_ru": "И все же они были побеждены теми самыми смертными, которых стремились поработить. С помощью обмана и магии те превратили самых могучих даркинов в живое оружие и использовали против их же собратьев. Но любой, кто возьмет в руки такое оружие, утратит собственную волю и станет сосудом для бессмертной сущности.", "th_th": "ในท้ายที่สุด พวกเขาก็ถูกโค่นล้ม โดยเหล่ามนุษย์ที่พวกเขากดขี่ข่มเหง ด้วยเวทมนตร์และเล่ห์เหลี่ยม เหล่า Darkin ที่ยิ่งใหญ่ที่สุดถูกใช้หล่อหลอมขึ้นเป็นชีวอาวุธ และใช้ต่อกรกับเหล่า Darkin ที่ยังคงหลงเหลืออยู่—เพียงแต่ผู้ใดก็ตามที่หยิบอาวุธเหล่านี้ขึ้นต่อสู้จะถูกสิ่งสู่ และกลายเป็นเพียงภาชนะของสิ่งมีชีวิตอมตะที่อาศัยอยู่ภายในนั้น", "tr_tr": "Sonunda, köle etmeye çalıştıkları ölümlülere yenildiler. Ölümlüler büyüleri ve zekâları sayesinde en güçlü darkinleri canlı silahlar haline getirip bu silahları geride kalanlara karşı kullandılar. Ama böyle bir silahı eline alan kişi, işlevi silahın içindeki ölümsüz bilinci taşımak olan bir bedene, bir kaba dönüşüyor.", "vn_vn": "Cuối cùng, họ đã bị đánh bại bởi chính những người phàm mà họ muốn nô lệ hóa. Bằng ma thuật và trí khôn, darkin mạnh nhất đã bị phong ấn vào những món vũ khí sống, và được dùng để chống lại những kẻ còn lại - nhưng bất kì ai sử dụng một món vũ khí như thế sẽ dần trở thành một vật chủ cho thực thể bất tử bên trong nó.", "zh_cn": "最终，他们本打算奴役的凡人将他们击败了。在魔法和诡计的作用下，暗裔们被铸进了活体武器中，并被用来对付剩下的同胞。但是，任何染指这些武器的人都不仅仅会成为宿主，被暗裔不朽的精魂占据。", "zh_tw": "最終，他們被自己想要奴役的凡人所擊敗。藉由魔法與狡詐，冥血族最偉大的戰士被打造為活生生的武器，並且用來對抗其餘殘黨 － 但任何舉起這種武器的人，與其說是揮舞著武器，倒更像是變成蘊藏當中的不朽意識的容器。"}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/darkin-to-slay-legends.jpg", "encoding": "image/jpeg", "width": 1469, "height": 826, "x": null, "y": null, "featured-champions": []}, "word-count": 6838, "minutes-to-read": 25, "featured-champions": [{"type": "champion", "release-date": "2009-10-01", "name": "Nasus", "slug": "nasus", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Nasus_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 889, "y": 40, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}, {"type": "champion", "release-date": "2014-09-16", "name": "Azir", "slug": "azir", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Azir_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1026, "y": 96, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Marksman", "slug": "marksman"}]}], "release-date": "2018-06-25T08:00:00.000Z", "url": "/en_us/story/twilight-of-the-gods"}, {"type": "story-preview", "title": "Bloodline", "subtitle": "by Graham McNeill", "description": "<p>Taliyah had almost forgotten how much she’d missed the furnace heat of Shurima – the sweat and crush of hundreds of people pushing, cursing, haggling and speaking with such passion and speed that outsiders often thought they were fighting.</p>", "story-slug": "rg-shurima-story", "featured-image": null, "background": {"type": "image", "title": {"cs_cz": "Znovu vztyčený sluneční kotouč nad ulicemi Nashramae", "de_de": "Die nachgebaute Sonnenscheibe über den Straßen von Nashramae", "el_gr": "Ο ηλιακός δίσκος δεσπόζει ξανά στους δρόμους της Νασραμαέ", "en_au": "The rebuilt sun disc over the streets of Nashramae", "en_gb": "The rebuilt sun disc over the streets of Nashramae", "en_ph": "The rebuilt sun disc over the streets of Nashramae", "en_pl": "The rebuilt sun disc over the streets of Nashramae", "en_sg": "The rebuilt sun disc over the streets of Nashramae", "en_us": "The rebuilt sun disc over the streets of Nashramae", "es_ar": "El disco solar reconstruido sobre las calles de Nashramae", "es_es": "El disco solar reconstruido sobre las calles de Nashramae", "es_mx": "El disco solar reconstruido sobre las calles de Nashramae", "fr_fr": "Le Disque solaire reconstruit surplombe les rues de Nashramae", "hu_hu": "Az újjáépített napkorong Nashramé utcái fölé magasodik.", "id_id": "Sun Disc yang dibuat lagi di jalanan Nashramae", "it_it": "Il disco solare ricostruito sopra le strade di Vekaura", "ja_jp": "ベカウラの上空にある再建された太陽の円盤", "ko_kr": "나시라미 거리에 다시 세워진 태양 원판", "ms_my": "Cakera matahari yang dibina semula di atas jalan raya Nashramae", "pl_pl": "Odbudowany słoneczny dysk ponad ulicami Nashramae", "pt_br": "O disco solar reconstruído mas ruas de Nashramae", "ro_ro": "Discul soarelui, reconstruit deasupra străzilor din Nashramae", "ru_ru": "Восстановленный солнечный диск нависает над улицами Нашраме.", "th_th": "Sun Disc ที่ถูกสร้างขึ้นมาใหม่อยู่เหนือถนน Nashramae", "tr_tr": "Nashramae sokakları üzerinde yeniden yükselen Güneş Kursu", "vn_vn": "Đĩa Mặt Trời được dựng lại  ở Nashramae", "zh_cn": "重建后的太阳圆盘悬在纳施拉美的街道之上", "zh_tw": "位於娜敘亞麥上方重建的烈日之輪"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/factions/image-gallery/shurima-vekaurastreets.jpg", "encoding": "image/jpeg", "width": 1920, "height": 887, "x": 1049, "y": 763, "featured-champions": []}, "word-count": 9630, "minutes-to-read": 36, "featured-champions": [{"type": "champion", "release-date": "2016-05-18", "name": "Taliyah", "slug": "taliyah", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Taliyah_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1063, "y": 0, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Support", "slug": "support"}]}, {"type": "champion", "release-date": "2009-10-01", "name": "Nasus", "slug": "nasus", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Nasus_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 889, "y": 40, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}, {"type": "champion", "release-date": "2011-10-05", "name": "Xerath", "slug": "xerath", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Xerath_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 701, "y": 23, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Assassin", "slug": "assassin"}]}, {"type": "champion", "release-date": "2011-01-18", "name": "Renekton", "slug": "renekton", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Renekton_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 801, "y": 6, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}], "release-date": "2016-05-12T08:00:00.000Z", "url": "/en_us/story/rg-shurima-story"}, {"section-title": "", "type": "image-gallery", "isFanArt": false, "fan-art-url": "", "featured-image": "", "title": "", "subtitle": "", "description": "", "assets": [{"type": "image", "title": {"cs_cz": "Finální grafický návrh Nasuse", "de_de": "Nasus – Finales Konzept", "el_gr": "Τελικό concept art για τον Νάσους", "en_au": "Nasus final concept", "en_gb": "Nasus final concept", "en_ph": "Nasus final concept", "en_pl": "Nasus final concept", "en_sg": "Nasus final concept", "en_us": "Nasus final concept", "es_ar": "Concepto final de Nasus", "es_es": "Concepto final de Nasus", "es_mx": "Concepto final de Nasus", "fr_fr": "Concept final de Nasus", "hu_hu": "Nasus végleges látványterve", "id_id": "Konsep Final Nasus", "it_it": "Bozzetto finale di Nasus", "ja_jp": "ナサス コンセプトアート (ファイナル)", "ko_kr": "나서스 최종 컨셉 아트", "ms_my": "Konsep akhir Nasus", "pl_pl": "Nasus — ostateczna grafika koncepcyjna", "pt_br": "Conceito final de Nasus", "ro_ro": "Nasus – concept final", "ru_ru": "Финальный эскиз Насуса", "th_th": "คอนเซปต์ของ Nasus ที่เสร็จแล้ว", "tr_tr": "Tamamlanmış Nasus konsepti", "vn_vn": "Hình mẫu hoàn thiện Nasus", "zh_cn": "内瑟斯终版概念图", "zh_tw": "納瑟斯 最終概念"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/image-gallery/nasus_concept.jpg", "encoding": "image/jpeg", "width": 1398, "height": 940, "x": 31, "y": 69, "featured-champions": []}, {"type": "image", "title": {"cs_cz": "Raný grafický návrh Nasuse", "de_de": "Nasus – Frühes Konzept", "el_gr": "Πρώιμο concept art για τον Νάσους", "en_au": "Nasus early concept", "en_gb": "Nasus early concept", "en_ph": "Nasus early concept", "en_pl": "Nasus early concept", "en_sg": "Nasus early concept", "en_us": "Nasus early concept", "es_ar": "Concepto inicial de Nasus", "es_es": "Concepto inicial de Nasus", "es_mx": "Concepto inicial de Nasus", "fr_fr": "Concept préliminaire de Nasus", "hu_hu": "Nasus korai látványterve", "id_id": "Konsep Awal Nasus", "it_it": "Bozzetto iniziale di Nasus", "ja_jp": "ナサス 初期コンセプトアート", "ko_kr": "나서스 초기 컨셉 아트", "ms_my": "Konsep awal Nasus", "pl_pl": "Nami — wczesna grafika koncepcyjna", "pt_br": "Conceito inicial de Nasus", "ro_ro": "Nasus – concept inițial", "ru_ru": "Ранний эскиз Насуса", "th_th": "คอนเซปต์เริ่มแรกของ Nasus", "tr_tr": "Eski Nasus konsepti", "vn_vn": "Hình mẫu ban đầu Nasus", "zh_cn": "内瑟斯早期概念图", "zh_tw": "納瑟斯 早期概念"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/image-gallery/nasus_ammon.jpg", "encoding": "image/jpeg", "width": 815, "height": 997, "x": 25, "y": 109, "featured-champions": []}], "featured-champions": [{"type": "champion", "release-date": "2009-10-01", "name": "Nasus", "slug": "nasus", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Nasus_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 889, "y": 40, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}]}]}