{"id": "pyke", "name": "Pyke Champion Page", "locale": "en_us", "champion": {"release-date": "2018-05-31", "slug": "pyke", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/champion-pyke-splash.jpg", "encoding": "image/jpeg", "width": 1920, "height": 1080, "x": 949, "y": 240, "featured-champions": []}, "video": {"type": "video", "title": "", "subtitle": "", "description": {"en_us": ""}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/videos/pyke-splashvideo.webm", "width": 1920, "height": 1071, "x": 964, "y": 124, "featured-champions": []}, "associated-faction-slug": "bilgewater", "roles": [{"name": "Support", "slug": "support"}], "name": "Pyke", "title": "the Bloodharbor Ripper", "game-info-url": "", "biography": {"full": "<p>As a youth, Pyke started out like many in Bilgewater: on the slaughter docks. All day, every day, monstrous creatures of the deep were hauled in for rendering in the butcheries that lined the waterfront. He found employment in a district known as Bloodharbor, as even the tide itself was not strong enough to wash away the red slick that ran constantly down its wooden slips.</p><p>He became well acquainted with the trade—both the gruesome work and meager paychecks. Over and over, Pyke watched heavy purses of gold being handed to captains and crews in exchange for the daunting carcasses that he and his fellows would hack into salable chunks. He became hungry for more than a few copper sprats in his pocket, and managed to talk his way onto a ship’s crew. Few individuals dared to hunt in the traditional Serpent Isles manner: launching themselves at their targets to secure tow-hooks with their bare hands, and beginning to butcher the creatures while they yet lived. Fearless and highly skilled in this regard, Pyke soon cut a name for himself as the best harpooner a golden kraken could buy. He knew meat was worth pennies compared to certain organs from the larger, more dangerous beasts… organs that needed to be harvested fresh.<br /> <br />Depending on the difficulty of the hunt, each sea monster commanded its own price, and the most desired by Bilgewater traders was the jaull-fish. From its razor-toothed maw, priceless sacs of sapphilite were coveted across Runeterra for various sorcerous distillations, and a small flask of the glowing blue oil could pay for a ship and its crew ten times over. But it was while hunting with an untested captain that Pyke learned where a life of blood and guts would land him.</p><p>Days into their journey, a huge jaull-fish breached, opening its maw wide to reveal rows of sapphilite sacs. Several harpoon lines secured the beast, and though it was far bigger and older than any he had encountered before, Pyke leapt into its mouth without hesitation.</p><p>As he set about his work, a deep vibration began to stir in the creature’s cavernous gullet. Roiling bubbles broke the ocean’s surface, and an entire pod of jaulls began to push against the tethered ship’s hull. The captain lost his nerve, and cut Pyke’s lifeline. The last thing the doomed harpooner saw before the beast’s jaws snapped shut was the look of horror on his crewmates’ faces, as they watched him being swallowed alive.<br /> <br />But this was not the end for Pyke.</p><p>In the deepest fathoms of the unknowable ocean, crushed by the titanic pressure, and still firmly trapped within the jaull’s mouth, he opened his eyes once more. There were blue lights everywhere, thousands of them, seemingly watching him. Tremulous echoes of something ancient and mysterious filled his brain, crushing his mind, showing him visions of all he had lost whilst others grew fat.</p><p>A new hunger overtook Pyke, one for vengeance and retribution. He would fill the depths with the corpses of those who had wronged him.<br /> <br />Back in Bilgewater, no one thought much of the killings at first—for so dangerous a place, the occasional red tide was nothing new. But weeks became months, and a pattern began to emerge. Captains from many ships were found carved up and left out for the dawn. Bar-room patrons whispered it was a supernatural killer, wronged at sea, gutting his way through the crew manifest of some damned ship called the <i>Terror</i>. Once a mark of respect and celebrity, the question “You a captain?” became a cause for alarm.</p><p>Soon it was the caulkers, too, and the first mates, merchant officers, bankers… indeed, anyone associated with the bloody business of the slaughter docks. A new name went up on the bounty boards: a thousand krakens for the infamous Bloodharbor Ripper.<br /> <br />Driven by memories twisted by the deep, Pyke has succeeded where many have failed—striking fear into the hearts of unscrupulous businessmen, killers, and seafaring scoundrels alike, even though no one can find any mention of a ship named the <i>Terror</i> ever docking in Bilgewater.</p><p>A city that prides itself on hunting monsters now finds a monster hunting them, and Pyke has no intention of stopping.</p>", "short": "A renowned harpooner from the slaughter docks of Bilgewater, Pyke should have met his death in the belly of a gigantic jaull-fish… and yet, he returned. Now, stalking the dank alleys and backways of his former hometown, he uses his new supernatural gifts to bring a swift and gruesome end to those who make their fortune by exploiting others—and a city that prides itself on hunting monsters now finds a monster hunting them.", "quote": "“There’s plenty of room for everyone at the bottom of the sea...”", "quote-author": ""}, "bioImage": null, "headerImage": null}, "related-champions": [{"type": "champion", "release-date": "2009-08-19", "name": "Gangplank", "slug": "gangplank", "echelon": 0, "associated-faction": "", "associated-faction-slug": "bilgewater", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Gangplank_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 838, "y": 6, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}]}, {"type": "champion", "release-date": "2010-09-08 ", "name": "Miss Fortune", "slug": "missfortune", "echelon": 1, "associated-faction": "", "associated-faction-slug": "bilgewater", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/MissFortune_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 983, "y": 231, "featured-champions": []}, "role": [{"name": "Marksman", "slug": "marksman"}]}], "explore-champions": [], "modules": [{"slug": "audio-drama-pyke", "section-title": "", "type": "featured-video", "featured-image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/audio-drama-bg.jpg", "encoding": "image/jpeg", "width": 1920, "height": 1080, "x": "", "y": "", "featured-champions": []}, "title": "Legends of Bilgewater: Pyke, the Drowned Man", "subtitle": "", "description": "Listen as Lars spins a tale of four Bilgewater legends - Nautilus, Fizz, Tahm Kench, and Pyke - and discovers the terrifying fact woven into his fiction.", "video": {"type": "video", "title": "", "subtitle": "", "description": [], "uri": "https://youtu.be/eFRwP9lsLEo", "width": "", "height": "", "x": "", "y": "", "featured-champions": []}, "blackout": null, "release-date": "2018-05-31T08:00:00.000Z"}, {"type": "story-preview", "title": "THEN, TEETH", "subtitle": "by Matt Dunn", "description": "<p>Mazier is sprawled on the rotten planks, waves lapping at stone underneath. Her slowing heartbeat pumps blood into the seawater. She stares, unblinking, at the shanty-dwellings above, and the stars beyond.</p>", "story-slug": "pyke-color-story", "featured-image": null, "background": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/pyke-color-bg.jpg", "encoding": "image/jpeg", "width": 1921, "height": 1080, "x": 949, "y": 240, "featured-champions": []}, "url": "/en_us/story/pyke-color-story", "release-date": "2018-05-31T08:00:00.000Z", "featured-champions": [{"type": "champion", "release-date": "2018-05-31", "name": "Pyke", "slug": "pyke", "echelon": 0, "associated-faction": "", "associated-faction-slug": "bilgewater", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/champion-pyke-splash.jpg", "encoding": "image/jpeg", "width": 1920, "height": 1080, "x": 949, "y": 240, "featured-champions": []}, "role": [{"name": "Support", "slug": "support"}]}], "word-count": 926, "minutes-to-read": 4}, {"slug": "pyke-teaser-cg", "section-title": "", "type": "featured-video", "featured-image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/pyke-teaser-image.jpg", "encoding": "image/jpeg", "width": 1921, "height": 1080, "x": 949, "y": 240, "featured-champions": []}, "title": "Pyke: The Bloodharbor Ripper", "subtitle": "", "description": "Pyke’s shipmates watched him drown. In his eyes, all of Bilgewater is guilty.", "video": {"type": "video", "title": "", "subtitle": "", "description": [], "uri": "https://www.youtube.com/watch?v=UjX7FAwc7lw", "width": "", "height": "", "x": "", "y": "", "featured-champions": []}, "blackout": null, "release-date": "2018-05-10T08:00:00.000Z", "video-type": "animation"}]}