{"id": "rammus", "name": "Rammus Champion Page", "locale": "en_us", "champion": {"release-date": "2009-07-10", "slug": "rammus", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Rammus_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 779, "y": 209, "featured-champions": []}, "video": null, "associated-faction-slug": "shurima", "roles": [{"name": "Tank", "slug": "tank"}, {"name": "Fighter", "slug": "fighter"}], "name": "Rammus", "title": "the Armordillo", "game-info-url": "http://gameinfo.na.leagueoflegends.com/en/game-info/champions/rammus", "biography": {"full": "<p>Idolized by many, dismissed by some, mystifying to all, the curious being, Rammus, is an enigma. Protected by a spiked shell, Rammus inspires increasingly disparate theories on his origin wherever he goes - from demigod, to sacred oracle, to a mere beast transformed by magic. Whatever the truth may be, Rammus keeps his own counsel and stops for no one as he roams the desert.</p><p>Some believe Rammus is an Ascended being, an ancient god amongst men who rolls to Shurima’s aid as an armored guardian in its times of need. Superstitious folk swear he is a harbinger of change, appearing when the land is on the verge of a great shift in power. Others speculate he is the last of a dying species that roamed the land before the Rune Wars sundered the desert with uncontrolled magic.</p><p>With so many rumors of great power, magic, and mystery surrounding him, Rammus compels many Shurimans to seek his wisdom. Soothsayers, priests, and deranged lunatics alike claim to know where Rammus dwells, but the Armordillo has proved elusive. Despite this, proof of his presence predates living memory, with crumbling mosaics depicting his image on the most ancient walls of Shuriman ruins. His likeness adorns colossal stone monuments made in the early days of Ascension, leading some to believe he is no less than an immortal demigod. Skeptics often point to a simpler explanation: that Rammus is just one of many such creatures.</p><p>It is said that he appears only to worthy pilgrims in great need of his aid, and those blessed by his presence experience great turning points. After the Armordillo rescued the heir to a vast kingdom from a terrible fire, the man renounced his position to become a goat farmer. An elderly mason was inspired by a profound, yet brief conversation with Rammus, and constructed an enormous marketplace which became the bustling heart of Nashramae.</p><p>Knowing Rammus’s guidance can pave an enlightened path, devout believers perform elaborate rituals designed to attract the favor of their deity. Disciples of the cult devoted to Rammus demonstrate their unwavering faith in a yearly ceremony by imitating his famous roll and somersaulting through the city in droves. Every year, thousands of Shurimans trek through the most treacherous and remote corners of the desert on a quest to find Rammus, for many teachings indicate he will answer a single question of those he finds deserving, if they are able to find him. Knowing his enthusiasm for desert treats, the pilgrims arm themselves with offerings thought to attract his blessing, packing their mules with flasks of sweet goat’s milk, chests filled with colonies of ants sealed in wax, and jars of honeycombs. Many never return from the deep desert, and fewer still with stories of the demigod, though travelers describe waking to find their packs mysteriously emptied of all edible provisions. </p><p>Whether he is truly a wise oracle, Ascended deity, or a mighty beast, Rammus is known for his miraculous feats of endurance. He entered the impenetrable Fortress of Siram, an imposing bastion designed by a crazed sorcerer. The structure was said to contain untold magical horrors - fearsome beasts mutated beyond recognition, corridors wreathed in flames, impenetrable tunnels guarded by shadow demons. Not an hour had passed when the enormous fortress collapsed in a plume of dust, and Rammus was seen rolling away. None knew why Rammus entered the darkened gate, nor what secrets he learned within the basalt walls of the fortress. In the year of the great flood he crossed the vast lake of Imalli in just two days, and dug many miles deep to destroy a giant anthill and kill its queen, whose daughters had devastated the nearby farmland. </p><p>Sometimes he appears as a benevolent hero. When invading Noxian warbands attacked a Northern Shuriman settlement, disparate tribes banded together to defend the territory beneath the Temple of the Ascended. They were no match for the invaders in size or skill, and the battle was all but lost when Rammus entered the fray. Each side was so shocked to see the elusive creature that fighting halted completely as they watched him roll between them. As Rammus passed the towering temple, the foundations of the building shook, and enormous stone blocks toppled onto the invading army, crushing many of its warriors. Now outnumbered, the army retreated to elated cheers from the Shurimans. While many swear Rammus saved the town out of love for Shurima, others argue he was merely defending the territory in which his favorite cactus flowers grew. At least one tribesman claims Rammus was simply sleeprolling and had no intention of taking down a temple.</p><p>Whatever the truth, stories of Rammus are treasured by the people of Shurima. Any Shuriman child can list a dozen theories on the question of his origin, half of which they likely invented on the spot. Tales of the Armordillo have only increased with the rise of Ancient Shurima, as they did just before its fall, giving way to a belief that his presence heralds darker times to come. </p><p>But how can such a benevolent, epicurean soul herald an age of destruction? </p>", "short": "Idolized by many, dismissed by some, mystifying to all, the curious being Rammus is an enigma. Protected by a spiked shell, he inspires increasingly disparate theories on his origin wherever he goes—from demigod, to sacred oracle, to a mere beast transformed by magic. Whatever the truth may be, Rammus keeps his own counsel and stops for no one as he roams the Shuriman desert.", "quote": "“OK.”", "quote-author": ""}, "bioImage": null, "headerImage": null}, "related-champions": [], "explore-champions": [], "modules": [{"type": "story-preview", "title": "Caravan North", "subtitle": null, "description": "<p>Ojan’s knife whittled the edge of the ironwood into a soft curve. As an eight-year-old, he wasn’t the most practiced craftsman; his wood block was just starting to resemble something round and spiky.</p>", "story-slug": "rammus-color-story", "featured-image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Rammus_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 779, "y": 209, "featured-champions": []}, "background": {"type": "image", "title": {"cs_cz": "Zoanthská kaskáda", "de_de": "Kaskade von Zoantha", "el_gr": "Χαράδρα της Ζοάνθα", "en_au": "Zoantha Cascade", "en_gb": "Zoantha Cascade", "en_ph": "Zoantha Cascade", "en_pl": "Zoantha Cascade", "en_sg": "Zoantha Cascade", "en_us": "Zoantha Cascade", "es_ar": "La cascada Zoantha", "es_es": "Cascada Zoantha", "es_mx": "La cascada Zoantha", "fr_fr": "Cascade de Zoantha", "hu_hu": "A Zoanta-zuhatag", "id_id": "Zoantha Cascade", "it_it": "La Cascata di Zoantha", "ja_jp": "ゾアンサの砂滝", "ko_kr": "조안사 계곡", "ms_my": "Zoantha Cascade", "pl_pl": "Wodospad Zoanthy", "pt_br": "Cascata Zoantha", "ro_ro": "Cascada Zoantha", "ru_ru": "Уступы Зоанта", "th_th": "เนินทรายโซแอนธา", "tr_tr": "ZOANTHA ÇAĞLAYANI", "vn_vn": "Thác Zoantha", "zh_cn": "索昂萨沙瀑 ", "zh_tw": "佐安沙瀑"}, "subtitle": "", "description": {"cs_cz": "O putujícím pouštním přílivu je známo, že si dokáže vyhloubit cestu i skrz holou skálu a v mohutných pískopádech se vrhá z vysokých útesů. Shurimané tradičně do těchto písků házejí milované předměty jako dary Vyzdviženým. Podobná místa proto bývají výnosným nalezištěm pro lovce pokladů.", "de_de": "Es ist nicht ungewöhnlich, dass die Gezeiten der Wüste sich durch blanken Fels fressen und gewaltige Sandfälle über Klippen hinabstürzen. Gemäß ihrer Tradition werfen die Shurimaner Gegenstände, die ihnen lieb und teuer sind, als Gabe an die Aufgestiegenen in den Sand. Aus diesem Grund sind solche Sandfälle oft lukrative Beutegründe für Schatzjäger.", "el_gr": "Οι άμμοι της ερήμου αλλοιώνουν τους βράχους δημιουργώντας νέα περάσματα και ξεχύνονται σε πελώριους καταρράκτες. Οι κάτοικοι της Σουρίμα συγκεντρώνονται σε αυτά τα σημεία για να τιμήσουν τις παραδόσεις τους και να πετάξουν τα αγαπημένα τους αντικείμενα στην άμμο, ως δώρα για τους Εξυψωμένους. Κατά συνέπεια, αυτοί οι καταρράκτες προσελκύουν πολλούς κυνηγούς θησαυρών.", "en_au": "The shifting tides of the desert has been known to carve paths through bare rock, tumbling over the cliff faces in massive sandfalls. Traditionally, Shurimans toss beloved objects into the sands as gifts to the Ascended. As a result, such falls are often lucrative spots for treasure hunters.", "en_gb": "The shifting tides of the desert has been known to carve paths through bare rock, tumbling over the cliff faces in massive sandfalls. Traditionally, Shurimans toss beloved objects into the sands as gifts to the Ascended. As a result, such falls are often lucrative spots for treasure hunters.", "en_ph": "The shifting tides of the desert has been known to carve paths through bare rock, tumbling over the cliff faces in massive sandfalls. Traditionally, Shurimans toss beloved objects into the sands as gifts to the Ascended. As a result, such falls are often lucrative spots for treasure hunters.", "en_pl": "The shifting tides of the desert has been known to carve paths through bare rock, tumbling over the cliff faces in massive sandfalls. Traditionally, Shurimans toss beloved objects into the sands as gifts to the Ascended. As a result, such falls are often lucrative spots for treasure hunters.", "en_sg": "The shifting tides of the desert has been known to carve paths through bare rock, tumbling over the cliff faces in massive sandfalls. Traditionally, Shurimans toss beloved objects into the sands as gifts to the Ascended. As a result, such falls are often lucrative spots for treasure hunters.", "en_us": "The shifting tides of the desert has been known to carve paths through bare rock, tumbling over the cliff faces in massive sandfalls. Traditionally, Shurimans toss beloved objects into the sands as gifts to the Ascended. As a result, such falls are often lucrative spots for treasure hunters.", "es_ar": "Se sabe que los cambios en las corrientes desérticas labran senderos en las rocas expuestas, impactando los acantilados y convirtiéndolos en enormes cascadas de arena. Tradicionalmente, los shurimanos arrojan objetos valiosos a las arenas como ofrendas para los Ascendidos. Como consecuencia, las cascadas suelen ser sitios lucrativos para los cazadores de tesoros.", "es_es": "Las cambiantes mareas del desierto han ido formando caminos y abriéndose paso entre las rocas, cayendo por los acantilados en forma de cascadas de arena. Los shurimanos tienen por tradición arrojar sus objetos más preciados a las arenas como una ofrenda a los Ascendidos. A causa de esto, de vez en cuando la zona se convierte en un lugar muy lucrativo para los cazadores de tesoros.", "es_mx": "Se sabe que los cambios en las corrientes desérticas labran senderos en las rocas expuestas, impactando los acantilados y convirtiéndolos en enormes cascadas de arena. Tradicionalmente, los shurimanos arrojan objetos valiosos a las arenas como ofrendas para los Ascendidos. Como consecuencia, las cascadas suelen ser sitios lucrativos para los cazadores de tesoros.", "fr_fr": "Les dunes changeantes du désert ont creusé des chemins dans la roche nue avant d'être précipitées du haut des falaises dans d'immenses chutes de sable. Traditionnellement, les Shurimiens jettent leurs objets préférés dans les sables en offrande aux Transfigurés. En conséquence, l'emplacement de ces chutes de sable peut être un endroit lucratif pour les chasseurs de trésor.", "hu_hu": "Köztudott, hogy a sivatag hullámzó homokja a sziklákat is kivájja, és hatalmas homokzuhatagként zúdul le az ormokról. A hagyomány szerint a shurimaiak számukra kedves tárgyakat dobáltak a homokba ajándék gyanánt a Felemelkedettek részére. Ennek eredményeként az efféle zuhatagok jövedelmezőek lehetnek a kincsvadászoknak.", "id_id": "The shifting tides of the desert has been known to carve paths through bare rock, tumbling over the cliff faces in massive sandfalls. Traditionally, Shurimans toss beloved objects into the sands as gifts to the Ascended. As a result, such falls are often lucrative spots for treasure hunters.", "it_it": "Le sabbie del deserto trasportate dal vento hanno scolpito sentieri nella nuda roccia, scivolando lungo i pendii come enormi valanghe sabbiose. Per tradizione, gli abitanti di Shurima gettavano i loro oggetti più preziosi in queste sabbie come dono per gli Ascesi. Ciò rende queste cascate un luogo molto remunerativo per i cacciatori di tesori.", "ja_jp": "砂漠の変転する砂の流れは、岩をうがち道を彫り、断崖を流れ下る巨大な砂の滝となることが知られている。シュリーマには超越者への贈り物として大切な持ち物を砂の中に投げ入れる伝統があるため、宝探しの探検家にとってそのような滝は格好のスポットとなっている。", "ko_kr": "사막의 흐르는 모래는 바위를 지나며 깎아내어 거대한 모래폭포의 절벽 아래로 떨어집니다. 슈리마인들은 전통적으로 초월체에게 선물을 바치기 위해 아끼는 물건을 모래 속에 던져 넣었고, 그 결과 이런 절벽은 보물 사냥꾼들이 한몫 두둑이 챙기는 장소가 되었습니다.", "ms_my": "The shifting tides of the desert has been known to carve paths through bare rock, tumbling over the cliff faces in massive sandfalls. Traditionally, Shurimans toss beloved objects into the sands as gifts to the Ascended. As a result, such falls are often lucrative spots for treasure hunters.", "pl_pl": "Zmienne prądy pustyni znane są z tego, że potrafią wydrążyć ścieżki w nagich skałach i staczać się z klifów, tworząc ogromne piaskospady. Według tradycji Shurimanie wrzucają w te piaski ukochane przedmioty jako podarki dla Wyniesionych. W wyniku tego takie kaskady piasku są owocnym miejscem poszukiwań dla łowców skarbów.", "pt_br": "Sabe-se que o movimento das dunas do deserto pode talhar caminhos através das pedras, escorregando pelos penhascos em grandes cachoeiras de areia. Tradicionalmente, os shurimanes atiram objetos queridos nas areias como presentes para os Ascendentes. Por causa disso, essas cascatas são bons locais para caçadores de tesouros lucrarem.", "ro_ro": "Caracterul schimbător al deșertului a deschis drumuri ce șerpuiesc prin stânci și se termină cu cascade de nisip. Tradiția le cere shurimanilor să arunce obiecte de preț în nisip ca ofrande pentru iluminați. Drept urmare, aceste cascade sunt deseori prădate de vânătorii de comori.", "ru_ru": "Иногда находящиеся в вечном движении пески Шуримы протачивают ходы в скалах и низвергаются вниз мощным песочным потоком. Поскольку шуримцы приносят жертвы вознесшимся, бросая в песок любимые вещи, такой 'пескопад' может озолотить кладоискателя.", "th_th": "กระแสคลื่นแห่งทะเลทรายได้กัดเซาะลานหินจนเกิดเป็นเส้นทาง ทำให้เม็ดทรายจำนวนมหาศาลไหลหล่นจากหน้าผา กลายเป็นดั่งเนินทรายขนาดมหึมา ตามธรรมเนียมของชาวชูริม่าแล้ว พวกเขามักจะโยนของมีค่าของตนลงในทราย เพื่อเป็นเครื่องบรรณาการต่อเหล่าทวยเทพ แต่หลายครั้งกลับกลายเป็นว่า พวกมันมักกลายเป็นจุดทำเงินให้แก่เหล่านักล่าสมบัติ", "tr_tr": "Çölün gelgit dalgalarının yamaçlardan devasa kum heyelanları halinde dökülerek dümdüz kayaların içine yol açtıkları bilinir. Shurima'lıların, Yükseliş'e ermişlere hediye olması için sevdikleri nesneleri kumlara atma geleneği vardır. Bu yüzden define avcıları, böyle kum çağlayanlarından iyi gelir elde eder.", "vn_vn": "Dòng cát chuyển dời đã tạo nên những con đường trên đá rồi tuôn ầm ầm xuống vách núi. Người Shurima có truyền thống ném những vật mình yêu thích xuống cát để làm quà cho Thể Thăng Hoa. Do đó, những ngọn thác kiểu này thường là chốn hấp dẫn cho các thợ săn kho báu.", "zh_cn": "黄沙的潮涌在岩石间凿出通路，在悬崖边形成壮阔的沙瀑。根据传统，恕瑞玛人会将心爱之物扔进沙流，当作是献给飞升者的礼物。于是，沙瀑也就成了寻宝者们最爱的乐园。", "zh_tw": "沙漠地形的變化會在裸露的岩石刻下路徑，沙子在越過懸崖時會因為下墜的關係形成壯觀的沙瀑。蘇瑞瑪有個傳統，這裡的人民會將物品扔到沙瀑中以作為給至高戰士的貢品。只是最後的結果往往是尋寶者在沙瀑末端等待天降的禮物。"}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/shurima_cascade_01.jpg", "encoding": "image/jpeg", "width": null, "height": null, "x": null, "y": null, "featured-champions": []}, "url": "/en_us/story/rammus-color-story", "release-date": "2016-05-12T08:00:00.000Z", "featured-champions": [{"type": "champion", "release-date": "2009-07-10", "name": "Rammus", "slug": "rammus", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Rammus_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 779, "y": 209, "featured-champions": []}, "role": [{"name": "Tank", "slug": "tank"}, {"name": "Fighter", "slug": "fighter"}]}], "word-count": 997, "minutes-to-read": 4}, {"section-title": "", "type": "image-gallery", "isFanArt": false, "fan-art-url": "", "featured-image": "", "title": "", "subtitle": "", "description": "", "assets": [{"type": "image", "title": {"cs_cz": "Ručně kreslený Rammus", "de_de": "Rammus – Handgezeichnet", "el_gr": "Ράμους, σχέδιο στο χέρι", "en_au": "Rammus hand drawn", "en_gb": "Rammus hand drawn", "en_ph": "Rammus hand drawn", "en_pl": "Rammus hand drawn", "en_sg": "Rammus hand drawn", "en_us": "Rammus hand drawn", "es_ar": "Rammus dibujado a mano", "es_es": "Rammus dibujado a mano", "es_mx": "Rammus dibujado a mano", "fr_fr": "Rammus dessiné à la main", "hu_hu": "Rammus szabadkézi rajza", "id_id": "Gambar Rammus dilukis dengan tangan", "it_it": "Rammus disegnato a mano", "ja_jp": "ラムス 手描き", "ko_kr": "람머스 핸드 드로잉", "ms_my": "Lukisan tangan Rammus", "pl_pl": "Rammus — odręczny szkic", "pt_br": "Desenho de Rammus", "ro_ro": "Rammus – desen de mână", "ru_ru": "Рисунок Раммуса от руки", "th_th": "ภาพ Rammus แบบวาดด้วยมือ", "tr_tr": "Rammus - elde çizilmiş", "vn_vn": "Vẽ tay Rammus", "zh_cn": "拉莫斯手绘", "zh_tw": "拉姆斯 手繪像"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/image-gallery/rammus_armordillo_concept.jpg", "encoding": "image/jpeg", "width": 1669, "height": 720, "x": 795, "y": 264, "featured-champions": []}, {"type": "image", "title": {"cs_cz": "Raný model Rammuse", "de_de": "Rammus – Frühes Modell", "el_gr": "Πρώιμο μοντέλο του Ράμους", "en_au": "Rammus early model", "en_gb": "Rammus early model", "en_ph": "Rammus early model", "en_pl": "Rammus early model", "en_sg": "Rammus early model", "en_us": "Rammus early model", "es_ar": "Modelo inicial de Rammus", "es_es": "Modelo inicial de Rammus", "es_mx": "Modelo inicial de Rammus", "fr_fr": "Modèle préliminaire de Rammus", "hu_hu": "Rammus korai modellje", "id_id": "Model Awal Rammus", "it_it": "Modello iniziale di Rammus", "ja_jp": "ラムス 初期モデル", "ko_kr": "람머스 초기 모델", "ms_my": "Model awal Rammus", "pl_pl": "Rammus — wczesny model", "pt_br": "Modelo inicial de Rammus", "ro_ro": "Rammus – model inițial", "ru_ru": "Ранняя модель Раммуса", "th_th": "โมเดลเริ่มแรกของ Rammus", "tr_tr": "Eski Rammus modeli", "vn_vn": "Mô hình ban đầu Rammus", "zh_cn": "拉莫斯早期模型", "zh_tw": "拉姆斯 早期模組"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/image-gallery/rammus_early_model.jpg", "encoding": "image/jpeg", "width": 1191, "height": 1080, "x": 781, "y": 611, "featured-champions": []}], "featured-champions": [{"type": "champion", "release-date": "2009-07-10", "name": "Rammus", "slug": "rammus", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Rammus_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 779, "y": 209, "featured-champions": []}, "role": [{"name": "Tank", "slug": "tank"}, {"name": "Fighter", "slug": "fighter"}]}]}]}