{"id": "renekton", "name": "Renekton Champion Page", "locale": "en_us", "champion": {"release-date": "2011-01-18", "slug": "renekton", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Renekton_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 801, "y": 6, "featured-champions": []}, "video": null, "associated-faction-slug": "shurima", "roles": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}], "name": "Renekton", "title": "the Butcher of the Sands", "game-info-url": "http://gameinfo.na.leagueoflegends.com/en/game-info/champions/renekton", "biography": {"full": "<p>Renekton is a terrifying, rage-fueled Ascended being from the scorched deserts of Shurima. Once, he was his empire’s most esteemed warrior, leading the armies of Shurima to countless victories. However, after the empire’s fall, Renekton was entombed beneath the sands, and slowly, as the world turned and changed, he succumbed to insanity. Now free once more, he is utterly consumed with finding and killing his brother, Nasus, who he blames, in his madness, for the centuries he spent in darkness. </p><p>Renekton was born to fight. From a young age he was constantly getting into vicious brawls. He had no fear, and was able to hold his own against much older children. It was often pride that led to these confrontations, as Renekton was unable to back down, or let any insult pass. Every evening, he came home with cuts and fresh bruises, and while his more scholarly older brother, Nasus, disapproved of his street-fighting, Renekton relished it. </p><p>Nasus soon moved away, having been chosen to join the elite Collegium of the Sun, and in the years he was absent, Renekton’s skirmishes became increasingly serious. On a rare visit home, Nasus was horrified to see his bloodied young brother return home from yet another street fight. Fearing Renekton’s violent nature would see him imprisoned or in an early grave, Nasus helped him enlist in the Shuriman army. Officially, Renekton was too young for this duty, but his older brother’s influence smoothed away this detail.</p><p>The discipline and regimentation of the army was a blessing for Renekton. Within a few years, he rose to become one of Shurima’s most feared and capable war-captains, and he fought on the front line in numerous wars of conquest to expand the empire. He garnered a reputation for ferocity and toughness, but also for honor and bravery. Nasus became a decorated general, and the two of them served in a number of campaigns together, remaining very close despite their inherent differences and frequent disagreements. Nasus’s skill lay in strategy, logistics and history; Renekton’s lay in battle. Nasus planned the wars, and Renekton won them.</p><p>Renekton earned the title Gatekeeper of Shurima after fighting a desperate battle in one of the mountain passes bordering Shurima. An invading force had landed on the south coast, striking toward the isolated city of Zuretta. If it was not halted, the city was certain to be razed, and its populace massacred. Outnumbered ten to one, Renekton and a small contingent faced these aggressors, determined to buy time for the city to be evacuated. It was a battle that none expected Renekton to survive, let alone win. He held the pass for a day and a night, long enough for a relief force led by Nasus to arrive. With barely a handful of warriors left standing, none uninjured, Renekton was hailed a hero.</p><p>Renekton served on the frontlines for decades, and never lost a battle. His presence was inspiring to those fighting alongside him, and terrifying to his enemies. Victory after victory were his, and such was his reputation that some wars were won without a sword even being lifted, enemy nations surrendering as soon as they heard Renekton was marching on them.</p><p>Renekton was of middling years, a grizzled and battle-scarred veteran, when word reached him that his brother was close to death. He raced back to the capital to find Nasus a pale shadow of his former self, having been struck down by a debilitating wasting malady. The sickness was incurable, similar to the rotting curse said to have cut down an entire noble line in antiquity. </p><p>Nevertheless, Nasus’s greatness was recognized by one and all. As well as being a highly decorated general, he curated the great library of Shurima, and penned many of the finest literary works in the empire. The priesthood proclaimed it to be the sun’s will that he undertake the Ascension ritual.</p><p>The whole city gathered to witness the holy rite, but the tragic illness had taken a terrible toll, and Nasus no longer had the strength to scale the stairs to the Ascension dais. In the ultimate act of self-sacrifice and love, Renekton lifted his brother in his arms, and climbed the final steps, fully expecting to be obliterated in the process by the holy energies of the sun disc. He deemed his sacrifice a small thing to ensure that his brother would live on. He was just a warrior, after all, albeit a talented one, while his brother was a peerless scholar, thinker and general. Renekton knew that Shurima would need Nasus in the years to come.</p><p>Renekton was not destroyed, however. Beneath the blinding radiance of the sun disc, both brothers were raised up and remade. When the light faded, two mighty Ascended beings stood before the onlookers, Nasus in his lean, jackal-headed body, and Renekton in his immense, crocodilian form. Their forms seemed apt; the jackal was often regarded as the most clever and cunning of beasts, and the fearless aggression of the crocodile fit Renekton perfectly. Shurima gave thanks to have these new demigods as guardians of the empire. </p><p>Renekton had been a mighty war hero before, but now he was an Ascended being, blessed with power beyond mortal understanding. He was stronger and faster than any regular man, and seemed virtually immune to pain. Though Ascended beings were not immortal, their lifespans were dramatically increased, so that they might serve the empire for hundreds of years. </p><p>With Renekton at the head of the Shuriman armies, the empire’s military was all but unstoppable. He had always been a ruthless commander and ferocious fighter, but his new form gave him power beyond belief. He led the soldiers of Shurima to many bloody victories, neither giving nor expecting mercy. His legend spread far beyond the borders of the empire, and it was his enemies that gave him the name Butcher of the Sands, a title he embraced.</p><p>There were those, Nasus among them, who came to believe that a portion of Renekton’s humanity had been lost in his transformation. As the years progressed, he seemed to become crueler, relishing the spilling of blood more than was natural, and whispers circulated of atrocities he committed in the name of war. Nevertheless, he was a staunch defender of Shurima, and he faithfully served a succession of emperors, ensuring the security and greatness of Shurima for hundreds of years.</p><p>During the reign of the Emperor Azir, word arrived that a magical being of fire had escaped the magical sarcophagus that bound it in its underground prison. It had laid waste to a Shuriman town, before fleeing across the desert to the east. Renekton and his brother Nasus set forth to recapture this legendary foe. While they were absent, the young emperor, guided by the manipulations of his magus, Xerath, attempted to join their ranks and become one of the Ascended. The results were catastrophic.</p><p>Renekton and Nasus were a day’s ride from the capital, but even so, they felt the shockwave as the Ascension ritual went awry. Knowing that something terrible had come to pass, they raced back to find the glorious city in ruins. Azir had been killed, along with most of the city’s populace, and the great sun disc was falling, drained of all its power.  At the epicenter of the ruin, they encountered Xerath, now a being of pure, malevolent power.</p><p>The brothers sought to bind Xerath in the magical sarcophagus that had held the ancient being of fire. For a day and a night they battled, but the magus was powerful, and would not be held. He shattered the sarcophagus, and assailed them with spells fueled by the power of sun disc, which crashed to the ground as they fought.</p><p>Knowing that they could not destroy Xerath, Renekton finally wrestled him into the depthless Tomb of the Emperors, and bade his brother seal them inside forever. Knowing there was no other way to stop Xerath, Nasus reluctantly did as his brother ordered. As Renekton and Xerath fell into darkness, Nasus sealed the tomb for all eternity.</p><p>In the darkness, Xerath and Renekton continued their battle. For uncounted years they fought, as the once-great civilization of Shurima collapsed to dust in the world above. Xerath whispered poison in Renekton’s ear, and gradually, as the centuries rolled on, his viperous words and the ever-present darkness took its toll. The magus implanted the notion in Renekton’s mind that Nasus had sealed him in on purpose, jealous of his success, and unwilling to share his Ascension.</p><p>Piece by piece, Renekton’s sanity cracked. Xerath drove a wedge into these cracks, corrupting his mind and twisting his perception of what was real and what was imagined.</p><p>Thousands of years later, the Tomb of the Emperors was opened by the mercenary Sivir, freeing Renekton and Xerath. Renekton roared his fury and thundered out into the Shuriman desert, sniffing the air for the scent of his brother.</p><p>Renekton now roams the deserts, seeking the death of Nasus, the traitor he believes left him to die. His grip on reality is tenuous at best, and while there are moments when he resembles the proud, honorable hero of the past, much of the time he is little more than a devolved hate-maddened beast, driven on by the thirst for blood and vengeance.</p>", "short": "Renekton is a terrifying, rage-fueled Ascended being from the scorched deserts of Shurima. Once, he was his empire’s most esteemed warrior, leading the nation’s armies to countless victories. However, after the empire’s fall, Renekton was entombed beneath the sands, and slowly, as the world turned and changed, he succumbed to insanity. Now free once more, he is utterly consumed with finding and killing his brother, Nasus, who he blames, in his madness, for the centuries he spent in darkness.", "quote": "“Blood and vengeance.”", "quote-author": ""}, "bioImage": null, "headerImage": null}, "related-champions": [{"type": "champion", "release-date": "2011-10-05", "name": "Xerath", "slug": "xerath", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Xerath_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 701, "y": 23, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Assassin", "slug": "assassin"}]}, {"type": "champion", "release-date": "2010-12-14", "name": "Cassiopeia", "slug": "cassiopeia", "echelon": 1, "associated-faction": "", "associated-faction-slug": "noxus", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Cassiopeia_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 847, "y": 55, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}]}, {"type": "champion", "release-date": "2009-10-01", "name": "Nasus", "slug": "nasus", "echelon": 2, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Nasus_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 889, "y": 40, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}, {"type": "champion", "release-date": "2014-09-16", "name": "Azir", "slug": "azir", "echelon": 3, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Azir_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1026, "y": 96, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Marksman", "slug": "marksman"}]}, {"type": "champion", "release-date": "2009-02-21", "name": "Sivir", "slug": "sivir", "echelon": 4, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Sivir_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 774, "y": 145, "featured-champions": []}, "role": [{"name": "Marksman", "slug": "marksman"}]}, {"type": "champion", "release-date": "2011-04-12", "name": "Brand", "slug": "brand", "echelon": 5, "associated-faction": "", "associated-faction-slug": "unaffiliated", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Brand_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1074, "y": 50, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}]}], "explore-champions": [], "modules": [{"type": "story-preview", "title": "Darkness Renews", "subtitle": null, "description": "<p>Am I a god?</p>", "story-slug": "renekton-color-story", "featured-image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Renekton_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 801, "y": 6, "featured-champions": []}, "background": {"type": "image", "title": {"cs_cz": "Shurima povstala z písků a opět je zalitá slunečním světlem", "de_de": "Shurima, auferstanden aus den Sanden, badet nun wieder im Licht der Sonne.", "el_gr": "Η Σουρίμα αναδύεται από την άμμο και λούζεται ξανά στο φως του ήλιου", "en_au": "Shurima, risen from the sands to bathe in the sun’s light once more", "en_gb": "Shurima, risen from the sands to bathe in the sun’s light once more", "en_ph": "Shurima, risen from the sands to bathe in the sun’s light once more", "en_pl": "Shurima, risen from the sands to bathe in the sun’s light once more", "en_sg": "Shurima, risen from the sands to bathe in the sun’s light once more", "en_us": "Shurima, risen from the sands to bathe in the sun’s light once more", "es_ar": "Shurima, surgida de las arenas para gozar de la luz solar una vez más", "es_es": "Shurima, surgida de las arenas para gozar de la luz solar una vez más", "es_mx": "Shurima, surgida de las arenas para gozar de la luz solar una vez más", "fr_fr": "Shurima, ressurgie des sables pour se baigner à nouveau dans la lumière du soleil", "hu_hu": "Shurima kiemelkedik a homokból, és ismét napfényben fürdik.", "id_id": "Shurima, bangkit dari balutan debu pasir menuju cahaya matahari sekali lagi", "it_it": "Shurima, sorta dalle sabbie per esporsi di nuovo alla luce del sole", "ja_jp": "シュリーマ。砂の中から隆起して、再び太陽の光を浴びる", "ko_kr": "모래 속에서 솟아올라 다시 한 번 햇빛을 보게 된 슈리마", "ms_my": "Shurima, dibangkitkan dari pasir dan diterangi cahaya matahari sekali lagi", "pl_pl": "Shurima, powstała z piasków, aby znów kąpać się w promieniach słońca", "pt_br": "Shurima, renascida das areias para se banhar novamente na luz do sol", "ro_ro": "Shurima, ridicată din nisipuri și strălucind din nou sub razele soarelui", "ru_ru": "Шурима, восставшая из песков, чтобы еще раз искупаться в лучах солнца.", "th_th": "Shurima ปรากฏมาจากใต้ผืนทรายเพื่อซึมซับแสงอาทิตย์อีกครั้งหนึ่ง", "tr_tr": "Kumlardan doğan SHURIMA, bir kez daha güneş ışıklarıyla yıkanıyor.", "vn_vn": "Shurima trỗi dậy đón lại ánh mắt trời", "zh_cn": "恕瑞玛从沙砾中升起，又一次沐浴在太阳的光辉下", "zh_tw": "蘇瑞瑪，再一次的從狂沙中蘇醒，沐浴在日光之下"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/factions/image-gallery/shurima-risen.jpg", "encoding": "image/jpeg", "width": 1920, "height": 833, "x": 925, "y": 7, "featured-champions": []}, "url": "/en_us/story/renekton-color-story", "release-date": "2016-05-08T08:00:00.000Z", "featured-champions": [{"type": "champion", "release-date": "2011-01-18", "name": "Renekton", "slug": "renekton", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Renekton_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 801, "y": 6, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}], "word-count": 1055, "minutes-to-read": 4}, {"type": "story-preview", "title": "Bloodline", "subtitle": "by Graham McNeill", "description": "<p>Taliyah had almost forgotten how much she’d missed the furnace heat of Shurima – the sweat and crush of hundreds of people pushing, cursing, haggling and speaking with such passion and speed that outsiders often thought they were fighting.</p>", "story-slug": "rg-shurima-story", "featured-image": null, "background": {"type": "image", "title": {"cs_cz": "Znovu vztyčený sluneční kotouč nad ulicemi Nashramae", "de_de": "Die nachgebaute Sonnenscheibe über den Straßen von Nashramae", "el_gr": "Ο ηλιακός δίσκος δεσπόζει ξανά στους δρόμους της Νασραμαέ", "en_au": "The rebuilt sun disc over the streets of Nashramae", "en_gb": "The rebuilt sun disc over the streets of Nashramae", "en_ph": "The rebuilt sun disc over the streets of Nashramae", "en_pl": "The rebuilt sun disc over the streets of Nashramae", "en_sg": "The rebuilt sun disc over the streets of Nashramae", "en_us": "The rebuilt sun disc over the streets of Nashramae", "es_ar": "El disco solar reconstruido sobre las calles de Nashramae", "es_es": "El disco solar reconstruido sobre las calles de Nashramae", "es_mx": "El disco solar reconstruido sobre las calles de Nashramae", "fr_fr": "Le Disque solaire reconstruit surplombe les rues de Nashramae", "hu_hu": "Az újjáépített napkorong Nashramé utcái fölé magasodik.", "id_id": "Sun Disc yang dibuat lagi di jalanan Nashramae", "it_it": "Il disco solare ricostruito sopra le strade di Vekaura", "ja_jp": "ベカウラの上空にある再建された太陽の円盤", "ko_kr": "나시라미 거리에 다시 세워진 태양 원판", "ms_my": "Cakera matahari yang dibina semula di atas jalan raya Nashramae", "pl_pl": "Odbudowany słoneczny dysk ponad ulicami Nashramae", "pt_br": "O disco solar reconstruído mas ruas de Nashramae", "ro_ro": "Discul soarelui, reconstruit deasupra străzilor din Nashramae", "ru_ru": "Восстановленный солнечный диск нависает над улицами Нашраме.", "th_th": "Sun Disc ที่ถูกสร้างขึ้นมาใหม่อยู่เหนือถนน Nashramae", "tr_tr": "Nashramae sokakları üzerinde yeniden yükselen Güneş Kursu", "vn_vn": "Đĩa Mặt Trời được dựng lại  ở Nashramae", "zh_cn": "重建后的太阳圆盘悬在纳施拉美的街道之上", "zh_tw": "位於娜敘亞麥上方重建的烈日之輪"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/factions/image-gallery/shurima-vekaurastreets.jpg", "encoding": "image/jpeg", "width": 1920, "height": 887, "x": 1049, "y": 763, "featured-champions": []}, "word-count": 9630, "minutes-to-read": 36, "featured-champions": [{"type": "champion", "release-date": "2016-05-18", "name": "Taliyah", "slug": "taliyah", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Taliyah_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1063, "y": 0, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Support", "slug": "support"}]}, {"type": "champion", "release-date": "2009-10-01", "name": "Nasus", "slug": "nasus", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Nasus_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 889, "y": 40, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}, {"type": "champion", "release-date": "2011-10-05", "name": "Xerath", "slug": "xerath", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Xerath_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 701, "y": 23, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Assassin", "slug": "assassin"}]}, {"type": "champion", "release-date": "2011-01-18", "name": "Renekton", "slug": "renekton", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Renekton_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 801, "y": 6, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}], "release-date": "2016-05-12T08:00:00.000Z", "url": "/en_us/story/rg-shurima-story"}, {"section-title": "", "type": "image-gallery", "isFanArt": false, "fan-art-url": "", "featured-image": "", "title": "", "subtitle": "", "description": "", "assets": [{"type": "image", "title": {"cs_cz": "Obrázek přepracovaného Renektona", "de_de": "Renekton-Aktualisierung –Zeichnung", "el_gr": "Σχέδια για τον ανανεωμένο Ρένεκτον", "en_au": "Renekton rework art", "en_gb": "Renekton rework art", "en_ph": "Renekton rework art", "en_pl": "Renekton rework art", "en_sg": "Renekton rework art", "en_us": "Renekton rework art", "es_ar": "Ilustración de la actualización de Renekton", "es_es": "Ilustración de la actualización de Renekton", "es_mx": "Ilustración de la actualización de Renekton", "fr_fr": "Visuel de la refonte de Renekton", "hu_hu": "Az átdolgozott Renekton rajza", "id_id": "Art Rework Renekton", "it_it": "Art del restyling di Renekton", "ja_jp": "レネクトン リワーク アート", "ko_kr": "레넥톤 재작업 아트", "ms_my": "Seni rework Renekton", "pl_pl": "Renekton — zmieniony wygląd", "pt_br": "Arte do novo Renekton", "ro_ro": "Renekton – imagine actualizare", "ru_ru": "Изображение обновленного Ренектона", "th_th": "ภาพของ Renekton ปรับปรุงใหม่", "tr_tr": "Renekton güncelleme çalışması", "vn_vn": "Hình Renekton làm lại", "zh_cn": "雷克顿重做版艺术", "zh_tw": "重制雷尼克頓 藝術"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/image-gallery/renekton_rework.jpg", "encoding": "image/jpeg", "width": 1737, "height": 1080, "x": 11, "y": 425, "featured-champions": []}], "featured-champions": [{"type": "champion", "release-date": "2011-01-18", "name": "Renekton", "slug": "renekton", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Renekton_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 801, "y": 6, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}]}]}