{"id": "soraka", "name": "Soraka Champion Page", "locale": "en_us", "champion": {"release-date": "2009-02-21", "slug": "soraka", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Soraka_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 688, "y": 0, "featured-champions": []}, "video": null, "associated-faction-slug": "mount-targon", "roles": [{"name": "Support", "slug": "support"}, {"name": "Mage", "slug": "mage"}], "name": "Soraka", "title": "the Starchild", "game-info-url": "http://gameinfo.na.leagueoflegends.com/en/game-info/champions/soraka", "biography": {"full": "<p>An age ago, when time itself was young, the inhabitants of the celestial realm regarded the fledgling races of Runeterra with growing concern.</p><p>These creatures deviated wildly, unpredictably, and dangerously from the great designs intended for them by those above. The guidance and fates that had been woven into the night sky often went unseen—or worse, were misinterpreted by their simple mortal minds, leading to chaos, uncertainty, and suffering.</p><p>No longer able to merely watch, one celestial being chose to descend to the mortal realm, determined to untangle the knots in the tapestry of the world. This child of the stars took on a form of flesh and blood, and though the powerful magic coursing through her veins burned this new body from the inside out, she knew her suffering meant little if she could help to heal all that was broken and incomplete.</p><p>And so Soraka came to be, and set upon her journey to soothe the mortals she encountered.</p><p>Even so, she quickly learned the capacity for cruelty that the peoples of Runeterra possessed. Whether on the battlefields of inescapable conflicts, in the seedy underbellies of sprawling cities, or on the frontiers of the untamed wilderness beyond them, there seemed to be no end to the fighting, betrayal, and suffering Soraka witnessed. She watched, helpless, as mortals ignorantly broke the threads of destiny they could have woven together. Their lives were too short, she reasoned. They were simply unable to see the greater patterns, now lost.</p><p>But as Soraka lived among them, as one of them, trying to repair what little of the damage she could… something incredible and wholly unforeseen happened.</p><p>From the snarls and tangles and knots, the messy breaks in the great patterns, Soraka noticed a new, unintended design emerging—intertwined, and of a staggering complexity.</p><p>Unintended and wild, the mortals were forging new and unknown futures for themselves. From the celestial realm above, it had seemed like pure chaos; but with her new perspective, and blessed by the stars to stand against the erosion of time, Soraka now beheld an almost perfect beauty. Just as mortals had the deepest capacity for cruelty, so too did they possess infinite potential for kindness, and inspiration to rival anything among the stars.</p><p>Soraka realized her place was not to repair or replicate the celestial pattern. While a part of her craved the fixed, comforting destinies of the stars, she knew in her heart that static fates could not contain the unbridled, dynamic potential of mortality.</p><p>And so her work took on renewed vigor, driven to unlock the untapped possibilities of all she met. Soraka sought now to inspire and guide rather than shepherd, to see what unblazed trails each mortal would discover for themselves in their brief, radiant moment.</p><p>Over the millennia, legends of the Starchild have filtered through all the lands of Runeterra. Some tribes of the Freljord still speak of a far wanderer, a horned healer who soothed the icy bite of the most brutal winters. In the depths beneath Zaun, rumors float of a lilac skinned medic who would purify weary lungs from the ravages of the alchemical Gray. In troubled Ionia, the oldest myths of the Vastayashai’rei recall a seer who communed with the stars themselves, and called upon their light both to heal the wounded and scorch those who would do further harm to the First Lands.</p><p>Currently, Soraka calls the westernmost peaks of Targon her home. She watches over an isolated tribe of vastaya, teaching them her healing ways, and tending quietly to her own needs—though what brings her so close to the great mountain, or how long she will stay, only Soraka knows.</p><p>Many times, she has watched entire civilizations dance close to the brink of destruction, and she has learned that she cannot save those who do not wish it, nor force them to see what they will not.</p><p>All the same, Soraka is determined never to stop trying.</p>", "short": "A wanderer from the celestial realm, Soraka gave up her immortal form to protect the mortal races from their own ignorance and violent instincts. She endeavors to spread the virtues of compassion and mercy to everyone she meets—guiding the lost, and healing the wounded. For all Soraka has seen of this world's struggles, she still believes the people of Runeterra have yet to reach their full potential.", "quote": "Two paths lie before you, but you can only take one.", "quote-author": ""}, "bioImage": null, "headerImage": null}, "related-champions": [{"type": "champion", "release-date": "2016-03-24 ", "name": "Aurelion Sol", "slug": "aurelionsol", "echelon": 0, "associated-faction": "", "associated-faction-slug": "unaffiliated", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/AurelionSol_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 687, "y": 2, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Fighter", "slug": "fighter"}]}, {"type": "champion", "release-date": "2012-09-13", "name": "Syndra", "slug": "syndra", "echelon": 1, "associated-faction": "", "associated-faction-slug": "ionia", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Syndra_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1022, "y": 69, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Support", "slug": "support"}]}, {"type": "champion", "release-date": "2009-02-21", "name": "Warwick", "slug": "warwick", "echelon": 2, "associated-faction": "", "associated-faction-slug": "zaun", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/warwick-splash-updated.jpg", "encoding": "image/jpeg", "width": 1280, "height": 783, "x": 885, "y": 476, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}], "explore-champions": [], "modules": [{"type": "story-preview", "title": "Halfway Between the Stars and Earth", "subtitle": "by Katie Chironis", "description": "<p>It was a perfectly good night for a cup of tea. Chilly, certainly, but clear—as crisp a night as frigid Mount Targon ever got, really. Soraka was expecting a visitor. The snow in the stone kettle had already begun to melt over the hearth at the center of her little yurt; as it grew warmer, the room was suffused with the smell of dried tea leaves and sparse mountain herbs. </p>", "story-slug": "soraka-color-story", "featured-image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/soraka-color-bg.jpg", "encoding": "image/jpeg", "width": 1920, "height": 1080, "x": 1392, "y": 1064, "featured-champions": []}, "background": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/soraka-color-bg.jpg", "encoding": "image/jpeg", "width": 1920, "height": 1080, "x": 1392, "y": 1064, "featured-champions": []}, "url": "/en_us/story/soraka-color-story", "release-date": "2018-12-20T08:00:00.000Z", "featured-champions": [{"type": "champion", "release-date": "2009-02-21", "name": "Soraka", "slug": "soraka", "echelon": 0, "associated-faction": "", "associated-faction-slug": "mount-targon", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Soraka_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 688, "y": 0, "featured-champions": []}, "role": [{"name": "Support", "slug": "support"}, {"name": "Mage", "slug": "mage"}]}], "word-count": 1289, "minutes-to-read": 5}]}