{"id": "vayne", "name": "Vayne Champion Page", "locale": "en_us", "champion": {"release-date": "2011-05-10", "slug": "vayne", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Vayne_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1122, "y": 76, "featured-champions": []}, "video": null, "associated-faction-slug": "demacia", "roles": [{"name": "Marksman", "slug": "marksman"}, {"name": "Assassin", "slug": "assassin"}], "name": "Vayne", "title": "the Night Hunter", "game-info-url": "http://gameinfo.na.leagueoflegends.com/en/game-info/champions/vayne", "biography": {"full": "<p>Shauna Vayne is a deadly, remorseless monster hunter who has pledged her life to finding and killing the demon who murdered her family. Armed with her wrist-mounted crossbows and a heart full of vengeance, Vayne is only truly happy when she’s slaying practitioners or creations of the dark arts.</p><p>As the only child to a wealthy Demacian couple, Vayne enjoyed an upbringing of privilege. She spent most of her childhood indulged in solitary pursuits – reading, learning music, and avidly collecting the various insects found on their manor’s grounds. Her parents had traveled across Runeterra in their youth, but settled in Demacia after Shauna’s birth because more than any place they’d found, Demacians looked out for one another.</p><p>Shortly after Vayne’s sixteenth birthday, she returned home from a midsummer banquet and saw something she would never forget. </p><p>An unspeakably beautiful, horned woman stood before the bloodied corpses of her parents.</p><p>Vayne screamed in agony and terror. Before disappearing, the demon looked down at the young girl and flashed her a terrible, lustful smile. </p><p>Vayne tried to brush the bloody hair out of her mother’s eyes, but that haunting smile lingered in her mind, growing and consuming her. Even as she shakily smoothed her father’s eyelids closed – his mouth still agape, frozen in his last horrific moments of confusion – the demon’s smile seeped through her thoughts. </p><p>It was a smile that would fill Shauna’s veins with hatred for the rest of her days.</p><p>Vayne tried to explain what happened, but no one truly believed her. The thought of a demon on the loose – in the well-defended, magic-averse kingdom of Demacia, of all places – was too far-fetched to consider.</p><p>Vayne knew better. She knew from the demon’s smile the enchantress would strike again. Even Demacia’s tall walls couldn’t keep dark magic from creeping through the cracks. It may disguise itself with subtleties or keep to shadowed corners, but Vayne knew it was there. </p><p>And she was done being afraid.</p><p>Vayne had a heart full of hatred and enough coin to outfit a small army, but where she would go, no army dared follow. She needed to learn everything about dark magic: How to track it. How to stop it. How to kill those who practiced it.</p><p>She needed a teacher.</p><p>Her parents had told her stories of iceborn warriors who fought against an Ice Witch in the north. For generations, they had defended themselves from her unknowable forces and dark minions. This, Vayne knew, would be where she would find her tutor. She evaded her appointed custodians and booked passage on the next ship to the Freljord.</p><p>Shortly after arriving, Vayne set out in search of a monster hunter. She found one, although not in the way she intended. Traversing a frozen ravine, Vayne was ensnared by a cleverly carved icetrap. After tumbling to the bottom of a jagged, crystalline pit, Vayne stared up to see a ravenous ice troll, lips smacking with anticipation as he gazed upon his catch.</p><p>His gigantic blue tongue fell limp as a spear whistled through the air, pierced the troll’s skull and planted itself deep in his brain. The giant toppled into the pit and Vayne rolled aside just in time to escape being crushed. A sticky pool of drool and blood collected at her boots.</p><p>Vayne’s savior was a grizzled, middle-aged woman named Frey. She bandaged Vayne’s wounds as they clung to the warmth of a campfire that struggled to stay ablaze in the frigid canyon. Frey told Vayne of her life’s work spent fighting the Ice Witch’s minions who had murdered her children. Vayne implored the woman to take her on as a student and teach her to track the dark creatures of the world, but the Freljordian had no interest. Vayne stank of privilege and money, neither of which kept your teeth gritted or your blade sharp through the grueling perseverance of a fight.</p><p>Vayne couldn’t accept Frey’s answer and challenged her to a duel: if she won, Frey would train her. If she lost, she’d offer herself as bait to the Ice Witch’s minions, so Frey could ambush them. Vayne had no reason to think she’d win – her training amounted to a single afternoon of studying fencing before she wearied of trying to fight with one hand behind her back – but she refused to back down. To reward Vayne’s mettle, Frey threw snow in Vayne’s eyes and subsequently taught her the first rule of monster hunting: don’t play fair.</p><p>Frey saw a determination in Vayne she couldn’t help but respect. The girl had a long way to go as a fighter, but each time Vayne pushed her bruised body up from the dirtied snow to continue the fight, Frey saw a little more of the relentless hunter this girl could become. Beaten in skill, but never in spirit, Vayne beseeched Frey one last time: both of their families were dead. Frey could spend the rest of her days tracking ice trolls until one of them caved her head in, or she could teach Vayne. Together, they could kill twice as many monsters. Together, they could save twice as many families from experiencing the pain that defined them both. Frey saw the same hatred and loss in Vayne’s eyes her own had burned with for years. </p><p>Frey agreed to accompany Vayne back to Demacia.</p><p>Together they made the journey south, heavily disguising Frey to illude Demacia’s border guards. Once back at Vayne’s estate, the two spent years training. Despite the pageant of suitors who solicited Vayne’s company, Shauna had no interest in anything other than training with Frey. As a result, the two became incredibly close.</p><p>Frey taught Vayne the fundamentals of dark magic, conjured beasts, and vile spells. Vayne committed every word of Frey's teachings to heart, but found it slightly unnerving that Frey never explained how she came to know so many specifics of these malefic practices. </p><p>Due to the kingdom’s watchful soldiers and antimagic trees, dark creatures were rare within Demacia's walls, so Frey and Vayne would venture into the border forests at night to hunt. Vayne earned her first kill – a bloodthirsty creature who preyed on traveling merchants – at the age of eighteen.</p><p>Soaked in the creature’s viscera, something awoke within Vayne: pleasure. The hot flush of vengeance and violence raced through her blood, and she relished in the sensation. </p><p>Vayne and Frey spent several years hunting dark creatures, their respect for one another growing with every kill. One day, Vayne realized that she loved Frey like a mother, but her emotions of familial love were so tangled with pain and tainted by trauma, Vayne fought them as she would any beast out to hurt her.</p><p>Vayne and Frey traveled Valoran, until tavern tales from the highlands caught their ear, whispering of a demonic horned creature of mesmerizing beauty. According to the stories, the demon had been busy: she’d formed a cult, designed to attract worshippers who would do her bidding. People would walk into the hills, never to be heard from again. It was said the cult’s high priests had a holy grounds near the cliffside, where they’d prepare the demon’s sacrificial offerings. Vayne and Frey immediately set off on the hunt.</p><p>As they journeyed into the hills by cover of night, Vayne found herself distracted. For the first time since their partnership began, she felt worried for Frey – worried she might lose her mother figure for a second time. Before she could confess her fear, one of the demon’s priests lunged from the brush, swinging a mace into Vayne’s shoulder. </p><p>Vayne was badly wounded. Frey had a brief moment of hesitation, but her eyes steeled with certainty as she apologized to her friend and transformed into a monstrous Freljordian wolf. As Vayne watched in shock, Frey – in her animalistic form – tore the priest’s tendons from his throat with a swift snap of her mighty jaws.</p><p>With the priest’s body laid strewn at Vayne’s feet, Frey retook her human form, yet her eyes betrayed the scared animal within. She explained that after the death of her family, she had become a shaman, inviting the curse upon herself in order to gain the power to change shape and fight against the Ice Witch. The ritual that gave her these powers involved dark magic, but she made this sacrifice to protect–</p><p>–Vayne put an arrow through Frey’s heart without allowing her another syllable. Whatever affection she had felt for Frey evaporated upon discovering her true nature. A tear formed in Frey’s eye as she collapsed, but Vayne didn’t notice – whatever warmth the two had shared died with Frey.</p><p>There were still hours left before dawn, which meant hours left to continue the hunt. Vayne thought only of the demon. The kill that would be hers to savor. And all the kills to come. Runeterra’s underworld would come to fear her, just as she had once feared them.</p><p>For the first time since her parents’ death, Vayne smiled.</p>", "short": "Shauna Vayne is a deadly, remorseless Demacian monster hunter, who has dedicated her life to finding and destroying the demon that murdered her family. Armed with a wrist-mounted crossbow and a heart full of vengeance, she is only truly happy when slaying practitioners or creations of the dark arts, striking from the shadows with a flurry of silver bolts.", "quote": "“I don’t kill creatures like you because it’s the right thing to do. I kill you because I enjoy it.”", "quote-author": ""}, "bioImage": null, "headerImage": null}, "related-champions": [{"type": "champion", "release-date": "2010-07-27", "name": "Vladimir", "slug": "vladimir", "echelon": 0, "associated-faction": "", "associated-faction-slug": "noxus", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Vladimir_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1023, "y": 21, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Tank", "slug": "tank"}]}, {"type": "champion", "release-date": "2009-02-21", "name": "Warwick", "slug": "warwick", "echelon": 1, "associated-faction": "", "associated-faction-slug": "zaun", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/warwick-splash-updated.jpg", "encoding": "image/jpeg", "width": 1280, "height": 783, "x": 885, "y": 476, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}, {"type": "champion", "release-date": "2009-02-21", "name": "Sion", "slug": "sion", "echelon": 2, "associated-faction": "", "associated-faction-slug": "noxus", "image": {"type": "image", "title": {"cs_cz": "Sionův hlavní obrázek", "de_de": "Sion – Startbild", "el_gr": "Splash art για τον Σάιον", "en_au": "Sion splash", "en_gb": "Sion splash", "en_ph": "Sion splash", "en_pl": "Sion splash", "en_sg": "Sion splash", "en_us": "Sion splash", "es_ar": "Ilustración de Sion", "es_es": "Ilustración de Sion", "es_mx": "Ilustración de Sion", "fr_fr": "Illustration de Sion", "hu_hu": "Sion töltőképernyője", "id_id": "Splash Art Sion", "it_it": "Splash di Sion", "ja_jp": "サイオン スプラッシュアート", "ko_kr": "사이온 일러스트", "ms_my": "Splash Sion", "pl_pl": "Sion — portret", "pt_br": "Ilustração de Sion", "ro_ro": "Sion – ilustrație din joc", "ru_ru": "Картинка Сиона", "th_th": "ภาพสแปลชของ Sion", "tr_tr": "SION görseli", "vn_vn": "Ảnh nền Sion", "zh_cn": "赛恩原画", "zh_tw": "賽恩 美術圖"}, "subtitle": "", "description": {}, "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Sion_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 944, "y": 4, "featured-champions": []}, "role": [{"name": "Tank", "slug": "tank"}, {"name": "Fighter", "slug": "fighter"}]}], "explore-champions": [], "modules": [{"type": "story-preview", "title": "Monsters", "subtitle": null, "description": "For Vayne, revenge is a dish best served brutal, bloody, and with skull-piercing bolts.", "story-slug": "vayne-color-story", "featured-image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Vayne_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1122, "y": 76, "featured-champions": []}, "background": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/demacia-sketches/vayne-demacia-sketch.jpg", "encoding": "image/jpeg", "width": 1719, "height": 2397, "x": 86, "y": 409, "featured-champions": []}, "url": "/en_us/story/vayne-color-story", "release-date": "2017-03-24T08:00:00.000Z", "featured-champions": [{"type": "champion", "release-date": "2011-05-10", "name": "Vayne", "slug": "vayne", "echelon": 0, "associated-faction": "", "associated-faction-slug": "demacia", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Vayne_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1122, "y": 76, "featured-champions": []}, "role": [{"name": "Marksman", "slug": "marksman"}, {"name": "Assassin", "slug": "assassin"}]}], "word-count": 1139, "minutes-to-read": 5}, {"section-title": "", "type": "image-gallery", "isFanArt": false, "fan-art-url": "", "featured-image": "", "title": "", "subtitle": "", "description": "", "assets": [{"type": "image", "title": {"cs_cz": "Grafický návrh Vayne", "de_de": "Vayne – Konzept", "el_gr": "Concept art για τη Βέιν", "en_au": "Vayne concept", "en_gb": "Vayne concept", "en_ph": "Vayne concept", "en_pl": "Vayne concept", "en_sg": "Vayne concept", "en_us": "Vayne concept", "es_ar": "Concepto de Vayne", "es_es": "Concepto de Vayne", "es_mx": "Concepto de Vayne", "fr_fr": "Concept de Vayne", "hu_hu": "Vayne látványterve", "id_id": "Konsep Vayne", "it_it": "Bozzetto di Vayne", "ja_jp": "ヴェイン コンセプトアート", "ko_kr": "베인 컨셉 아트", "ms_my": "Konsep Vayne", "pl_pl": "Vayne — grafika koncepcyjna", "pt_br": "Conceito de Vayne", "ro_ro": "Vayne – concept", "ru_ru": "Эскиз Вейн", "th_th": "คอนเซปต์ของ Vayne", "tr_tr": "Vayne konsepti", "vn_vn": "Hình mẫu Vayne", "zh_cn": "薇恩概念图", "zh_tw": "汎 設計概念"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/image-gallery/vayne_base_skin_concept.jpg", "encoding": "image/jpeg", "width": 1733, "height": 1001, "x": 306, "y": 217, "featured-champions": []}, {"type": "image", "title": {"cs_cz": "Raný grafický návrh Vayne", "de_de": "Vayne – Frühes Konzept", "el_gr": "Πρώιμο concept art για τη Βέιν", "en_au": "Vayne early concept", "en_gb": "Vayne early concept", "en_ph": "Vayne early concept", "en_pl": "Vayne early concept", "en_sg": "Vayne early concept", "en_us": "Vayne early concept", "es_ar": "Concepto inicial de Vayne", "es_es": "Concepto inicial de Vayne", "es_mx": "Concepto inicial de Vayne", "fr_fr": "Concept préliminaire de Vayne", "hu_hu": "Vayne korai látványterve", "id_id": "Konsep Awal Vayne", "it_it": "Bozzetto iniziale di Vayne", "ja_jp": "ヴェイン 初期コンセプトアート", "ko_kr": "베인 초기 컨셉 아트", "ms_my": "Konsep awal Vayne", "pl_pl": "Vayne — wczesna grafika koncepcyjna", "pt_br": "Conceito inicial de Vayne", "ro_ro": "Vayne – concept inițial", "ru_ru": "Ранний эскиз Вейн", "th_th": "คอนเซปต์เริ่มแรกของ Vayne", "tr_tr": "Eski Vayne konsepti", "vn_vn": "Hình mẫu ban đầu Vayne", "zh_cn": "薇恩早期概念图", "zh_tw": "汎 早期概念"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/image-gallery/vayne_early_concept.jpg", "encoding": "image/jpeg", "width": 1920, "height": 635, "x": 1804, "y": 65, "featured-champions": []}, {"type": "image", "title": {"cs_cz": "Vaynin portrét", "de_de": "Vayne – Porträt", "el_gr": "Πορτρέτο της Βέιν", "en_au": "Vayne portrait", "en_gb": "Vayne portrait", "en_ph": "Vayne portrait", "en_pl": "Vayne portrait", "en_sg": "Vayne portrait", "en_us": "Vayne portrait", "es_ar": "Retrato de Vayne", "es_es": "Retrato de Vayne", "es_mx": "Retrato de Vayne", "fr_fr": "Portrait de Vayne", "hu_hu": "Vayne portréja", "id_id": "Potret Vayne", "it_it": "Ritratto di Vayne", "ja_jp": "ヴェイン 肖像画", "ko_kr": "베인 초상", "ms_my": "Potret Vayne", "pl_pl": "Vayne — portret", "pt_br": "Retrato de Vayne", "ro_ro": "Vayne – portret", "ru_ru": "Портрет Вейн", "th_th": "รูปภาพของ Vayne", "tr_tr": "Vayne portresi", "vn_vn": "Chân dung Vayne", "zh_cn": "薇恩肖像", "zh_tw": "汎 畫像"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/image-gallery/vayne_face.jpg", "encoding": "image/jpeg", "width": 771, "height": 1080, "x": 369, "y": 398, "featured-champions": []}], "featured-champions": [{"type": "champion", "release-date": "2011-05-10", "name": "Vayne", "slug": "vayne", "echelon": 0, "associated-faction": "", "associated-faction-slug": "demacia", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Vayne_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1122, "y": 76, "featured-champions": []}, "role": [{"name": "Marksman", "slug": "marksman"}, {"name": "Assassin", "slug": "assassin"}]}]}]}