{"id": "viktor", "name": "Viktor Champion Page", "locale": "en_us", "champion": {"release-date": "2011-12-29", "slug": "viktor", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Viktor_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 908, "y": 23, "featured-champions": []}, "video": null, "associated-faction-slug": "zaun", "roles": [{"name": "Mage", "slug": "mage"}], "name": "Viktor", "title": "the Machine Herald", "game-info-url": "http://gameinfo.na.leagueoflegends.com/en/game-info/champions/viktor", "biography": {"full": "<p>The herald of a new age of technology, Viktor has devoted his life to the advancement of humankind. An idealist who seeks to lift people to a new level of understanding, he believes that only by embracing a glorious evolution of technology can humanity’s full potential be realized. With a body augmented by steel and science, Viktor is zealous in his pursuit of this bright future.</p><p>Viktor was born in Zaun on the borders of the Entresol level, and, encouraged by his artisan parents, discovered a passion for invention and building. He devoted every waking minute to his studies, hating to interrupt his work even to eat or sleep. Even worse was having to rapidly relocate if there was a nearby chemical spill, accidental detonation or incoming chem-cloud. Abandoning his work, even for a short time, was anathema to Viktor.</p><p>In a bid to impose a level of order and certainty on his world, Viktor researched Zaun’s many accidents and came to realize that almost all of them were the result of human error, not mechanical failure. He offered his services to the local businesses, developing inventions that made them far safer working environments. Most turned him away, but one - the Fredersen Chem-forge - took a chance on this earnest young man.</p><p>Viktor’s inventions in automation reduced the number of accidents in the forge to zero within a month. Soon, other establishments sought his work and Viktor’s designs became common in Zaun, improving production with every innovation that removed human error from a process. Eventually, at the age of nineteen, he was surprised to be offered a place in Zaun’s prestigious Academy of Techmaturgy. But Viktor’s work had attracted the eye of Professor Stanwick of Piltover, who convinced him to leave Zaun and travel to Piltover’s academy instead. There, he could work in the most advanced laboratories and gain access to all the resources the City of Progress could offer. Thrilled to be singled out, Viktor accepted his offer and took up residence in Piltover, where he refined his craft and sought to perfect his theorems in ways that would benefit everyone.</p><p>Viktor worked with Piltover’s best and brightest; including an insufferable genius named Jayce. The two were equally matched in intellect, but where Viktor was methodical, logical and thorough, Jayce was flamboyant and arrogant. The two worked together frequently, but never truly became friends. Often, the two would butt heads over their perceptions of intuition vs logic in the process of invention, but a level of mutual respect developed as each saw the flawed brilliance in the other.</p><p>In the midst of his studies in Piltover, a major chem-spill devastated entire districts of Zaun, and Viktor returned home to offer his help in the rescue efforts. By grafting a sophisticated series of cognitive loops upon existing automata-technology, he crafted a custom-built golem, Blitzcrank, to help in the clean-up. Blitzcrank was instrumental in saving scores of lives and appeared to develop a level of sentience beyond anything Viktor had envisioned.</p><p>Even with the spill contained, Viktor remained in Zaun to help those afflicted by the released toxins. With the golem’s help, he attempted to use his techmaturgical brilliance to save those whose lives had been blighted by the spill. Their attempt was ultimately unsuccessful in preventing more deaths, and the two parted ways. Though Viktor was distraught at the loss of life in Zaun, the work taught him a great deal about the merging of human anatomy with technology and how mortal anatomy could be enhanced with technology.</p><p>When Viktor returned to Piltover, weeks later, it was to find that Professor Stanwick had held a symposium on Blitzcrank and presented Viktor’s researches as his own. Viktor lodged formal complaints with the masters of the college, but his impassioned claim that he had designed Blitzcrank fell on deaf ears. He turned to Jayce to verify his claims, but his fellow student refused to speak up, further widening the rift between them, and the matter was decided in Professor Stanwick’s favor.</p><p>Bitter, but resigned, Viktor returned to his studies, knowing that his ultimate goal of making people’s lives better and enhancing humanity was more important than one stolen project and a bruised ego. He continued to excel, finding ever new ways to eliminate human error and weakness from his work, a facet of his researches that came to dominate his thinking. He saw human involvement in any part of a process as a grossly inefficient aberration - a view that put him at odds with a great many of his fellow students and professors, who saw the very things Viktor sought to remove as the source of human ingenuity and creativity.</p><p>This came to a head during a reluctant collaboration with Jayce to improve the diving suits used to keep Piltover’s docks clear of underwater debris and lingering chemical waste. Viktor and Jayce’s enhanced suits allowed the wearer to go deeper, remain underwater for longer, and lift heavier weights. But many wearers claimed they saw phantom corpse lights in the depths or suffered from chem-induced hallucinations. When divers experienced such symptoms, they panicked and often got themselves or their fellow divers killed. Viktor saw the problem was not technical, but with the wearer’s nerves unraveling in the inky depths. He devised a chem-shunt helm that allowed an operator on the surface to bypass the wearer’s fear response and, effectively, control the diver. A heated discussion between Viktor and Jayce on free will and mental enslavement turned bitter - almost violent - and the two vowed never to work together again.</p><p>Jayce reported the incident to the college masters, and Viktor was censured for violating basic human dignity - though, in his eyes, his work would have saved many lives. He was expelled from the college, and retreated to his old laboratory in Zaun, disgusted by the narrow-minded perceptions of Piltover’s inhabitants. Alone in the depths, Viktor sank into a deep depression, enduring a traumatic period of introspection for many weeks. He wrestled with the ethical dilemma he now faced, finding that, once again, human emotion and weakness had stood in his way. He had been trying to help, to enhance people beyond their natural capabilities to avoid error and save lives. Revelation came when he realized that he too had succumbed to such emotions, allowing his naive belief that good intentions could overcome ingrained prejudice to blind him to human failings. Viktor knew he could not expect others to follow where he did not go first, so, in secret, he operated on himself to remove those parts of his flesh and psyche that relied upon or were inhibited by emotion.</p><p>When the surgery was done, almost no trace of the young man who had traveled to Piltover remained. He had supplanted the majority of his anatomy with mechanical augmentations, but his personality had also changed. His idealistic hope to better society was refined into an obsession with what he called the Glorious Evolution. Viktor now saw himself as the pioneer of Valoran's future - an idealized dream where man would renounce flesh in favor of superior hextech augmentations. This would free humanity from fatal errors and suffering, though Viktor knew it was a task that would not be completed easily or quickly.</p><p>He threw himself into this great work with a vengeance. He used technological augmentations to help rebuild Zaunites injured in accidents, perfected breathing mechanisms, and worked tirelessly to reduce human inefficiency by decoupling physicality from emotion. His work saved hundreds of lives, yet seeking Viktor’s help could be dangerous, as his solutions often brought unexpected consequences.</p><p>But if you were desperate, Viktor was the man you went to.</p><p>Some in Zaun, hearing fragments of his philosophy and seeing the successes of his work, saw him as a messianic figure. Viktor couldn’t care less for them, viewing their quasi-religious cult as an aberration; yet another reason to eliminate emotional foibles and the belief in that which could not be empirically proven.</p><p>After a toxic event in the Sump saw hundreds of men and women in the Factorywood transformed into rabid psychotics, Viktor was forced to use a powerful soporific to sedate the victims and bring them back to his labs to try and undo the damage. The toxins had begun to eat away portions of their brains, but Viktor was able to slow the degenerative process by opening up their craniums and employing machinery to slowly filter their bloodstreams of poison. The technology available to him wasn’t up to the task, and Viktor knew many people were going to die unless he found a way to greatly enhance his purgative machinery.</p><p>As he fought to save these people, he detected a surge in hextech energy from Piltover and saw immediately that this could give him the power he needed. He followed the powerful energy surge to its source. </p><p>Jayce’s lab.</p><p>Viktor demanded Jayce hand over the source of this power, a pulsing crystal from the Shuriman desert. But his former colleague refused, leaving Viktor no option but to take it by force. He returned to Zaun and hooked the strange crystal to his machinery, readying a steam golem host for each afflicted person in case their body gave out under the stress of the procedure. Empowered by the new crystal, Viktor’s machines went to work and, gradually, the damage from the toxins began to reverse. His work would save these people - in a manner of speaking - and had Viktor retained more than a fragment of his humanity, he might have celebrated. As it was, the barest hint of a smile was all he allowed himself.</p><p>Before the process could complete, a vengeful Jayce burst in and started smashing the laboratory with an energized hammer. Knowing an arrogant fool like Jayce would never listen to reason, Viktor ordered the automatons to kill Jayce. The battle was ferocious, and only ended when Jayce shattered the crystal Viktor had taken, bringing the entire warehouse down in an avalanche of steel and stone, thus ending the existence of those Viktor was trying to save. And for this, Jayce returned to Piltover, feted as a hero.</p><p>Viktor escaped the destruction of the laboratory, and returned to his mission of bettering humanity by ridding it of its destructive emotional impulses. In Viktor’s mind, Jayce’s impetuous attack only proved the truth of his cause and strengthened his desire to unburden humanity of the failings of flesh. Viktor did send chem-augmented thugs to raid Jayce’s laboratory not long afterward. This was - Viktor told himself - not for revenge, but to learn if there were any more shards of the Shuriman crystal he could use for the advancement of mankind. The raid was unsuccessful, however, and Viktor thought no more of Jayce.</p><p>Instead, he intensified his efforts to find ways in which humanity could be shepherded beyond their emotional weaknesses and brought into a new, more reasoned stage of their evolution. Such researches sometimes transgress the boundaries of what would be considered ethical in Piltover (and Zaun), but they are all necessary steps in bringing about Viktor’s Glorious Evolution.</p>", "short": "The herald of a new age of technology, Viktor has devoted his life to the advancement of humankind. An idealist who seeks to lift the people of Zaun to a new level of understanding, he believes that only by embracing a glorious evolution of technology can humanity’s full potential be realized. With a body augmented by steel and science, Viktor is zealous in his pursuit of this bright future.", "quote": "“A mechanized heart never misses a beat, and never falters with emotion. So why would anyone trust their life to a fragile muscle of flesh and blood?”", "quote-author": ""}, "bioImage": null, "headerImage": null}, "related-champions": [{"type": "champion", "release-date": "2009-09-02", "name": "Blitzcrank", "slug": "blitzcrank", "echelon": 0, "associated-faction": "", "associated-faction-slug": "zaun", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Blitzcrank_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 953, "y": 113, "featured-champions": []}, "role": [{"name": "Tank", "slug": "tank"}, {"name": "Fighter", "slug": "fighter"}]}, {"type": "champion", "release-date": "2010-08-24", "name": "Urgot", "slug": "urgot", "echelon": 1, "associated-faction": "", "associated-faction-slug": "zaun", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/urgot-splash-updated.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 686, "y": 40, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Fighter", "slug": "juggernaut"}]}, {"type": "champion", "release-date": "2016-11-28", "name": "Camille", "slug": "camille", "echelon": 2, "associated-faction": "", "associated-faction-slug": "piltover", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/camille_splash.jpg", "encoding": "image/jpeg", "width": 1024, "height": 616, "x": 969, "y": 6, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}]}, {"type": "champion", "release-date": "2012-07-07", "name": "Jayce", "slug": "jayce", "echelon": 3, "associated-faction": "", "associated-faction-slug": "piltover", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Jayce_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1007, "y": 182, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Marksman", "slug": "marksman"}]}, {"type": "champion", "release-date": "2015-05-28", "name": "Ekko", "slug": "ekko", "echelon": 4, "associated-faction": "", "associated-faction-slug": "zaun", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Ekko_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1061, "y": 30, "featured-champions": []}, "role": [{"name": "Assassin", "slug": "assassin"}, {"name": "Fighter", "slug": "fighter"}]}, {"type": "champion", "release-date": "2011-06-01", "name": "Orianna", "slug": "orianna", "echelon": 5, "associated-faction": "", "associated-faction-slug": "piltover", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Orianna_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1080, "y": 0, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Support", "slug": "support"}]}, {"type": "champion", "release-date": "2009-09-02", "name": "Dr. Mundo", "slug": "drmundo", "echelon": 6, "associated-faction": "", "associated-faction-slug": "zaun", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/DrMundo_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 965, "y": 131, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}], "explore-champions": [], "modules": [{"type": "story-preview", "title": "House on Emberflit Alley", "subtitle": null, "description": "<p>Viktor’s third arm emitted a thin ray of light that welded metal into his left arm with steady precision. The smell of burning flesh no longer bothered him, nor did the sight of his left wrist splayed open, veins and sinewy muscle fused with mechanical augments. He did not wince. Instead, he felt a sense of achievement gazing at the seamless blend of synthetic and organic materials.</p>", "story-slug": "viktor-color-story", "featured-image": null, "background": {"type": "image", "title": {"cs_cz": "Magitechnické obchody v zapadlých uličkách", "de_de": "Zwielichtige Hextech-Angebote", "el_gr": "Μαύρη αγορά Μαγοτεχνικών αντικειμένων", "en_au": "Backstreet hextech deals", "en_gb": "Backstreet hextech deals", "en_ph": "Backstreet hextech deals", "en_pl": "Backstreet hextech deals", "en_sg": "Backstreet hextech deals", "en_us": "Backstreet hextech deals", "es_ar": "Tráfico de hextech ilegal", "es_es": "Trapicheo hextech ilegal", "es_mx": "Tráfico de hextech ilegal", "fr_fr": "Trafic d'Hextech dans une ruelle", "hu_hu": "Illegális hextech-ügyletek", "id_id": "Transaksi Ilegal Hextech", "it_it": "Affari hextech sottobanco", "ja_jp": "裏通りのヘクステック取引", "ko_kr": "뒷골목의 마법공학 거래", "ms_my": "Perjanjian hextech backstreet", "pl_pl": "Szemrane hextechowe układy", "pt_br": "Acordos hextec clandestinos", "ro_ro": "Piața neagră de hextech", "ru_ru": "Нелегальные хекстековые сделки.", "th_th": "การซื้อขาย hextech ในมุมมืด", "tr_tr": "Arka sokaklardaki hextech alışverişleri", "vn_vn": "Buôn lậu đồ Hextech", "zh_cn": "后街的海克斯科技交易", "zh_tw": "海克斯後街交易"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/factions/image-gallery/zaun-backstreetdeals.jpg", "encoding": "image/jpeg", "width": 1920, "height": 975, "x": 1376, "y": 753, "featured-champions": []}, "url": "/en_us/story/viktor-color-story", "release-date": "2016-12-02T08:00:00.000Z", "featured-champions": [{"type": "champion", "release-date": "2011-12-29", "name": "Viktor", "slug": "viktor", "echelon": 0, "associated-faction": "", "associated-faction-slug": "zaun", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Viktor_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 908, "y": 23, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}]}], "word-count": 1429, "minutes-to-read": 6}, {"type": "story-preview", "title": "A Quick Fix", "subtitle": null, "description": "<p>Any fool could have predicted that Viktor would strike back at some point. If one weren’t a fool, one might predict the exact date and time of an attempted counterattack.</p>", "story-slug": "jayce-color-story", "featured-image": null, "background": {"type": "image", "title": {"cs_cz": "Ekliptické trezory, nejbezpečnější banka Piltoveru", "de_de": "Die ekliptischen Gewölbe, sicherste Bank in ganz Piltover", "el_gr": "Το Εκλειπτικό Χρηματοφυλάκιο, η πιο ασφαλής τράπεζα του Πιλτόβερ", "en_au": "The Ecliptic Vaults, Piltover’s most secure bank", "en_gb": "The Ecliptic Vaults, Piltover’s most secure bank", "en_ph": "The Ecliptic Vaults, Piltover’s most secure bank", "en_pl": "The Ecliptic Vaults, Piltover’s most secure bank", "en_sg": "The Ecliptic Vaults, Piltover’s most secure bank", "en_us": "The Ecliptic Vaults, Piltover’s most secure bank", "es_ar": "Las Bóvedas Eclípticas, el banco más seguro de Piltóver", "es_es": "Las Criptas Eclípticas, el banco más seguro de Piltover", "es_mx": "Las Bóvedas Eclípticas, el banco más seguro de Piltóver", "fr_fr": "Les Coffres écliptiques, la banque la plus sûre de Piltover", "hu_hu": "Az Ekliptikus Trezor, Piltover legbiztonságosabb bankja", "id_id": "The Ecliptic Vaults, Bank Paling Aman di Piltover", "it_it": "I Forzieri dell'Eclisse, la banca più sicura di Piltover", "ja_jp": "黄道金庫室。ピルトーヴァーでもっとも警備の厳重な金庫室", "ko_kr": "필트오버에서 가장 안전한 은행, 천공의 금고", "ms_my": "Ecliptic Vaults, bank Piltover yang paling selamat", "pl_pl": "Ekliptyczny Skarbiec, najbezpieczniejszy bank w Piltover", "pt_br": "Cofres Eclípticos, o banco mais seguro de Piltover", "ro_ro": "Vistieria Ecliptică, cea mai sigură bancă din Piltover", "ru_ru": "Эклиптическое хранилище, самый защищенный банк Пилтовера.", "th_th": "Ecliptic Vaults ธนาคารที่ปลอดภัยที่สุดของ Piltover", "tr_tr": "PILTOVER'IN en iyi korunan bankası Ekliptik Kasa", "vn_vn": "Kho Hoàng Đạo, ngân hàng an toàn nhất Piltover", "zh_cn": "黄道地库，皮尔特沃夫最安全的银行", "zh_tw": "黃地道窖，皮爾托福守備最嚴密的銀行"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/factions/image-gallery/piltover-eclipticvaults.jpg", "encoding": "image/jpeg", "width": 1920, "height": 1004, "x": 966, "y": 958, "featured-champions": []}, "url": "/en_us/story/jayce-color-story", "release-date": "2016-12-02T08:00:00.000Z", "featured-champions": [{"type": "champion", "release-date": "2012-07-07", "name": "Jayce", "slug": "jayce", "echelon": 0, "associated-faction": "", "associated-faction-slug": "piltover", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Jayce_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1007, "y": 182, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Marksman", "slug": "marksman"}]}], "word-count": 1255, "minutes-to-read": 5}, {"section-title": "", "type": "image-gallery", "isFanArt": false, "fan-art-url": "", "featured-image": "", "title": "", "subtitle": "", "description": "", "assets": [{"type": "image", "title": {"cs_cz": "Raný barevný návrh Viktora", "de_de": "Viktor – Frühes Konzept, koloriert", "el_gr": "Πρώιμο έγχρωμο concept art για τον Βίκτορ", "en_au": "Early Viktor color concept", "en_gb": "Early Viktor color concept", "en_ph": "Early Viktor color concept", "en_pl": "Early Viktor color concept", "en_sg": "Early Viktor color concept", "en_us": "Early Viktor color concept", "es_ar": "Concepto inicial a color de Viktor", "es_es": "Concepto inicial a color de Viktor", "es_mx": "Concepto inicial a color de Viktor", "fr_fr": "Concept préliminaire de Viktor en couleur", "hu_hu": "Viktor korai, színes látványterve", "id_id": "Konsep dan Warna Awal Viktor", "it_it": "Bozzetto iniziale a colori di Viktor", "ja_jp": "ビクター 初期カラーコンセプトアート", "ko_kr": "빅토르 초기 컬러 컨셉 아트", "ms_my": "Konsep awal warna Viktor", "pl_pl": "Viktor — wczesna kolorowa grafika koncepcyjna", "pt_br": "Conceito inicial colorido de Viktor", "ro_ro": "Viktor – concept inițial color", "ru_ru": "Ранний цветной эскиз Виктора", "th_th": "คอนเซปต์เริ่มแรกแบบลงสีของ Viktor", "tr_tr": "Eski VIKTOR renk konsepti", "vn_vn": "Hình mẫu màu ban đầu Viktor", "zh_cn": "早期维克托彩色版概念图", "zh_tw": "維克特 早期色彩概念"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/image-gallery/viktor_turnaround.jpg", "encoding": "image/jpeg", "width": 1920, "height": 708, "x": 29, "y": 13, "featured-champions": []}], "featured-champions": [{"type": "champion", "release-date": "2011-12-29", "name": "Viktor", "slug": "viktor", "echelon": 0, "associated-faction": "", "associated-faction-slug": "zaun", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Viktor_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 908, "y": 23, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}]}]}]}