{"id": "xerath", "name": "Xerath Champion Page", "locale": "en_us", "champion": {"release-date": "2011-10-05", "slug": "xerath", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Xerath_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 701, "y": 23, "featured-champions": []}, "video": null, "associated-faction-slug": "shurima", "roles": [{"name": "Mage", "slug": "mage"}, {"name": "Assassin", "slug": "assassin"}], "name": "Xerath", "title": "the Magus Ascendant", "game-info-url": "http://gameinfo.na.leagueoflegends.com/en/game-info/champions/xerath", "biography": {"full": "<p>Xerath is an Ascended Magus of ancient Shurima, a being of arcane energy writhing in the broken shards of a magical sarcophagus. For millennia, he was trapped beneath the desert sands, but the rise of Shurima freed him from his ancient prison. Driven insane with power, he now seeks to take what he believes is rightfully his and replace the upstart civilizations of the world with one fashioned in his image.</p><p>The boy who would eventually be called Xerath was born a nameless slave in Shurima thousands of years ago. He was the son of captured scholars, with only the prospect of endless servitude ahead. His mother taught him letters and numbers, while his father told him tales from history in the hopes that such skills might allow him a better life. The boy vowed he would not end up bent-backed and whipped like every other slave.</p><p>When the boy’s father was crippled during the excavations for the foundations of a monument to the Emperor’s favorite horse, he was left to die at the site of the accident. Fearing her son would suffer a similar fate, the boy’s mother begged an esteemed tomb architect to take him on as an apprentice. Though at first reluctant, the architect was impressed with the boy’s eye for detail and innate understanding of mathematics and language, and accepted. The boy never saw his mother again.</p><p>He was a swift learner and his master dispatched him on errands to the Great Library of Nasus to retrieve specific texts and plans on an almost daily basis. On one trip, the boy met Azir, the least-favored son of the emperor. Azir was struggling to read a difficult passage in an ancient text, and, despite knowing that to talk to royalty was to invite death, the boy paused to help the young prince with its complex grammar. In that moment, a tentative friendship was established, and over the coming months that friendship only grew stronger.</p><p>Though slaves were forbidden names, Azir gave one to the boy. He named him Xerath, which means ‘one who shares,’ though that name was only ever spoken between the two boys. Azir saw to it that Xerath was appointed to his household’s slaves, and made him his personal attendant. Their shared love of knowledge saw them devour texts from the library and become as close as brothers. Xerath was Azir’s constant companion, learning all he could from this new proximity to culture, power and knowledge, finally daring to dream that Azir might one day free him.</p><p>On the annual tour of the emperor’s dominion, assassins struck the royal caravan as it spent the night at a well-known oasis. Xerath saved Azir from an assassin’s blade, but Azir’s brothers were all slain, leaving the young prince a heartbeat away from Shurima’s throne. As a slave, Xerath could expect no reward for his deed, but Azir promised that one day they would be as brothers. </p><p>In the wake of the assassination attempt, Shurima endured years of horror and fear of the emperor’s retribution. Xerath knew enough of history and the workings of the Shuriman court to understand that Azir’s life hung by the slenderest of threads. That he was heir to the throne meant nothing, for the emperor hated Azir for living while his more beloved sons had died. Of more immediate danger, the emperor’s wife was still young enough to bear other children, and thus far she had borne many healthy sons. The odds were good that she would produce another male heir for her husband, and as soon as she did, Azir’s life was forfeit.</p><p>Though Azir was a scholar at heart, Xerath persuaded him that to survive, he must also learn to fight. This Azir did, and in return the young heir elevated Xerath, insisting he continue his education. Both youths excelled, and Xerath proved to be an exceptionally gifted pupil, one who took to the pursuit of knowledge with gusto. Xerath became Azir’s confidant and right hand man, a position unheard of for a mere slave. This position gave him great - and some said, undue - influence over the young prince, who came to rely on Xerath’s judgement more each day.</p><p>Xerath bent his every effort into seeking out knowledge wherever he could find it, no matter the cost, no matter its source. He unlocked long-sealed libraries, delved into forgotten vaults and consulted with mystics entombed deep beneath the sands; all to further his knowledge and ambition, both of which grew with unchecked rapidity. Whenever the whispers around court that spoke of his delving into unsavory places grew too loud to ignore, he would find cunning means to silence them. That Azir never mentioned these whispers was, to Xerath, tacit approval of how he was keeping his emperor safe. </p><p>Years passed, and Xerath took ever darker steps to keep the emperor’s wife from carrying a child to term, using his nascent magical abilities to corrupt every infant in the womb. Without rivals to the throne, Azir would be safe. When rumors of a curse arose, Xerath ensured they were never spoken again, and oft-times those who had voiced such suspicions vanished without trace. By now, Xerath’s desire to escape his roots as a slave had become a burning ambition to achieve power of his own, though he justified every murderous act by telling himself he was doing it to keep his friend alive.</p><p>Despite Xerath’s best efforts to thwart the queen’s midwives, a new prince of Shurima was brought into the world, but on the night of his birth, Xerath used his growing magical powers to summon the elemental spirits of the deep desert and craft a terrible storm. Xerath brought bolt after bolt of lightning down upon the queen’s chambers, reducing it to burning rubble and killing the queen and her newborn son. The emperor rushed to his queen’s chambers, only to be confronted by Xerath, his hands ablaze with arcane power. The emperor’s guards attacked, but Xerath burned them and the emperor to cindered skeletons. Xerath ensured that the mages of a conquered territory were blamed for these deaths, and Azir’s first act upon taking the throne was to lead a brutal campaign of retribution against its people.</p><p>Azir was crowned emperor of Shurima with Xerath at his side, the boy who had once been a nameless slave. Xerath had long dreamed of this moment, and expected Azir to end slavery in Shurima before finally naming him brother. Azir did none of these things, continuing to expand his empire’s borders and deflecting Xerath’s overtures regarding the end of slavery. To Xerath, this was further proof of Shurima’s moral bankruptcy, and he raged at Azir’s breaking of his promise. Azir’s face was thunderous as he reminded Xerath that he was a slave and should remember his place. Something once noble died in Xerath that day, but he bowed in supplication, outwardly accepting Azir’s decision. As Azir continued his campaigns of conquest, Xerath remained at his side, but his every action was carefully designed to increase his influence over a realm he now planned to take for himself. To steal an empire was no small thing, and Xerath knew he needed more power.</p><p>The famous legend of Renekton’s Ascension revealed that a mortal did not have to be chosen by the Sun Priests, that anyone could rise up. So Xerath plotted to steal the power of Ascension. No slave could ever stand upon the sun disc, so Xerath fed the Emperor’s vanity, inflating his ego and filling his head with impossible visions of a world-spanning empire. But such a dream would only be possible if Azir could Ascend as the greatest heroes of Shurima had before. In time Xerath’s perseverance paid off, and Azir announced he would undertake the Ascension ritual, that he had earned the right to stand alongside Nasus and Renekton as an Ascended being. The Sun Priests protested, but such was Azir’s hubris that he ordered them to comply on pain of torture and death.</p><p>The Day of Ascension arrived and Azir marched toward the Dais of Ascension with Xerath at his side. Nasus and Renekton were absent from the day’s events, for Xerath had arranged a distraction for them by weakening the seal on a magical sarcophagus containing a beast of living fire. When that creature finally broke its bindings, Renekton and Nasus were the only warriors capable of defeating it. Thus Xerath had stripped Azir of the only two beings who might save him from what was to come.</p><p>Azir stood beneath the sun disc and in the final moment before the priests began the ritual, events took a turn Xerath had not anticipated. The emperor turned to Xerath and told him that he was now a free man. He and all Shurima’s slaves were now released from their bonds of servitude. He embraced Xerath before naming him his eternal brother. Xerath was stunned. He had been given everything he desired, but the success of his plans hinged upon Azir’s death and nothing was going to dissuade him from acting. Too many pieces were in motion and Xerath had already sacrificed too much to turn back now – no matter how much that part of him wanted to. The emperor’s words pierced the bitterness enclosing Xerath’s heart, but came decades too late. Unaware of his peril, Azir turned as the priests began the ritual and brought down the awesome power of the sun.</p><p>With a roar of anger and grief combined, Xerath blasted Azir from his place on the dais, watching through tears as his former friend burned to ash. Xerath took Azir’s place and the light of the sun filled him, reshaping his flesh into that of an Ascended being. But the power of the ritual was not his to take, and the consequences of his betrayal of Azir were devastating. The unbound power of the sun all but destroyed Shurima, sundering its temples and bringing ruination upon the city. Azir’s people were consumed in a terrifying conflagration as the desert rose up to claim the city. The sun disc fell and an empire built by generations of emperors was undone in a single day.</p><p>Even as the city burned, Xerath held the sun priests in the grip of his magic, preventing them from ending the ritual. The energies filling him were immense, alloying with his dark sorcery to create a being of incredible power. As he drew ever more of the sun’s power into his body, his mortal flesh was consumed and remade as a glowing vortex of arcane power.</p><p>With Xerath’s treachery revealed, Renekton and Nasus rushed to the epicenter of the magical storm destroying the city. They bore with them the magical sarcophagus that had imprisoned the spirit of eternal fire. The Ascended brothers fought their way to the Dais of Ascension just as Xerath fell from the deadly radiance engulfing the city. Before the newly-Ascended Magus could react, they hurled his crackling body within the sarcophagus and sealed it once more with blessed chains and powerful sigils of binding.</p><p>But it was not enough. Xerath’s power had been great as a mortal, and that power - combined with the gift of Ascension - made him all but invincible. He shattered the sarcophagus, though its shards and chains remained bound to him. Renekton and Nasus hurled themselves at Xerath, but such was his newfound strength that he fought them both to a standstill. The battle raged throughout the collapsing city, destroying what had not already sunk beneath the sands. The brothers were able to drag Xerath toward the Tomb of Emperors, the greatest mausoleum of Shurima, a vault whose locks and wards were impossible to break and which answered only to the blood of emperors. Renekton wrestled Xerath within and called upon Nasus to seal the vault behind them. Nasus did so with heavy heart, knowing it was the only way to prevent Xerath’s escape. Renekton and Xerath fell into eternal darkness, and there they remained, locked in an endless battle as the once-great civilization of Shurima collapsed.</p><p>Uncounted centuries passed and, in time, even Renekton’s mighty strength waned, leaving him vulnerable to Xerath’s influence. With poisoned lies and illusions, Xerath twisted Renekton’s mind, filling him with misplaced bitterness toward Nasus, the faithless brother who had - in Xerath’s fictive narrative - abandoned him so long ago.</p><p>When the Tomb of Emperors was finally discovered beneath the desert and broken open by Sivir and Cassiopeia, both Xerath and Renekton were freed in an explosion of sand and rubble. Sensing his brother still lived, Renekton charged from the ruins, his distorted mind leaving him little better than a savage beast. After an age lost to legend, Shurima was reborn, and as it rose majestically from the desert, Xerath felt another soul return to life beneath the sand, one he had thought long dead. Azir was also newly resurrected as one of the Ascended, and Xerath knew there could be no peace for either of them while the other yet lived.</p><p>Xerath sought the heart of the desert to regain his strength and understand how the world had changed in the millennia since his imprisonment. His stolen power grew with every passing moment, and he beheld a world ripe for conquest, a world brimming with mortals ready to worship at the feet of a new and terrible god. </p><p>Yet for all his newfound power, however far he has come from that nameless slave boy, a part of Xerath knows he is still in chains.</p>", "short": "Xerath is an Ascended Magus of ancient Shurima, a being of arcane energy writhing in the broken shards of a magical sarcophagus. For millennia, he was trapped beneath the desert sands, but the rise of Shurima freed him from his ancient prison. Driven insane with power, he now seeks to take what he believes is rightfully his and replace the upstart civilizations of the world with one fashioned in his image.", "quote": "“A lifetime as a slave has prepared me for eternity as your master.”", "quote-author": ""}, "bioImage": null, "headerImage": null}, "related-champions": [{"type": "champion", "release-date": "2011-01-18", "name": "Renekton", "slug": "renekton", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Renekton_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 801, "y": 6, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}, {"type": "champion", "release-date": "2010-12-14", "name": "Cassiopeia", "slug": "cassiopeia", "echelon": 1, "associated-faction": "", "associated-faction-slug": "noxus", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Cassiopeia_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 847, "y": 55, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}]}, {"type": "champion", "release-date": "2009-10-01", "name": "Nasus", "slug": "nasus", "echelon": 2, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Nasus_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 889, "y": 40, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}, {"type": "champion", "release-date": "2014-09-16", "name": "Azir", "slug": "azir", "echelon": 3, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Azir_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1026, "y": 96, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Marksman", "slug": "marksman"}]}, {"type": "champion", "release-date": "2009-02-21", "name": "Sivir", "slug": "sivir", "echelon": 4, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Sivir_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 774, "y": 145, "featured-champions": []}, "role": [{"name": "Marksman", "slug": "marksman"}]}, {"type": "champion", "release-date": "2016-05-18", "name": "Taliyah", "slug": "taliyah", "echelon": 5, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Taliyah_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1063, "y": 0, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Support", "slug": "support"}]}, {"type": "champion", "release-date": "2011-04-12", "name": "Brand", "slug": "brand", "echelon": 6, "associated-faction": "", "associated-faction-slug": "unaffiliated", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Brand_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1074, "y": 50, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}]}], "explore-champions": [], "modules": [{"type": "story-preview", "title": "Unbound", "subtitle": null, "description": "<p>This was the moment.</p>", "story-slug": "xerath-color-story", "featured-image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Xerath_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 701, "y": 23, "featured-champions": []}, "background": {"type": "image", "title": {"cs_cz": "Písek mizí, Shurima se znovu zrodila.", "de_de": "Die Sande ziehen sich zurück und Shurima wird wiedergeboren.", "el_gr": "Η άμμος υποχωρεί και η Σουρίμα ανατέλλει ξανά", "en_au": "The sands recede, and Shurima is reborn.", "en_gb": "The sands recede, and Shurima is reborn.", "en_ph": "The sands recede, and Shurima is reborn.", "en_pl": "The sands recede, and Shurima is reborn.", "en_sg": "The sands recede, and Shurima is reborn.", "en_us": "The sands recede, and Shurima is reborn.", "es_ar": "Las arenas retroceden y Shurima renace.", "es_es": "Las arenas retroceden y Shurima renace.", "es_mx": "Las arenas retroceden y Shurima renace.", "fr_fr": "Les sables reculent et Shurima revient à la vie.", "hu_hu": "A homok visszahúzódik, Shurima újjászületik.", "id_id": "Debu pasir ini telah surut, dan Shurima telah kembali bangkit.", "it_it": "Le sabbie si ritirano e Shurima rinasce", "ja_jp": "砂が引き、シュリーマが復活した。", "ko_kr": "모래가 흩어지면서 다시 모습을 드러내는 슈리마", "ms_my": "Pasir semakin surut, dan Shurima dilahirkan semula.", "pl_pl": "Piaski zniknęły, a Shurima się odrodziła", "pt_br": "A areia recua, e Shurima renasce.", "ro_ro": "Nisipurile se retrag și Shurima renaște", "ru_ru": "Пески отступают, Шурима возрождается.", "th_th": "ทรายถดถอยไป และ Shurima ก็เกิดใหม่อีกครั้ง", "tr_tr": "Kumlar geri çekiliyor ve SHURIMA yeniden doğuyor.", "vn_vn": "Shurima tái sinh", "zh_cn": "沙粒退去，而恕瑞玛重生了。", "zh_tw": "沙流退去，蘇瑞瑪隨之重生"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/factions/image-gallery/shurima-reborn.jpg", "encoding": "image/jpeg", "width": 1920, "height": 995, "x": 974, "y": 0, "featured-champions": []}, "url": "/en_us/story/xerath-color-story", "release-date": "2016-05-06T08:00:00.000Z", "featured-champions": [{"type": "champion", "release-date": "2011-10-05", "name": "Xerath", "slug": "xerath", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Xerath_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 701, "y": 23, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Assassin", "slug": "assassin"}]}], "word-count": 772, "minutes-to-read": 3}, {"type": "story-preview", "title": "Bloodline", "subtitle": "by Graham McNeill", "description": "<p>Taliyah had almost forgotten how much she’d missed the furnace heat of Shurima – the sweat and crush of hundreds of people pushing, cursing, haggling and speaking with such passion and speed that outsiders often thought they were fighting.</p>", "story-slug": "rg-shurima-story", "featured-image": null, "background": {"type": "image", "title": {"cs_cz": "Znovu vztyčený sluneční kotouč nad ulicemi Nashramae", "de_de": "Die nachgebaute Sonnenscheibe über den Straßen von Nashramae", "el_gr": "Ο ηλιακός δίσκος δεσπόζει ξανά στους δρόμους της Νασραμαέ", "en_au": "The rebuilt sun disc over the streets of Nashramae", "en_gb": "The rebuilt sun disc over the streets of Nashramae", "en_ph": "The rebuilt sun disc over the streets of Nashramae", "en_pl": "The rebuilt sun disc over the streets of Nashramae", "en_sg": "The rebuilt sun disc over the streets of Nashramae", "en_us": "The rebuilt sun disc over the streets of Nashramae", "es_ar": "El disco solar reconstruido sobre las calles de Nashramae", "es_es": "El disco solar reconstruido sobre las calles de Nashramae", "es_mx": "El disco solar reconstruido sobre las calles de Nashramae", "fr_fr": "Le Disque solaire reconstruit surplombe les rues de Nashramae", "hu_hu": "Az újjáépített napkorong Nashramé utcái fölé magasodik.", "id_id": "Sun Disc yang dibuat lagi di jalanan Nashramae", "it_it": "Il disco solare ricostruito sopra le strade di Vekaura", "ja_jp": "ベカウラの上空にある再建された太陽の円盤", "ko_kr": "나시라미 거리에 다시 세워진 태양 원판", "ms_my": "Cakera matahari yang dibina semula di atas jalan raya Nashramae", "pl_pl": "Odbudowany słoneczny dysk ponad ulicami Nashramae", "pt_br": "O disco solar reconstruído mas ruas de Nashramae", "ro_ro": "Discul soarelui, reconstruit deasupra străzilor din Nashramae", "ru_ru": "Восстановленный солнечный диск нависает над улицами Нашраме.", "th_th": "Sun Disc ที่ถูกสร้างขึ้นมาใหม่อยู่เหนือถนน Nashramae", "tr_tr": "Nashramae sokakları üzerinde yeniden yükselen Güneş Kursu", "vn_vn": "Đĩa Mặt Trời được dựng lại  ở Nashramae", "zh_cn": "重建后的太阳圆盘悬在纳施拉美的街道之上", "zh_tw": "位於娜敘亞麥上方重建的烈日之輪"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/factions/image-gallery/shurima-vekaurastreets.jpg", "encoding": "image/jpeg", "width": 1920, "height": 887, "x": 1049, "y": 763, "featured-champions": []}, "word-count": 9630, "minutes-to-read": 36, "featured-champions": [{"type": "champion", "release-date": "2016-05-18", "name": "Taliyah", "slug": "taliyah", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Taliyah_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1063, "y": 0, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Support", "slug": "support"}]}, {"type": "champion", "release-date": "2009-10-01", "name": "Nasus", "slug": "nasus", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Nasus_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 889, "y": 40, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}, {"type": "champion", "release-date": "2011-10-05", "name": "Xerath", "slug": "xerath", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Xerath_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 701, "y": 23, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Assassin", "slug": "assassin"}]}, {"type": "champion", "release-date": "2011-01-18", "name": "Renekton", "slug": "renekton", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Renekton_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 801, "y": 6, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}], "release-date": "2016-05-12T08:00:00.000Z", "url": "/en_us/story/rg-shurima-story"}, {"section-title": "", "type": "image-gallery", "isFanArt": false, "fan-art-url": "", "featured-image": "", "title": "", "subtitle": "", "description": "", "assets": [{"type": "image", "title": {"cs_cz": "Grafický návrh Xeratha", "de_de": "Xerath – Konzept", "el_gr": "Concept art για τον Ζέραθ", "en_au": "Xerath concept", "en_gb": "Xerath concept", "en_ph": "Xerath concept", "en_pl": "Xerath concept", "en_sg": "Xerath concept", "en_us": "Xerath concept", "es_ar": "Concepto de Xerath", "es_es": "Concepto de Xerath", "es_mx": "Concepto de Xerath", "fr_fr": "Concept de Xerath", "hu_hu": "Xerath látványterve", "id_id": "Konsep Xerath", "it_it": "Bozzetto di Xerath", "ja_jp": "ゼラス コンセプトアート", "ko_kr": "제라스 컨셉 아트", "ms_my": "Konsep Xerath", "pl_pl": "Xerath — grafika koncepcyjna", "pt_br": "Conceito de Xerath", "ro_ro": "Xerath – concept", "ru_ru": "Эскиз Зерата", "th_th": "คอนเซปต์ของ Xerath", "tr_tr": "Xerath konsepti", "vn_vn": "Hình mẫu Xerath", "zh_cn": "泽拉斯概念图", "zh_tw": "齊勒斯 設計概念"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/image-gallery/xerath_concept.jpg", "encoding": "image/jpeg", "width": 1046, "height": 1080, "x": 0, "y": 169, "featured-champions": []}, {"type": "image", "title": {"cs_cz": "Barevný grafický návrh Xeratha", "de_de": "Xerath – Koloriertes Konzept", "el_gr": "έγχρωμο concept art για τον Ζέραθ", "en_au": "Xerath color concept", "en_gb": "Xerath color concept", "en_ph": "Xerath color concept", "en_pl": "Xerath color concept", "en_sg": "Xerath color concept", "en_us": "Xerath color concept", "es_ar": "Concepto a color de Xerath", "es_es": "Concepto a color de Xerath", "es_mx": "Concepto a color de Xerath", "fr_fr": "Concept de Xerath en couleur", "hu_hu": "Xerath színes látványterve", "id_id": "Konsep Warna Xerath", "it_it": "Bozzetto a colori di Xerath", "ja_jp": "ゼラス カラーコンセプトアート", "ko_kr": "제라스 컬러 컨셉 아트", "ms_my": "Konsep warna Xerath", "pl_pl": "Xerath — kolorowa grafika koncepcyjna", "pt_br": "Conceito em cores de Xerath", "ro_ro": "Xerath – concept color", "ru_ru": "Цветной эскиз Зерата", "th_th": "คอนเซปต์สีของ Xerath", "tr_tr": "Xerath renk konsepti", "vn_vn": "Hình mẫu màu Xerath", "zh_cn": "泽拉斯彩色版概念图", "zh_tw": "齊勒斯 色彩概念"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/image-gallery/xerath_color.jpg", "encoding": "image/jpeg", "width": 838, "height": 1080, "x": 398, "y": 82, "featured-champions": []}, {"type": "image", "title": {"cs_cz": "Xerath v akci", "de_de": "Xerath in Aktion", "el_gr": "Ο Ζέραθ σε δράση", "en_au": "Xerath in action", "en_gb": "Xerath in action", "en_ph": "Xerath in action", "en_pl": "Xerath in action", "en_sg": "Xerath in action", "en_us": "Xerath in action", "es_ar": "Xerath en acción", "es_es": "Xerath activo", "es_mx": "Xerath en acción", "fr_fr": "Xerath en action", "hu_hu": "Xerath akcióban", "id_id": "Aksi Xerath", "it_it": "Xerath in azione", "ja_jp": "ゼラス アクション", "ko_kr": "제라스 모션", "ms_my": "Xerath dalam aksi", "pl_pl": "Xerath w akcji — grafika koncepcyjna", "pt_br": "Xerath em ação", "ro_ro": "Xerath în acțiune", "ru_ru": "Зерат в бою", "th_th": "Xerath ออกโรง", "tr_tr": "Hareketli Xerath", "vn_vn": "Xerath đang hành động", "zh_cn": "泽拉斯在行动中", "zh_tw": "齊勒斯 動作中"}, "subtitle": "", "description": {}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/image-gallery/xerath_mockup.jpg", "encoding": "image/jpeg", "width": 1920, "height": 760, "x": 765, "y": 72, "featured-champions": []}], "featured-champions": [{"type": "champion", "release-date": "2011-10-05", "name": "Xerath", "slug": "xerath", "echelon": 0, "associated-faction": "", "associated-faction-slug": "shurima", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Xerath_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 701, "y": 23, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}, {"name": "Assassin", "slug": "assassin"}]}]}]}