{"id": "xinzhao", "name": "XinZhao Champion Page", "locale": "en_us", "champion": {"release-date": "2010-07-13", "slug": "xinzhao", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/xinzhao-splash-updated.jpg", "encoding": "image/jpeg", "width": 1920, "height": 1133, "x": 1024, "y": 309, "featured-champions": []}, "video": null, "associated-faction-slug": "demacia", "roles": [{"name": "Fighter", "slug": "fighter"}, {"name": "Assassin", "slug": "assassin"}], "name": "Xin Zhao", "title": "the Seneschal of Demacia", "game-info-url": "http://gameinfo.na.leagueoflegends.com/en/game-info/champions/XinZhao", "biography": {"full": "<p>Rumored to have never lost in one-on-one combat, Xin Zhao spent much of his life fighting an uphill battle. Some of his earliest memories are of the <i>Viscero</i>, an Ionian fishing boat he served aboard off the coast of Raikkon. A diligent cabin boy, he obeyed his elders’ every request—from cleaning grimy decks to fixing tangled nets—and enjoyed a peaceful existence… until the day they unknowingly ventured too deep into foreign waters.</p><p>A pair of privateer ships from Noxus chased down the smaller vessel. Their commander cited the glory of the empire as he boarded, claiming the <i>Viscero</i> and its crew as his rightful property. They were mostly ageing fishermen, unfit for military service, but they would be taken back to Noxian territory regardless.</p><p>After enduring a tough journey across the open ocean, Xin Zhao found himself in a strange new land. There was no delicate beauty in the waters here, no magic in the trees. Imposing gateways and fortified stone walls unlike anything he had ever seen lined the streets, and the people were crammed into every available inch of space. He learned this was the capital of Noxus, and it was from here that a man known as “Darkwill” ruled the vast empire. Separated from the rest of the <i>Viscero</i>’s crew, and with no means of returning home, Xin Zhao entered the service of the man who had taken him prisoner.</p><p>His skill with a spear did not go unnoticed, and soon he was promised a better life—with meals served on plates—in exchange for his martial prowess. Noxus celebrated strength, and his patron deemed him to be a strong fighter.</p><p>Having nothing to lose, the young man accepted. He shed his ragged clothes for crude armor, and entered the Reckoning arenas.</p><p>Truly, this was a strange form of entertainment. Mighty warriors, known by even mightier titles, fought each other before ravenous crowds, who cheered for displays of skill and showmanship as often as they did for blood. Xin Zhao, taking the name “Viscero”, was catapulted into success. His bouts soon filled the seats of every arena… and also the pockets of his sponsors. In only a few short years, Viscero became a celebrated name—one that audiences adored, and other Reckoners came to fear.</p><p>But this good fortune did not last.</p><p>Beyond the distractions of the Reckoner circuit, the empire faced difficult times. Hostile nations encroached upon its territories, provoking rebellion all along the Noxian frontier. It was rumored that Darkwill and his advisors had offered a fortune in gold for the private release of mercenaries, prisoners, and Reckoners alike, to be conscripted into the empire’s warhosts. With little more than a handshake, Xin Zhao and his fellows were bought out, and placed on a transport ship heading west.</p><p>Here, at the coastal fortress of Kalstead, the names and reputations of even the most well-known Reckoners counted for little. They were hurled into battle against the elite forces of King Jarvan III of Demacia, who was determined to curb Noxian influence on Valoran… and Xin Zhao quickly learned that war was unlike any arena duel.</p><p>While many of the former Reckoners deserted in the face of inevitable defeat, Xin Zhao held his ground, staining his spear with the blood of hundreds. When the king’s Dauntless Vanguard—some of whom were silently impressed by his skill—finally surrounded him, still he refused to run. Xin Zhao stood tall, welcoming his execution.</p><p>However, Jarvan thought differently. Unlike the arena crowds, the king of Demacia took no pleasure in needless killing. He granted the defeated Noxians their freedom, if they would swear to leave Kalstead in peace. Surprised by this show of mercy, Xin Zhao thought about what awaited him back in Noxus. He could return to a society where his life had meant little beyond the gold he earned for his patrons… or he could fight for those who embodied the virtues to which he, himself, aspired.</p><p>Compelled by honor, he knelt before Jarvan III, pledging himself to the king’s service.</p><p>In the decades that followed, Xin Zhao proved his loyalty time and again. As a seneschal of the royal household, he became bodyguard and advisor not only to his friend and master, but also to the king’s son—young Prince Jarvan, who would one day inherit the crown. Xin Zhao’s path to becoming a Demacian may have been unusual, yet never once did he falter in his commitment to the kingdom and its ideals. This was not from a sense of duty, he reasoned, but by choice.</p><p>However, his greatest test came when a mage insurrection threatened the capital. With the nefarious Sylas of Dregbourne wreaking havoc throughout the Great City, Xin Zhao stood ready to defend his liege, but the king commanded him to leave on a personal mission of critical importance. With a heavy heart, Xin Zhao reluctantly obeyed.</p><p>It was only when the palace bells tolled that he knew the true gravity of his mistake. By the time the seneschal fought his way back, King Jarvan III was dead.</p><p>Xin Zhao believed his life would be forfeit… but instead, Prince Jarvan reminded him of the pledge he had once made, and accepted a renewal of his service to the kingdom.</p><p>For now, more than ever, Demacia <i>needs</i> its seneschal. The throne lies vacant, as the other noble houses fear that the prince may not yet be fit to rule. Xin Zhao has no such concerns—he is utterly devoted to Jarvan, and determined to guide him in the perilous days to come.</p>", "short": "Xin Zhao is a resolute warrior loyal to the royal family of Demacia. Once condemned to the fighting pits of Noxus, he survived countless gladiatorial bouts. It was not until he faced the forces of King Jarvan III in battle that he decided to relinquish his past life, in favor of serving what he saw as a more honorable cause. Armed with his favored three-talon spear, Xin Zhao now fights for his adopted kingdom, audaciously challenging any foe, no matter the odds.", "quote": "“Death is inevitable. One can only avoid defeat.”", "quote-author": ""}, "bioImage": null, "headerImage": null}, "related-champions": [{"type": "champion", "release-date": "2009-02-21", "name": "Alistar", "slug": "alistar", "echelon": 0, "associated-faction": "", "associated-faction-slug": "unaffiliated", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Alistar_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 791, "y": 139, "featured-champions": []}, "role": [{"name": "Tank", "slug": "tank"}, {"name": "Support", "slug": "support"}]}, {"type": "champion", "release-date": "2011-03-01", "name": "Jarvan IV", "slug": "jarvaniv", "echelon": 1, "associated-faction": "", "associated-faction-slug": "demacia", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/JarvanIV_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1011, "y": 35, "featured-champions": []}, "role": [{"name": "Tank", "slug": "tank"}, {"name": "Fighter", "slug": "fighter"}]}, {"type": "champion", "release-date": "2010-04-27", "name": "Garen", "slug": "garen", "echelon": 2, "associated-faction": "", "associated-faction-slug": "demacia", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Garen_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 1137, "y": 141, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}, {"type": "champion", "release-date": "2011-11-01", "name": "Shyvana", "slug": "shyvana", "echelon": 3, "associated-faction": "", "associated-faction-slug": "demacia", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Shyvana_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 951, "y": 0, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}], "explore-champions": [], "modules": [{"type": "story-preview", "title": "Aftermath", "subtitle": "By Anthony Reynolds", "description": "<p>The first rays of dawn brushed the rooftops of the Great City, turning pale stone to gold. The air was still, and the only sounds filtering up to the high garden terraces on the east side of the citadel were the gentle chorus of morning birds and the hushed murmur of the waking city below.</p>", "story-slug": "xinzhao-aftermath-story", "featured-image": null, "background": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/aftermath_t.jpg", "encoding": "image/jpeg", "width": "", "height": "", "x": "", "y": "", "featured-champions": []}, "word-count": 4791, "minutes-to-read": 18, "featured-champions": [{"type": "champion", "release-date": "2010-07-13", "name": "Xin Zhao", "slug": "xinzhao", "echelon": 0, "associated-faction": "", "associated-faction-slug": "demacia", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/xinzhao-splash-updated.jpg", "encoding": "image/jpeg", "width": 1920, "height": 1133, "x": 1024, "y": 309, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Assassin", "slug": "assassin"}]}], "release-date": "2019-08-14T08:00:00.000Z", "url": "/en_us/story/xinzhao-aftermath-story"}, {"type": "story-preview", "title": "What Once Sailed Free", "subtitle": "by Michael Luo", "description": "<p>The prisoner stands tall, his ankles chained to a wooden post, his wrists bound together with coarse rope. Blood trickles down his cheeks onto his black Noxian tunic, leaving small red puddles by his bare toes. Above him, the sky paints patches of gray against blue, unsure of its true colors. </p>", "story-slug": "whatoncesailedfree", "featured-image": null, "background": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/What_Once_Sailed_Free.jpg", "encoding": "image/jpeg", "width": "", "height": "", "x": "", "y": "", "featured-champions": []}, "word-count": 4156, "minutes-to-read": 16, "featured-champions": [{"type": "champion", "release-date": "2010-07-13", "name": "Xin Zhao", "slug": "xinzhao", "echelon": 0, "associated-faction": "", "associated-faction-slug": "demacia", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/xinzhao-splash-updated.jpg", "encoding": "image/jpeg", "width": 1920, "height": 1133, "x": 1024, "y": 309, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Assassin", "slug": "assassin"}]}], "release-date": "2019-03-19T08:00:00.000Z", "url": "/en_us/story/whatoncesailedfree"}]}