{"id": "zilean", "name": "Zilean Champion Page", "locale": "en_us", "champion": {"release-date": "2009-04-18", "slug": "zilean", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Zilean_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 746, "y": 7, "featured-champions": []}, "video": null, "associated-faction-slug": "unaffiliated", "roles": [{"name": "Support", "slug": "support"}, {"name": "Mage", "slug": "mage"}], "name": "Zilean", "title": "the Chronokeeper", "game-info-url": "http://gameinfo.na.leagueoflegends.com/en/game-info/champions/zilean", "biography": {"full": "<p>Icathia, most desolate and cursed of lands, was not always so. Theirs was a rich and diverse civilization, ruled by benevolent Axamuk, last of the Mage Kings of old. As the Shuriman empire expanded across the continent, Axamuk’s calls for peaceful coexistence were ignored, and his armies destroyed by the god-warriors of the Ascended Host.</p><p>Though humbled by this defeat, many Icathians saw an opportunity for mutual advancement. Accepting an offer of autonomous satrapy, they installed a governing council of distinguished mages, philosophers, and lawmakers to oversee the transition of power.</p><p>After almost nine centuries of imperial rule, a young man named Zilean joined the council’s ranks. He was an elemental mage with a prodigious understanding of physical reality, who had studied under the greatest minds of the age—from the great Yun of Ixtal, to the astromancers of Faraj, and countless others besides.</p><p>There was one component of the material realm that few had ever truly grasped, but Zilean was determined to master.</p><p><i>Time.</i></p><p>Time was the one inescapable constant, in all things. Even the mighty god-warriors were not immune to its passage… though they were revered above all others in Shuriman culture.</p><p>As part of the political establishment, Zilean now saw more clearly the smoldering discontent among the citizens of Icathia. While their land was home to some of the most heroic leaders and revolutionary thinkers in the empire, not one had ever been deemed worthy of Ascension. Again and again, the council submitted petitions to the distant emperor, yet access to the Sun Disc was denied, without explanation. For all they gave, it seemed Icathians would never be seen as equals.</p><p>Zilean’s own resentment grew, yet he was worried by open talk of secession among his peers. He was a patriot through and through, but in the face of the Ascended Host, any rebellion could only end in calamity for his people. Seeking a diplomatic solution, he went as an envoy to neighboring Kahleek, Kalduga, and Ixtal. He had made many allies in his lifetime, and he implored them to stand with Icathia.</p><p>Each time, the answer was the same. They would not defy Shurima. If Zilean’s people wanted to, they would do so alone.</p><p>Returning home, he was shocked to find the council had decided to crown a new Mage King. Breathlessly, joyously, they told Zilean of the ancient and forbidden power they had discovered—a power so great, it would all but guarantee Icathia’s victory. </p><p>They told Zilean of the power of the Void.</p><p>He looked to these reasoned, wise Icathians, but saw only madness in their eyes. As much as it grieved him, Zilean would rather his homeland’s revolution be crushed, than to let this abomination be set loose.</p><p>Zilean’s worst fears proved true. Once unleashed in battle, the Void overwhelmed the mages attempting to control it, and Icathia was doomed.</p><p>As he tried to escape the capital, the ground shook. Buildings toppled. Such horrors as had no place in this world or the next erupted from the depths, driving terrified citizens before them.</p><p>They were trapped. Hundreds of thousands of innocents would die. In desperation, Zilean urged as many as he could to take refuge in his tower, and did the impossible.</p><p>He removed the entire structure from time.</p><p>Crashing to the cold floor, his power spent, Zilean looked at the frozen figures all around him. The Void was halted, but only within those walls—outside, where Icathia once stood, there was nothing.</p><p>Zilean had spent decades trying to comprehend the mysteries of time and causality, and it seemed only he could move freely back and forth within the anomaly he had somehow created. These people had been saved, true enough. He just didn’t know how to undo what he had done to achieve it. Through deep meditations and esoteric devices of his own design, he began to divine the strands of past and present that led to this moment, gradually learning how to move back and forth along them, looking for a future where his efforts had already succeeded…</p><p>It was there that he found the true threat: the end of <i>everything</i>. The great unmaking that awaits Runeterra.</p><p>Effectively, Zilean now exists everywhere, and always has. Even so, he is only too aware of the consequences of trying to bring about change in the world and sparking other unexpected destinies—often conflicting, and almost always more dangerous. Perhaps if he can find a way to save his own people, then the greater disaster might also be averted.</p><p>The only question is, what might he be willing to sacrifice along the way?</p>", "short": "Once a member of Icathia’s governing council, Zilean is a prodigious elemental mage who seeks mastery over time itself. After using his powers in an attempt to save his people from the Void, he now drifts through the past, present, and future, bending and warping the flow of time around him. Zilean has traveled from Runeterra’s mysterious creation, all the way to its seemingly inevitable ending, searching tirelessly for any strand of fate that might undo his homeland’s destruction.", "quote": "“There is no greater grief than for a loss that is yet to come.”", "quote-author": ""}, "bioImage": null, "headerImage": null}, "related-champions": [{"type": "champion", "release-date": "2013-06-13T19:43:26Z", "name": "Aatrox", "slug": "aatrox", "echelon": 0, "associated-faction": "", "associated-faction-slug": "unaffiliated", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/aatrox-splash.jpg", "encoding": "image/jpeg", "width": 1920, "height": 1080, "x": 1351, "y": 346, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Tank", "slug": "tank"}]}, {"type": "champion", "release-date": "2009-02-21", "name": "Jax", "slug": "jax", "echelon": 1, "associated-faction": "", "associated-faction-slug": "unaffiliated", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Jax_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 949, "y": 35, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Assassin", "slug": "assassin"}]}, {"type": "champion", "release-date": "2014-02-27", "name": "Vel'Koz", "slug": "velkoz", "echelon": 2, "associated-faction": "", "associated-faction-slug": "void", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Velkoz_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 759, "y": 227, "featured-champions": []}, "role": [{"name": "Mage", "slug": "mage"}]}], "explore-champions": [], "modules": [{"type": "story-preview", "title": "Where Icathia Once Stood", "subtitle": "by Graham McNeill", "description": "<p><i>My name is Axamuk Var-Choi Kohari Icath’or.</i></p>", "story-slug": "where-icathia-once-stood", "featured-image": null, "background": {"type": "image", "title": {"cs_cz": "Pád Ikacie", "de_de": "Icathias Fall", "el_gr": "Η Πτώση της Ικάθια", "en_au": "The Fall of Icathia", "en_gb": "The Fall of Icathia", "en_ph": "The Fall of Icathia", "en_pl": "The Fall of Icathia", "en_sg": "The Fall of Icathia", "en_us": "The Fall of Icathia", "es_ar": "La caída de Icathia", "es_es": "La caída de Icathia", "es_mx": "La caída de Icathia", "fr_fr": "La chute d'Icathia", "hu_hu": "Ikáthia bukása", "id_id": "Kejatuhan Icathia", "it_it": "La caduta di Icathia", "ja_jp": "イカシアの荒廃", "ko_kr": "이케시아 함락", "ms_my": "The Fall of Icathia", "pl_pl": "Upadek Icathii", "pt_br": "A Queda de Icathia", "ro_ro": "Căderea Icathiei", "ru_ru": "Падение Икатии", "th_th": "การล่มสลายของ Icathia", "tr_tr": "ICATHIA'NIN DÜŞÜŞÜ", "vn_vn": "Icathia Sụp Đổ", "zh_cn": "艾卡西亚的陨落", "zh_tw": "伊卡西亞的殞落"}, "subtitle": "", "description": {"cs_cz": "Před hradbami prastaré Ikacie došlo k velké a strašlivé bitvě proti Prázdnotě. Z území kolem zatraceného města se kvůli tomu staly opuštěné pustiny a jeho samotná existence byla vyškrtnuta ze shurimských map. Lidé doufali, třebaže bláhově, že se na zde rozpoutané hrůzy nakonec zapomene...", "de_de": "Vor den Toren des alten Icathia wurde eine große und schreckliche Schlacht gegen die Leere geführt. Als sie vorüber war, verwandelte sich der Boden rund um die verdammte Stadt in Ödland und wurde daraufhin restlos von den Karten Shurimas getilgt. Die Leute hofften, vielleicht aus Torheit, dass die Schrecken, die dort entfesselt worden waren, letztlich einfach vergessen werden würden ...", "el_gr": "Κάτω από τα τείχη της αρχαίας Ικάθια δόθηκε μια τεράστια και τρομερή μάχη ενάντια στις δυνάμεις του Κενού. Η σύγκρουση ερήμωσε τις εκτάσεις γύρω από την καταδικασμένη πόλη, η οποία εξαλείφθηκε από τον χάρτη της Σουρίμα. Ο κόσμος πίστεψε, ίσως αφελώς, ότι η φρίκη που κατάπιε την Ικάθια δεν θα επέστρεφε ποτέ ξανά…", "en_au": "A great and terrible battle was fought against the Void before the walls of ancient Icathia. In the aftermath, the lands all around the damned city became deserted wastes, and its very existence was struck from the maps of Shurima. It was hoped, perhaps foolishly, that the horrors unleashed there would eventually be forgotten…", "en_gb": "A great and terrible battle was fought against the Void before the walls of ancient Icathia. In the aftermath, the lands all around the damned city became deserted wastes, and its very existence was struck from the maps of Shurima. It was hoped, perhaps foolishly, that the horrors unleashed there would eventually be forgotten…", "en_ph": "A great and terrible battle was fought against the Void before the walls of ancient Icathia. In the aftermath, the lands all around the damned city became deserted wastes, and its very existence was struck from the maps of Shurima. It was hoped, perhaps foolishly, that the horrors unleashed there would eventually be forgotten…", "en_pl": "A great and terrible battle was fought against the Void before the walls of ancient Icathia. In the aftermath, the lands all around the damned city became deserted wastes, and its very existence was struck from the maps of Shurima. It was hoped, perhaps foolishly, that the horrors unleashed there would eventually be forgotten…", "en_sg": "A great and terrible battle was fought against the Void before the walls of ancient Icathia. In the aftermath, the lands all around the damned city became deserted wastes, and its very existence was struck from the maps of Shurima. It was hoped, perhaps foolishly, that the horrors unleashed there would eventually be forgotten…", "en_us": "A great and terrible battle was fought against the Void before the walls of ancient Icathia. In the aftermath, the lands all around the damned city became deserted wastes, and its very existence was struck from the maps of Shurima. It was hoped, perhaps foolishly, that the horrors unleashed there would eventually be forgotten…", "es_ar": "Una gran y terrible batalla fue librada contra el Vacío ante los muros de la antigua Icathia. Al finalizar la batalla, las tierras circundantes de la ciudad maldita se convirtieron en páramos desiertos y su mera existencia se borró de los mapas de Shurima. Se esperaba, quizás tontamente, que los horrores allí desatados se hubieran olvidado con el paso del tiempo...", "es_es": "Una gran y terrible batalla se libró contra el Vacío ante los muros de la antigua Icathia. Tras la batalla, los territorios circundantes de la ciudad condenada se convirtieron en páramos desérticos y su existencia fue borrada de los mapas de Shurima. Se esperaba, tal vez ingenuamente, que los horrores desatados allí fuesen olvidados...", "es_mx": "Una gran y terrible batalla fue librada contra el Vacío ante los muros de la antigua Icathia. Al finalizar la batalla, las tierras circundantes de la ciudad maldita se convirtieron en páramos desiertos y su mera existencia se borró de los mapas de Shurima. Se esperaba, quizás tontamente, que los horrores allí desatados se hubieran olvidado con el paso del tiempo...", "fr_fr": "Une grande et terrible bataille contre le Néant eut lieu devant les murs de l'antique Icathia. Elle changea en friches infertiles les terres qui bordaient la cité maudite, et son existence fut purement et simplement rayée de la carte de Shurima. Certains pensaient, naïvement, que les horreurs qui s'y déchaînèrent finiraient par tomber dans l'oubli…", "hu_hu": "Az ősi Ikáthia falai előtt hatalmas és iszonyatos csata folyt az Üresség ellen. A csata után az elátkozott várost körülvevő vidék kietlen pusztává változott. Területét kiradírozták a shurimai térképekről, hogy még a létezéséről se tudjon senki. Ostoba módon abban reménykedtek, hogy az elszabadult szörnyűségekről idővel megfeledkezhetnek...", "id_id": "Perang besar dan mengerikan pernah terjadi melawan Void di hadapan dinding Icathia kuno. Setelahnya, seluruh lahan di sekitarnya menjadi gurun kosong, dan keberadaannya dihapus dari peta Shurima. Dengan harapan, mungkin, kengerian yang terbebas itu akan dilupakan...", "it_it": "Davanti alle mura di Icathia si consumò una grande e terribile battaglia contro il Vuoto. Quando si concluse, l'esistenza della città maledetta venne cancellata dalle mappe di Shurima e tutte le terre circostanti divennero lande deserte. Si sperava, forse scioccamente, che gli orrori scatenati quel giorno sarebbero stati dimenticati...", "ja_jp": "かつて、古代イカシアの防壁を前にして行われたヴォイドとの凄惨な大戦があった。その結果、地獄と化した街の周辺一帯はすべて人の住めない荒れ地となり、シュリーマの地図からもみ消されることとなった。人々は、彼の地に解き放たれた恐怖がやがて忘れ去られることを願った…たとえそれが、愚かな願いだったとしても。", "ko_kr": "고대 도시 이케시아의 장벽 앞에서 공허와의 위대하고도 끔찍한 전투가 펼쳐졌습니다. 그 후, 그 저주받은 도시 주변의 땅은 모두 황무지로 변해 버렸고 슈리마 지도상에서 완전히 사라졌습니다. 어리석은 바람일지 모르나, 인간들은 한때 자신들의 땅을 뒤흔들었던 공허의 공포가 사라지기만을 바랄 뿐이었습니다.", "ms_my": "Pertempuran yang hebat ke atas Void di sebalik dinding Icathia purba. Selepas tragedi itu berlaku, tanah di sekitarnya musnah, dan kewujudannya dipadam daripada peta Shurima. Mungkin ia akan dilupakan…", "pl_pl": "Przed murami starożytnej Icathii rozegrała się wielka i okropna bitwa z Pustką. Po zakończeniu starcia ziemie wokół przeklętego miasta przeistoczyły się w pustkowia, a osada ta zniknęła z map Shurimy. Ówcześni ludzie mieli nadzieję, być może naiwną, że potwory tam wyzwolone czeka zapomnienie...", "pt_br": "Uma grande e terrível batalha foi travada contra o Vazio diante dos muros da antiga Icathia. No final, as terras em volta da cidade em ruínas se tornaram áreas devastadas e até sua existência foi varrida dos mapas de Shurima. Havia uma esperança, talvez ingênua, de que os horrores liberados lá fossem um dia esquecidos…", "ro_ro": "În fața zidurilor Icathiei antice s-a purtat o luptă măreață și teribilă împotriva Vidului. În urma ei, întregul ținut din jurul orașului blestemat a devenit un deșert și până și dovezile că a existat vreodată au fost șterse de pe hărțile Shurimei. Oamenii sperau, probabil prostește, ca ororile dezlănțuie acolo să fie în cele din urmă uitate...", "ru_ru": "Когда-то под стенами древней Икатии гремела великая и ужасная битва с Бездной. Впоследствии земли вокруг проклятого города превратились в заброшенные пустоши, а само поселение исчезло с карт Шуримы. Наверное, глупо было надеяться, что ужас, который тогда вырвался на свободу, когда-нибудь сотрется из нашей памяти.", "th_th": "สงครามครั้งใหญ่ครั้งหนึ่งกับ Void ซึ่งเต็มไปด้วยความสูญเสีย เกิดขึ้นที่กำแพงโบราณแห่ง Icathia ภายหลังสงครามจบลง ดินแดนรอบ ๆ เมืองที่ล่มสลายนั้นกลับกลายเป็นทะเลทรายที่ว่างเปล่า การมีตัวตนอยู่ของเมือง ๆ นี้ถูกลบหายไปจากแผนที่ของ Shurima ผู้คนต่างคาดหวัง บ้างอาจดูเป็นความหวังลม ๆ แล้ง ๆ ว่าเหตุการณ์ที่เกิดขึ้นจะถูกลบเลือนไปตามกาลเวลา...", "tr_tr": "Antik Icathia'nın duvarlarında Hiçlik'e karşı muazzam ve feci bir savaş verilmişti. Savaşın ardından bu lanetli şehrin etrafındaki bütün alan boşaltılmış ve hakkındaki bilgiler Shurima haritalarından silinmişti. Belki de safça bir umutla orada peyda olan dehşet dolu varlıkların böylece unutulacağı düşünülmüştü.", "vn_vn": "Trận chiến ác liệt nhất với Hư Không diễn ra ngoài tường thành Icathia. Khi nó kết thúc, cả vùng đất xung quanh biến thành hoang mạc, và sự tồn tại của thành phố biến mất trên bản đồ Shurima. Người ta hy vọng, dù có hơi ngu ngốc, rằng nỗi kinh hoàng tại đây cuối cùng sẽ bị lãng quên...", "zh_cn": "古艾卡西亚的城墙脚下曾经有过一场残忍的大战。战后的余波将城市周围的土地全部变成了荒漠，也将这座受诅咒的城市从恕瑞玛的地图上抹去了。有人不乏天真地希望，在那儿肆虐的恐怖最终会被遗忘……", "zh_tw": "很久很久以前，伊卡西亞的城牆之外發生了一場偉大的戰役，雖然最後虛空被擊退，但戰果十分慘烈。在這場浩劫過後，那座被詛咒的城市周遭變成了一片荒土，也漸漸的消弭在蘇瑞瑪的地圖之中。人們愚昧的希望著，能夠完全遺忘這裡發生的慘事……。"}, "uri": "https://universe-meeps.leagueoflegends.com/v1/assets/images/void-the-fall-of-icathia.jpg", "encoding": "image/jpeg", "width": 1920, "height": 866, "x": 1331, "y": 414, "featured-champions": []}, "word-count": 6036, "minutes-to-read": 22, "featured-champions": [{"type": "champion", "release-date": "2009-02-21", "name": "Jax", "slug": "jax", "echelon": 0, "associated-faction": "", "associated-faction-slug": "unaffiliated", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Jax_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 949, "y": 35, "featured-champions": []}, "role": [{"name": "Fighter", "slug": "fighter"}, {"name": "Assassin", "slug": "assassin"}]}, {"type": "champion", "release-date": "2009-04-18", "name": "Zilean", "slug": "zilean", "echelon": 0, "associated-faction": "", "associated-faction-slug": "unaffiliated", "image": {"type": "image", "title": {"en_us": ""}, "subtitle": "", "description": "", "uri": "https://ddragon.leagueoflegends.com/cdn/img/champion/splash/Zilean_0.jpg", "encoding": "image/jpeg", "width": 1215, "height": 717, "x": 746, "y": 7, "featured-champions": []}, "role": [{"name": "Support", "slug": "support"}, {"name": "Mage", "slug": "mage"}]}], "release-date": "2018-03-02T08:00:00.000Z", "url": "/en_us/story/where-icathia-once-stood"}]}